Repository: dirkhusemann/zenphoto
Catalog: zp-core/locale/*/LC_MESSAGES/zenphoto.po
Languages: hu_hu, sl_si

source: latest comments
hu_hu: legújabb hozzászólások
sl_si: zadnji komentarji

source: by
hu_hu: itt:
sl_si: napisal/a

source: latest news and pages comments
sl_si: zadnji komentarji na novice in strani

source: Latest Albums
sl_si: Zadnji albumi

source: (%s: 1 new image)
sl_si: (%s: 1 nova slika)

source: (%1$s: %2$s new images)
sl_si: (%1$s: %2$s novih slik)

source: Last update: %s
sl_si: Zadnjič posodobljeno: %s

source: (%s: 1 image)
sl_si: (%s: 1 slika)

source: (%1$s: %2$s images)
sl_si: (%1$s: %2$s slik)

source: Date: %s
sl_si: Datum: %s

source: Object not found
hu_hu: nem található
sl_si: ne najdem

source: Gallery Index
hu_hu: Galeria index
sl_si: Spisek galerij

source: The Zenphoto object you are requesting cannot be found.
hu_hu: A kért Zenphoto objektum nem található.
sl_si: Ne najdem Zenphotovega objekta, ki ste ga zahtevali.

source: Image: %s
sl_si: Slika: %s

source: Page: %s
sl_si: Stran: %s

source: Albums Index
hu_hu: Album index
sl_si: Spisek albumov

source: View album:
hu_hu: Album megnyitása:
sl_si: Oglej si album:

source: prev
hu_hu: vissza
sl_si: nazaj

source: next
hu_hu: tovább
sl_si: naprej

source: <strong>Tags:</strong>
hu_hu: <strong>Címkék:</strong>
sl_si: <strong>Oznake:</strong>

source: View Slideshow
hu_hu: Dia vetítés
sl_si: Oglej si predstavitev

source: Album RSS
sl_si: RSS za album

source: Archive View
hu_hu: Archívum
sl_si: Arhivski pogled

source: Gallery RSS
hu_hu: Galeria RSS
sl_si: RSS za galerijo

source: Popular Tags
hu_hu: Népszerű címkék:
sl_si: Pogoste oznake

source: Previous Image
hu_hu: Előző kép
sl_si: Prejšnja slika

source: Next Image
hu_hu: Következő kép
sl_si: Naslednja slika

source: Image Info
hu_hu: Kép információk
sl_si: Informacije o sliki

source: Comments (%u)
sl_si: Komentarji (%u)

source: Edit
hu_hu: Szerkesztés
sl_si: Urejanje

source: Add a comment:
hu_hu: Szólj hozzá:
sl_si: Dodaj komentar:

source: Name:
hu_hu: Név:
sl_si: Ime:

source: don't publish
hu_hu: nem publikus
sl_si: ne objavi

source: E-Mail:
hu_hu: E-Mai:
sl_si: E-pošta:

source: Site:
hu_hu: Weboldal:
sl_si: Spletna stran:

source: Enter Captcha:
hu_hu: Biztonsági kód:
sl_si: Vpiši Captcha:

source: Private (don't publish)
hu_hu: Privát (nem publikus)
sl_si: Zasebno (ne objavi)

source: Add Comment
hu_hu: Megjegyzés hozzáfűzése
sl_si: Dodaj komentar

source: Comments are closed.
hu_hu: A hozzászólások fel vannak függesztve.
sl_si: Komentarji so zaprti.

source: Subscribe to comments
sl_si: Vir RSS za komentarje

source: Search
hu_hu: Keresés
sl_si: Iskanje

source: Total matches for <em>%1$s</em>: %2$u
sl_si: Vseh zadetkov za <em>%1$s</em>: %2$u

source: Date:
hu_hu: Dátum:
sl_si: Datum:

source: Sorry, no image matches. Try refining your search.
hu_hu: Sajnos nincs találat. Próbáld módosítani a keresést.
sl_si: Žal mi je, ni zadetka. Poskusite z drugimi iskalnimi pogoji.

source: Allow comments
hu_hu: Hozzászólások engedélyezése
sl_si: Dovoli komentarje

source: Check to enable comment section.
hu_hu: Aktiváld a hozzászólások engedélyeséséhez.
sl_si: Kljukica pomeni, da so komentarj dovoljeni.

source: Allow search
hu_hu: Keresés engedélyezése
sl_si: Dovoli iskanje

source: Check to enable search form.
hu_hu: Pipáld be a kereső engedélyeséséhez
sl_si: Kljukica pomeni, da je iskanje omogočeno.

source: Theme colors
hu_hu: Téma színei
sl_si: Barvna shema

source: Select the colors of the theme
hu_hu: A téma színeinek kiválasztása
sl_si: Izberite barve za temo

source: The default theme in 4 distinct flavors. After choosing this theme you can pick the theme color by going to the Admin Options tab and changing the <em>Theme colors</em> option.
hu_hu: Az alapértelmezett téma 4 különböző változata. A téma kiválasztása után az Admin-beállításokban változtatható a <em>Téma színe</em> beállítás.
sl_si: Privzeta tema v 4 okusih. Potem ko izberete to temo, lahko spremenite barvno shemo v zavihku možnosti/teme pri možnosti <em>Barvna shema</em>.

source: Main Index
sl_si: Glavna stran

source: Home
sl_si: Domov

source: Google Map
sl_si: Googlov Zemljevid

source: For the best viewing experience
hu_hu: A legjobb nézethez
sl_si: Za najboljši izgled

source: Get Adobe Flash.
hu_hu: Szerezz Adobe Flash-et.
sl_si: namestite Adobe Flash.

source: View Gallery Without Flash
hu_hu: Galeria megtekintése Flash nélkül
sl_si: Ogled galerije brez Flasha

source: Album is empty
hu_hu: Az album üres
sl_si: Album je prazen

source: Open In New Window
hu_hu: Megnyitás új ablakban
sl_si: Odpri v novem oknu

source: Archive
hu_hu: Archív
sl_si: Arhiv

source: Images By Date
hu_hu: Képek dátum szerint
sl_si: Slike glede na datum

source: Contact
sl_si: Kontakt

source: Please use the form below to contact us.
sl_si: Prosim, uporabite spodnji obrazec za kontakt.

source: Open in a new window
hu_hu: Megnyitás új ablakban
sl_si: Odpri v novem oknu

source: There were no images from which to select the random heading.
sl_si: Ne morem pripraviti naključne glave, ker ni nobene slike.

source: Random picture...
hu_hu: Véletlenszerű kép...
sl_si: Naključna slika...

source: %u image
sl_si: %u slika

source: Album %1$u of %2$u
sl_si: Album %1$u od %2$u

source: Photo %1$u of %2$u
sl_si: Slika %1$u od %2$u

source: Albums %1$u-%2$u of %3$u
sl_si: Albumi %1$u-%2$u od %3$u

source: Photos %1$u-%2$u of %3$u
sl_si: Slike %1$u-%2$u od %3$u

source: Effervescence %s (not found)
sl_si: Effervescence %s (ne najdem)

source: Effervescence %1$s %2$s (not found)
sl_si: Effervescence %1$s %2$s (ne najdem)

source: The album is password protected.
sl_si: Ta album je zaščiten z geslom.

source: The album is not published.
sl_si: Ta album ni objavljen.

source: View the Album: %s
sl_si: Oglej si album: %s

source: The image is marked not visible.
sl_si: Slika je označena kot nevidna.

source: View the image: %s
sl_si: Oglej si sliko: %s

source: %1$u hit on this %2$s
sl_si: %1$u ogled za to sliko

source: %u Subalbum
sl_si: %u podalbum

source: %u Image
sl_si: %u slika

source: %u Comment
sl_si: %u komentar

source: Contact us
sl_si: Pišite

source: Register for this site
sl_si: Včlanite se

source: image details from exif
hu_hu: Kép információk Exif- ből
sl_si: Podrobnosti slike iz zapisa exif

source: <h3>No Comments</h3>
sl_si: <h3>Brez komentarja</h3>

source: <h3>1 Comment</h3>
sl_si: <h3>1 komentar</h3>

source: <h3>%u Comments</h3>
sl_si: <h3>%u komentarjev</h3>

source: Leave a Reply
hu_hu: Válaszolj
sl_si: Odgovori

source: Name
hu_hu: Név
sl_si: Ime

source: Email
sl_si: E-pošta

source: Website
hu_hu: Honlap
sl_si: Domača stran

source: Enter Captcha
hu_hu: Biztonsági kód
sl_si: Vpiši Captcha

source: Submit
hu_hu: Elküld
sl_si: Pošlji

source: Closed for comments.
hu_hu: Megjegyzések letiltva.
sl_si: Komentiranje ni omogočeno.

source: zenphoto gallery
sl_si: galerija Zenphoto

source: Picture of the day
sl_si: Slika dneva

source: Visit the photo gallery
sl_si: Obišči galerijo

source: Comments: %d
sl_si: Komentarjev: %d

source: Categories:
sl_si: Kategorij:

source: next &raquo;
sl_si: naprej &raquo;

source: &laquo; prev
sl_si: &laquo; nazaj

source: News
sl_si: Novice

source: Category
sl_si: Kategorija

source: Comments
hu_hu: Hozzászólások
sl_si: Komentarji

source: says:
hu_hu: írta:
sl_si: pravi:

source: Comments:
sl_si: Komentarji:

source: Register
sl_si: Včlanite se

source: get Adobe Flash.
hu_hu: Szerezz be Adobe Flash-t.
sl_si: naloži Adobe Flash

source: Enter your search criteria.
hu_hu: Add meg a keresési kritériumokat.
sl_si: Vnesite kriterije iskanja.

source: Sorry, no matches for <em>%s</em>. Try refining your search.
sl_si: Žal mi je, ni zadetka za <em>%s</em>. Poskusite z drugimi iskalnimi kriteriji.

source: Simpleviewer requires <em>mod_rewrite</em> to be set. Simpleviewer is disabled.
hu_hu: A Simpleviewer-nek szüksége van a <em>mod_rewrite</em> funkcióra.A Simpleviewer ki lett kapcsolva.
sl_si: Simpleviewer zahteva, da je <em>mod_rewrite</em> nastavljen. Simpleviewer je onemogočen.

source: News articles
sl_si: Novice

source: Gallery
hu_hu: Galéria
sl_si: Galerija

source: Pages
sl_si: Strani

source: Gallery And News
sl_si: Galerija in novice

source: Gallery and News
sl_si: Galerija in novice

source: Theme logo
hu_hu: A téma logója
sl_si: Logotip teme

source: The text for the theme logo
hu_hu: Szöveg a téma logójához
sl_si: Besedilo za logotip teme

source: Allow page & news comments
sl_si: Dovoli komentiranje strani in novic

source: Set to enable comment section for news and pages.
sl_si: Kljukica pomeni, da so komentarj dovoljeni na novicah in straneh.

source: Watermark head image
sl_si: Vodni žig naslovne slike

source: Check to place a watermark on the heading image. (Image watermarking must be set.)
hu_hu: Pipáld be, ha a vízjelet szeretnél használni a heading_képeken (a vízjelezésnek aktívnak kell lennie).
sl_si: Kljukica pomeni, da bo na naslovni sliki vodni žig. (Vodno žigosanje mora biti omogočeno.)

source: Slideshow
hu_hu: Vetítés
sl_si: Predstavitev

source: Check to enable slideshow for the <em>Smoothgallery</em> personality.
hu_hu: Pipáld ki a vetítés engedélyezéséhez <em>Smoothgallery</em> módban.
sl_si: Kljukica pomeni, da je predstavitev (slideshow) omogočena za karakter <em>Smoothgallery</em>.

source: Graphic logo
hu_hu: Grafikus logó
sl_si: Logotip

source: Select a logo (PNG files in the images folder) or leave empty for text logo.
hu_hu: Válaszz egy logót (egy PNG fájlt az images mappából), vagy hagyd üresen ha szöveges logót szeretnél.
sl_si: Izberite logotip (datoteke PNG v mapi s slikami) ali pustite prazno za logotip z besedilom.

source: Theme personality
hu_hu: Megjelenés módja
sl_si: Karakter

source: Image page
hu_hu: Kép oldal
sl_si: Stran s sliko

source: Select the theme personality
hu_hu: Válassz megjelenési módot
sl_si: Izberite karakter teme.

source: <a href="http://sblog.angoulvant.net/">Stephane Angoulvant</a> with modifications by <a href="http://stephen.sbillard.org/">Stephen Billard</a>
sl_si: <a href="http://sblog.angoulvant.net/">Stephane Angoulvant</a> z modifikacijami <a href="http://stephen.sbillard.org/">Stephena Billarda</a>

source: Based on Effervescence 1.1 with multiple personalities (slimbox, simpleviewer and smoothgallery) added. Select different color schemes and personalities from the Admin Options tab.
hu_hu: Az Effervescence 1.1 alapján, klönböző személyreszabható kiegészítőkkel (slimbox, simpleviewer and smoothgallery). A színsémák kiválasztása és az egyéb beállítások a Admin beállításokban lehetséges.
sl_si: Temelji na Effervescence 1.1 z dodanimi karakterji (slimbox, simpleviewer in smoothgallery). Izberite barvno shemo in karakter v zavihku administrator.

source: The Zenphoto object you are requesting cannot be found,
hu_hu: A kért Zenphoto objektum nem található,
sl_si: Ne najdem Zenphotovega objekta, ki ste ga zahtevali,

source: Prev Album
hu_hu: Előző album
sl_si: Prejšnji album

source: Next Album
hu_hu: Következő album
sl_si: Naslednji album

source: No comments
hu_hu: Nincs hozzászólás
sl_si: Brez komentarjev

source: <strong>One</strong> comment
hu_hu: <strong>Egy</strong> hozzászólás
sl_si: <strong>En</strong> komentar

source: <strong>%u</strong> comments on this album:
sl_si: <strong>%u</strong> komentarjev na ta album:

source: E-Mail (won't be public):
hu_hu: E-mail (nem lesz mejelenítve)
sl_si: e-pošta (ne bo objavljena):

source: Enter
hu_hu: Írd be
sl_si: Vnesi

source: %u seconds
sl_si: %u sekund

source: Original Size:
hu_hu: Eredeti méret:
sl_si: Velikost originala:

source: The flv_playlist plugin is not enabled. It must be enabled for this option to have effect.
hu_hu: Az flv_playlist bővítmény nincs engedélyezve. Engedélyezned kell, hogy ez az opció használható lehessen.
sl_si: Vtičnik flv_playlist ni omogočen. Za to opcijo mora biti omogočen.

source: The flvplayer plugin is not enabled. It must be enabled for this option to have effect.
hu_hu: Az flvplayer bővítmény nincs engedélyezve. Engedélyezned kell, hogy ez az opció használható lehessen.
sl_si: Vtičnik flvplayer ni omogočen. Za to opcijo mora biti omogočen.

source: Use flv playlist
hu_hu: Flv lejátszólista használata
sl_si: Uporabi spisek flv

source: flv playlist option
hu_hu: flv lejátszólista beállítások
sl_si: Spisek flv

source: Players
hu_hu: Lejátszók
sl_si: Predvajalniki

source: Playlist
hu_hu: Lejátszólista
sl_si: Spisek

source: Select the option for the <em>flv_playlist()</em> function.
hu_hu: Az <em>flv_playlist()</em> funkció beállítása
sl_si: Izberite možnost za funkcijo <em>flv_playlist()</em>.

source: This theme was designed to show off many of ZenPhoto's features. It includes many template tags and doesn't look half bad. Also a great example if you want to make your own theme or integrate ZenPhoto into a blog.
hu_hu: Ez a téma úgy lett tervezve, hogy a ZenPhoto legtöbb tulajdonságát szemlélthesse. Sok sablon címkét tartalmaz, és nem is néz ki rosszul. Remekülszolgálhat példaként, ha saját témát készítesz, vagy ha egy blogba szeretnéd beépíteni a zenphoto-t.
sl_si: To je tema za razkazovanje stvari, ki jih zmore ZenPhoto. Vsebuje veliko oznak za predloge (oz. teme) in tudi še kar dobro izgleda. Tema je dober primer za učenje, če želite izdelati svojo temo, ali če bi radi integrirali ZenPhoto v svoj blog.

source: 1 photo
sl_si: 1 fotografija

source: %u photos
sl_si: %u fotografij

source: 1 album,&nbsp;1 photo
sl_si: 1 album,&nbsp;1 fotografija

source: %u album,&nbsp;1 photo
sl_si: %u album,&nbsp;1 fotografija

source: %1$u album,&nbsp;%2$u photos
sl_si: %1$u album,&nbsp;%2$u fotografij

source: 1 album,&nbsp;%u photos
sl_si: 1 album,&nbsp;%u fotografij

source: Next page
hu_hu: Következő oldal
sl_si: Naslednja stran

source: Album RSS feed
hu_hu: Album RSS
sl_si: Vir RSS za album

source: photos %1$u-%2$u of %3$u
sl_si: fotografije %1$u-%2$u od %3$u

source: prev page
hu_hu: előző oldal
sl_si: Prejšnja stran

source: next page
hu_hu: következő oldal
sl_si: Naslednja stran

source: All galleries
hu_hu: Az összes galéria
sl_si: Vse galerije

source: %u photo
sl_si: %u fotografija

source: 1 album,&nbsp;%u photo
sl_si: 1 album,&nbsp;%u fotografija

source: Gallery Feeds
hu_hu: Galéria RSS
sl_si: Viri RSS galerije

source: Photos
hu_hu: Képek
sl_si: Fotografije

source: Gallery Archive
hu_hu: Galéria archívum
sl_si: Arhiv galerije

source: <a href="http://stopdesign.com/templates/photos/">Photo Templates</a> from Stopdesign
sl_si: <a href="http://stopdesign.com/templates/photos/">Predloge za slike</a> od Stopdesigna

source: %1$u of %2$u photos
sl_si: %1$u od %2$u fotografij

source: image details
hu_hu: Részletes képtulajdonságok
sl_si: podrobnosti slike

source: Full Size
hu_hu: Teljes méret
sl_si: Izvorna slika

source: SHOW
hu_hu: MUTAT
sl_si: POKAŽI

source: HIDE
hu_hu: ELREJT
sl_si: SKRIJ

source: No comments yet
hu_hu: Még nincs hozzászólás
sl_si: Brez komentarjev

source: 1 comment so far
hu_hu: 1 hozzászólás összesen
sl_si: 1 komentar

source: %u comments so far
sl_si: %u komentarjev

source: Link to Comment %u
sl_si: Povezava do komentarja %u

source: %s wrote:
sl_si: %s pravi:

source: Comments are closed
hu_hu: Hozzászólás nem lehetséges
sl_si: Komentarji so zaprti.

source: Add a comment
hu_hu: Megjegyzés hozzáfűzése
sl_si: Dodaj komentar

source: (not displayed)
hu_hu: (nem megjelenített)
sl_si: (ni prikazano)

source: URL
sl_si: Spletni naslov (URL)

source: Private comment
hu_hu: Privát hozzászólás
sl_si: Zaseben komentar

source: Comment
hu_hu: Hozzászólás
sl_si: Komentar

source: Avoid clicking &ldquo;Post&rdquo; more than once.
hu_hu: Óvakodj az &ldquo;Elküld&rdquo; gomb többszöri megnyomásától.
sl_si: Na gumb &ldquo;Post&rdquo; kliknite samo enkrat.

source: Previous
hu_hu: Előző
sl_si: Nazaj

source: Next
hu_hu: Következő
sl_si: naprej

source: <a href="http://stopdesign.com/templates/photos/">Photo Templates</a> from Stopdesign.
sl_si: <a href="http://stopdesign.com/templates/photos/">Predloge za slike</a> od Stopdesigna.

source: Recently Updated Galleries
hu_hu: Nemrég frissített galériák
sl_si: Nedavno posodobljene galerije

source: View album: %s
sl_si: Oglej si album: %s

source: Recent images
hu_hu: Friss képek
sl_si: Nedavne slike

source: View image:
hu_hu: Kép megnyitása:
sl_si: Poglej sliko:

source: Random images
hu_hu: Véletlenszerű képek
sl_si: Naključne slike

source: Gallery data
hu_hu: Galéria adatok
sl_si: Podatki o galeriji

source: Galleries
hu_hu: Galériák
sl_si: Galerije

source: %u albums,&nbsp;1 photo
sl_si: %u albumov,&nbsp;1 fotografija

source: %1$u albums,&nbsp;%2$u photos
sl_si: %1$u albumov,&nbsp;%2$u fotografij

source: %u albums
sl_si: %u albumov

source: Sorry, no matches. Try refining your search.
hu_hu: Bocsi, nincs találat. Próbálj mást keresni.
sl_si: Žal mi je, ni zadetka. Poskusite z drugimi iskalnimi pogoji.

source: Mini slide selector
hu_hu: Mini diaválasztó
sl_si: Mini "diapozitivi"

source: Select what you want for the six special slides.
hu_hu: Válaszd ki, mit szeretnél használni hat speciális diaként.
sl_si: Izberite, kaj želite prikazati v šestih posebnih "diapozitivih".

source: Ported to zenPhoto by Mark Galeassi and Stephen Billard
hu_hu: A zenphoto alá portolta Mark Galeassi és Stephen Billard
sl_si: Za ZenPhoto priredila Mark Galeassi in Stephen Billard

source: A theme based on the design from <a href="http://stopdesign.com/templates/photos/">Douglas Bowman</a>. This theme is licensed under the <a href="http://creativecommons.org/licenses/by-nc-sa/2.5/">Creative Commons Attribution-NonCommercial-ShareAlike 2.5</a> License.
hu_hu: Ez a téma <a href="http://stopdesign.com/templates/photos/">Douglas Bowman</a> tervein alapul. A téma licensze: <a href="http://creativecommons.org/licenses/by-nc-sa/2.5/">Creative Commons Attribution-NonCommercial-ShareAlike 2.5</a> .
sl_si: Tema na osnovi dizajna <a href="http://stopdesign.com/templates/photos/">Douglasa Bowmana</a>. Za to temo velja licenca <a href="http://creativecommons.org/licenses/by-nc-sa/2.5/">Creative Commons Attribution-NonCommercial-ShareAlike 2.5</a>.

source: Image
hu_hu: Kép
sl_si: Slika

source: Theme page
hu_hu: Téma oldal
sl_si: Stran teme

source: Search gallery
sl_si: Iskanje po galeriji

source: Zenpage-default theme by <a href="http://zenpage.maltem.de">Malte Müller</a>
sl_si: Privzeta tema za Zenpage od <a href="http://zenpage.maltem.de">Maltea Müllera</a>

source: Powered by <a href="http://www.zenphoto.org" title="A simpler web photo album"><span id="zen-part">zen</span><span id="photo-part">PHOTO</span></a> <span id="IE-clear-part">with</span> <a href="http://zenpage.maltem.de"><span id="zen-part">zen</span><span id="photo-part">PAGE</span></a>
sl_si: Gnano z <a href="http://www.zenphoto.org" title="Preprostejši spletni fotoalbum"><span id="zen-part">Zen</span><span id="photo-part">PHOTO</span></a> <span id="IE-clear-part">in</span> <a href="http://zenpage.maltem.de"><span id="zen-part">Zen</span><span id="photo-part">PAGE</span></a>

source: &laquo; prev thumbs
sl_si: &laquo; prejšnje sličice

source: next thumbs &raquo;
sl_si: naslednje sličice &raquo;

source: Total matches for
hu_hu: Találatok a keresett szóra
sl_si: Vseh zadetov za

source: News and Gallery
sl_si: Novice in galerija

source: Check to enable comment section for images.
sl_si: Kljukica pomeni, da je komentiranje slik dovoljeno.

source: Use Thickbox
sl_si: Uporabi Thickbox

source: Check to display of the full size image with Thickbox.
sl_si: Dodajte kljukico, če želite prikazati izvorne slike s Thickoboxom.

source: News on index page
sl_si: Novice na naslovni strani

source: Enable this if you want to show the news section's first page on the index.php page.
sl_si: Dodajte kljukico, če želite prikazati novice na prvi strani (kot blog).

source: Homepage
sl_si: Naslovna (domača) stran

source: Choose here any <em>unpublished Zenpage page</em> (listed by <em>titlelink</em>) to act as your site's homepage instead the normal gallery index. <strong>Note:</strong> This of course overrides the <em>News on index</em> option and your theme must be setup for this feature. Visit the theming tutorial for details.!
sl_si: Tu lahko izberete katerokoli <em>neobjavljeno Zenpagevo stran</em> (na spisku so <em>titlelink</em>), ki bo prikazana kot vaša domača stran, namesto običajne naslovne strani galerije. <strong>Opomba:</strong> To seveda prekliče nastavitev <em>Novice na naslovni strani</em>, poleg tega pa mora vaša tema podpirati to možnost. Oglejte si navodila za izdelavo tem za podrobnosti!

source: No unpublished pages available
sl_si: Nobenih neobjavljenih strani ni na voljo

source: none
sl_si: nič

source: The zenpage CMS plugin default theme. It does also work without Zenpage installed as a normal theme. It containts extra support for print_album_menu plugin, the dynamic_locale plugin and the new paged_thumbs_nav plugin.
sl_si: Privzeta tema za vtičnik Zenpage. Deluje tudi, če vtičnika Zenpage ne vklopite. Podpira tudi vtičnike print_album_menu, dynamic_locale in paged_thumbs_nav.

source: Zenphoto Error:</strong> the requested object was not found.
sl_si: Napaka:</strong> Zenphoto ne najde zahtevanega objekta.

source: Return to %s
sl_si: Vrni se na %s

source: No album provided to sort.
hu_hu: Nincs elrendezhető album.
sl_si: Nobenega albuma nimam, da ga razvrstim.

source: You do not have rights to sort this album
hu_hu: Nincs jogod az album elrendezéséhez
sl_si: Nimate pravice za razvrščanje tega albuma

source: back to the album list
hu_hu: vissza az albumlistához
sl_si: nazaj na spisek albumov

source: Back to the list of albums
hu_hu: Vissza az albumok listájához
sl_si: Nazaj na spisek albumov

source: edit album
hu_hu: album szerkesztése
sl_si: uredi album

source: Edit Album
hu_hu: Album szerkesztése
sl_si: Urejanje albuma

source: view album
hu_hu: album megnézése
sl_si: oglej si album

source: View Album
hu_hu: Album megtekintése
sl_si: Oglej si album

source: Image order saved
hu_hu: A képek sorrendje elmentve
sl_si: Vrstni red slik je shranjen

source: Sort the images by dragging them...
hu_hu: Rendezd el a képeket azok húzásával, áthelyezésével.
sl_si: Slike razvrstite tako, da jih povlečete z miško.

source: Clearing and refreshing cache for %s
sl_si: Brišem in osvežujem predpomnilnik za %s

source: Refreshing cache for %s
sl_si: Osvežujem predpomnilnik za %s

source: Finished: Total of %u images.
sl_si: Končano: skupaj %u slik.

source: Back
hu_hu: Vissza
sl_si: Nazaj

source: edit comment
hu_hu: hozzászólás szerkesztése
sl_si: Urejanje komentarja

source: Author:
hu_hu: Szerző:
sl_si: Avtor:

source: Web Site:
hu_hu: Honlap:
sl_si: Spletna stran:

source: Date/Time:
hu_hu: Dátum / idő:
sl_si: Čas:

source: Comment:
hu_hu: Hozzászólás:
sl_si: Komentar:

source: Save
hu_hu: Mentés
sl_si: Shrani

source: Cancel
hu_hu: Mégsem
sl_si: Prekliči

source: Comment management:
sl_si: Upravljanje s komentarji:

source: Comment is unapproved
sl_si: Komentar ni odobren

source: Approve
sl_si: Odobri

source: Approve this comment
sl_si: Odobri ta komentar

source: Comment is approved
sl_si: Komentar je odobren

source: Unapprove
sl_si: Zavrni

source: Unapprove this comment
sl_si: Komentar ne bo več odobren

source: Comment is private
sl_si: Komentar je zaseben

source: Comment is public
sl_si: Komentar je javen

source: Comment is anonymous
sl_si: Komentar je anonimen

source: Comment is not anonymous
sl_si: Komentar ni anonimen

source: Are you sure you want to delete this comment?
sl_si: Ali ste prepričani, da želite zbrisati ta komentar?

source: Delete this comment.
hu_hu: Hozzászólás törlése.
sl_si: Zbriši ta komentar.

source: Delete this comment
sl_si: Zbriši ta komentar

source: Comments deleted successfully.
hu_hu: A hozzászólások sikeresen törölve lettek.
sl_si: komentarjev uspešno zbrisanih.
