Repository: dirkhusemann/zenphoto
Catalog: zp-core/locale/*/LC_MESSAGES/zenphoto.po
Languages: hu_hu, sl_si

source: External Flash
hu_hu: Külső vaku
sl_si: Zunanja bliskavica

source: Continuous
hu_hu: Folyamatos
sl_si: Zaporedno

source: One-Shot
hu_hu: Egy felvételes
sl_si: enkraten posnetek

source: AI Focus
hu_hu: AI fókusz
sl_si: Samodejno ostrenje

source: Manual Focus
hu_hu: Manuális fókusz
sl_si: Ročno ostrenje

source: Single
hu_hu: Egyszerű
sl_si: Posamično

source: Large
hu_hu: Nagy
sl_si: Velika

source: Medium
hu_hu: Közepes
sl_si: Srednja

source: Small
hu_hu: Kicsi
sl_si: Majhna

source: Full Auto
hu_hu: Teljesen automatikus
sl_si: Popolnoma samodejno

source: Fast Shutter
hu_hu: Gyors záridő:
sl_si: Kratka zaklopka

source: Slow Shutter
hu_hu: Lassú záridő:
sl_si: Hitra zaklopka

source: Night
hu_hu: Éjszaka
sl_si: Nočno

source: Black & White
hu_hu: Fekete-fehér
sl_si: Črnobelo

source: Sepia
hu_hu: Szépia
sl_si: Sepija

source: Sport
sl_si: Športno

source: Macro/Close-Up
hu_hu: Makró/Közelkép
sl_si: Makro/bližnji posnetek

source: Pan Focus
hu_hu: Panoráma fókusz
sl_si: široko ostrenje

source: High
hu_hu: Magas
sl_si: Visoko

source: Low
hu_hu: Alacsony
sl_si: Nizko

source: Center-weighted
hu_hu: Központi súlyozott
sl_si: Sredinsko uteženo

source: Close-up (Macro)
hu_hu: Közelkép (makró)
sl_si: Bližnji posnetek (Makro)

source: Auto Selected
hu_hu: Automatikus
sl_si: Samodejno izbrano

source: Right
hu_hu: Jobb
sl_si: Desno

source: Center
hu_hu: Közép
sl_si: Sredinsko

source: Left
hu_hu: Bal
sl_si: Levo

source: Auto-DEP
sl_si: Samodejno DEP

source: Flash Did Not Fire
hu_hu: A vaku nem volt használva
sl_si: Bliskavica se ni sprožila

source: External E-TTL
hu_hu: Külső E-TTL
sl_si: Zunanja, E-TTL

source: Internal Flash
hu_hu: Beépétett vaku
sl_si: Vgrajena bliskavica

source: FP sync used
hu_hu: FP szinkronizáció használva
sl_si: Uporabljena sinhronizacija FP

source: Cloudy
hu_hu: Felhős
sl_si: Oblačno

source: DaylightColor-fluorescence
hu_hu: Nappali szín, fluoreszkáló
sl_si: Dnevna svetloba-flourescenčno

source: White-fluorescence
hu_hu: Fehér-fluoreszcencia
sl_si: Bela-flourescenčno

source: Unknown:
hu_hu: Ismeretlen:
sl_si: Neznano:

source: Red-Eye Reduction
hu_hu: Vörösszem redukció
sl_si: Preprečevanje rdečih oči

source: Sports
hu_hu: Sport
sl_si: Športno

source: Manual Exposure
hu_hu: Manuális expozíció
sl_si: Ročna osvetlitev

source: No Warning
hu_hu: Nincs figyelmeztetés
sl_si: Brez opozoril

source: Warning
hu_hu: Figyelmeztetés
sl_si: Opozorilo

source: Auto Focus Good
hu_hu: Auto fókusz jó
sl_si: Samodejno izostreno

source: Out of Focus
hu_hu: Nem fókuszált
sl_si: Ni izostreno

source: Over Exposure
hu_hu: Túl exponált
sl_si: Predolga osvetlitev

source: Converter
hu_hu: Konverter
sl_si: Konverter

source: VGA Basic
hu_hu: VGA Alap
sl_si: VBA Osnovno

source: VGA Normal
hu_hu: VGA Normális
sl_si: VGA Običajno

source: VGA Fine
hu_hu: VGA Finom
sl_si: VGA Fino

source: SXGA Basic
hu_hu: SXGA Alap
sl_si: SXGA Osnovno

source: SXGA Normal
hu_hu: SXGA Normális
sl_si: SXGA Običajno

source: SXGA Fine
hu_hu: SXGA Finom
sl_si: SXGA Fino

source: Color
hu_hu: Szín
sl_si: Barvno

source: Bright+
hu_hu: Fényerő+
sl_si: Svetlost+

source: Bright-
hu_hu: Fényerő-
sl_si: Svetlost-

source: Contrast+
hu_hu: Kontraszt+
sl_si: Kontrast+

source: Contrast-
hu_hu: Kontraszt-
sl_si: Kontrast-

source: Preset
hu_hu: Előre beállított
sl_si: Privzeto

source: Did Not Fire
hu_hu: Nem volt használva
sl_si: Se ni sprožila

source: External
hu_hu: Külső
sl_si: Zunanja

source: On Camera
hu_hu: A kamerán
sl_si: Vgrajena

source: Standard
sl_si: Običajno

source: Black and White
hu_hu: Fekete-fehér
sl_si: Črnobelo

source: Auto, Focus button
hu_hu: Automatikus, fókusz gomb
sl_si: Samodejno, gumb za ostrenje

source: Auto, Continuous
hu_hu: Automatikus, folyamatos
sl_si: Samodejno, zaporedno

source: Mode 1
hu_hu: Mód 1
sl_si: Način 1

source: Mode 2
hu_hu: Mód 2
sl_si: Način 2

source: Simple
sl_si: Enostavno

source: High Sensitivity
hu_hu: Magas érzékenység
sl_si: Visoka občutljivost

source: No
hu_hu: Nem
sl_si: Ne

source: Low/High Quality
hu_hu: Originál kép minősége:
sl_si: Nizka/Visoka kvaliteta

source: Horizontal (normal)
hu_hu: Horizontális (normális)
sl_si: Vodoravno (običajno)

source: Rotate 90 CW
hu_hu: Elforgatás 90 fokkal jobbra
sl_si: Obrni 90 stopinj v desno

source: Rotate 270 CW
hu_hu: Elforgatás 270 fokkal jobbra
sl_si: Obrni 270 stopinj v desno

source: Natural
hu_hu: Természetes
sl_si: Naravno

source: Saving
sl_si: Shranjujem

source: Click to edit...
sl_si: Kliknite in uredite ...

source: Close
hu_hu: Bezárás
sl_si: Zapri

source: close
sl_si: zapri

source: or Esc Key
sl_si: ali tipko Esc

source: Prev
sl_si: nazaj

source: of
sl_si: od

source: show
sl_si: pokaži

source: omitted
sl_si: izpuščeno

source: Set if the field should be required, just shown or omitted
sl_si: Izberite, ali naj bo polje zahtevano, zgolj prikazano ali izpuščeno.

source: Intro text
sl_si: Uvodno besedilo

source: The intro text for your contact form
sl_si: Uvod za vaš obrazec.

source: Confirm text
sl_si: Potrditveno besedilo

source: Thanks text
sl_si: Zahvalno besedilo

source: Mail address
sl_si: Naslov e-pošte

source: 01. Title field
sl_si: 01. Naslov

source: Title field.
sl_si: Polje za naslov.

source: 02. Name field
sl_si: 02. Ime

source: Name field.
sl_si: Polje za ime.

source: 03. Company field
sl_si: 03. Podjetje

source: Country field.
sl_si: Polje za državo.

source: 04. Street field
sl_si: 04. Ulica

source: Street field.
sl_si: Polje za ulico.

source: 05. City field
sl_si: 05. Mesto

source: City field.
sl_si: Polje za mesto.

source: 06. Country field
sl_si: 06. Dežela

source: 07. E-mail field
sl_si: 07. E-pošta

source: E-mail field.
sl_si: Polje za e-poštni naslov.

source: 08. Website field
sl_si: 08. Spletna stran

source: Website field.
sl_si: Polje za naslov spletne strani (URL).

source: 09. Captcha field
sl_si: 09. Captcha

source: If Captcha should be required.
sl_si: Naj bo Captcha zahtevan?

source: 10. Phone field
sl_si: 10. Telefon

source: Phone number field.
sl_si: Polje za telefonsko številko.

source: 11. Subject field
sl_si: 11. Zadeva

source: Subject field.
sl_si: Polje za zadevo.

source: 12. Message field
sl_si: 12. Sporočilo

source: Message field.
sl_si: Polje za besedilo sporočila.

source: a <strong>title</strong>
sl_si: <strong>naslov</strong>

source: a <strong>name</strong>
sl_si: <strong>ime</strong>

source: a <strong>company</strong>
sl_si: <strong>podjetje</strong>

source: a <strong>street</strong>
sl_si: <strong>ulica</strong>

source: a <strong>city</strong>
sl_si: <strong>kraj</strong>

source: a <strong>country</strong>
sl_si: <strong>država</strong>

source: a <strong>valid email adress</strong>
sl_si: <strong>veljaven e-poštni naslov</strong>

source: a <strong>website</strong>
sl_si: <strong>spletna stran</strong>

source: a <strong>phone number</strong>
sl_si: <strong>telefon</strong>

source: a <strong>subject</strong>
sl_si: <strong>zadeva</strong>

source: a <strong>message</strong>
sl_si: <strong>sporočilo</strong>

source: <strong>the correct captcha verification code</strong>
sl_si: <strong>pravilen niz Captcha</strong>

source: <p style='color:red'>Please enter
sl_si: <p style='color:red'>Prosim, vnesite

source: and
sl_si: in

source: . Thanks.</p>
sl_si: . Hvala.</p>

source: Confirm
sl_si: Potrdi

source: Discard
sl_si: Zavrzi

source: Plugins
sl_si: Vtičniki

source: Email all posters when a new comment is made on an item.
sl_si: Ko kdorkoli napiše nov komentar, vsi, ki so kadarkoli komentirali isto stvar, dobijo sporočilo po e-pošti.

source: A reply has been posted on album "%1$s".
sl_si: Nekdo je komentiral album "%1$s".

source: A reply has been posted on article "%1$s".
sl_si: Nekdo je komentiral članek "%1$s".

source: A reply has been posted on page "%1$s".
sl_si: Nekdo je komentiral stran "%1$s".

source: Reply posted
sl_si: Nov komentar

source: Albums
hu_hu: Albumok
sl_si: Albumi

source: Check album names to be ignored.
sl_si: Izberite albume, ki jih želite izpustiti.

source: Check image suffixes to be ingnored.
sl_si: Izberite končnice slik, ki jih želite izpustiti.

source: <strong>You do not have ZZIPlib configured.</strong>
sl_si: <strong>Knjižnica ZZIPlib ni nastavljena.</strong>

source: Created by:
sl_si: Ustvaril:

source: Uploaded by:
sl_si: Naložil:

source: flow player width
hu_hu: flow player szélessége
sl_si: širina predvajalnika flow

source: flow player height
hu_hu: flow player magassága
sl_si: višina predvajalnika flow

source: Controls background color
hu_hu: Vezérlő háttérszín
sl_si: Barva ozadja za tipke

source: Background color of the controls.
hu_hu: A vezérlés háttérszíne.
sl_si: Barva ozadja za tipke za predvajanje, previjanje, itd.

source: Control area border color
hu_hu: A vezérlő keret színe
sl_si: Barva obrobe območja upravljalnika

source: Color of the border of the player controls
hu_hu: A lejátszó vezérlő keret színe
sl_si: Barva obrobe območja, v katerem so tipke za predvajanje, previjanje, itd.

source: Autoplay
hu_hu: Autostart
sl_si: Samodejno predvajanje

source: Should the video start automatically. Yes if selected.
hu_hu: Aktiváld, ha a videót automatikusan el szeretnéd állítani.
sl_si: Če želite, da se video začne samodejno predvajati, dodajte kljukico.

source: Background color
sl_si: Barva ozadja

source: Player background color
sl_si: Barva ozadja predvajalnika

source: The color of the player background.
sl_si: Barva ozadja celotnega predvajalnika.

source: low
sl_si: malo

source: medium
sl_si: srednje

source: high
sl_si: veliko

source: Controls border color
sl_si: Barva obrobe tipk

source: Controls autohide
sl_si: Samodejno skrivanje upravljalnika

source: never
sl_si: nikoli

source: always
sl_si: vedno

source: fit
sl_si: prilagojeno

source: orig
sl_si: originalno

source: scale
sl_si: raztegnjeno

source: Autostart
hu_hu: Automatikusan elindul
sl_si: Samodejno predvajanje

source: FLV Player version
sl_si: Predvajalnik FLV različica

source: Version 3
sl_si: Različica 3

source: Version 4
sl_si: Različica 4

source: Backcolor
hu_hu: Háttérszín
sl_si: Barva ozadja

source: Get Flash
hu_hu: Szerezz be Flash-t
sl_si: Naloži Flash

source: Map
sl_si: Zemljevid

source: Terrain
sl_si: Teren

source: Google Maps API key
hu_hu: Google Maps API kulcs
sl_si: Ključ API za Googlove Zemljevide

source: Allowed maps
sl_si: Dovoljeni zemljevidi

source: List
sl_si: Spisek

source: Map controls
sl_si: Upravljalniki zemljevida

source: Select the kind of map controls.
sl_si: Izberite vrsto upravljalnikov za zemljevid.

source: Map background
sl_si: Ozadje zemljevida

source: images
hu_hu: kép
sl_si: slik

source: %1$u new %2$s
sl_si: %1$u novih %2$s

source: Rating: %1$u (Votes: %2$u )
sl_si: Ocena: %1$u (Glasov: %2$u )

source: Views: %u
sl_si: Ogledov: %u

source: Rating: %1$u (Votes: %2$u)
sl_si: Ocena: %1$u (Glasov: %2$u)

source: Thumbs per page
sl_si: Sličic na stran

source: Counter
sl_si: Števec

source: Prevtext
sl_si: Nazaj

source: The text for the previous thumbs.
sl_si: Besedilo za prejšnje sličice.

source: Nexttext
sl_si: Naprej

source: The text for the next thumbs.
sl_si: Besedilo za naslenje sličice.

source: Crop width
sl_si: Širina izreza

source: The thumb crop width is the maximum width when height is the shortest side
sl_si: Širina izreza sličice je največja širina, kadar je višina krajša stranica.

source: Crop height
sl_si: Višina izreza

source: The thumb crop height is the maximum height when width is the shortest side
sl_si: Višina izreza sličice je največja višina, kadar je širina krajša stranica.

source: Crop
sl_si: Izrez

source: If checked the thumbnail will be a centered portion of the image with the given width and height after being resized to thumb size (by shortest side). Otherwise, it will be the full image resized to thumb size (by shortest side).
sl_si: Če je kljukica, potem bo sličica sredinski izrez pomanjšane slike. Velikost izreza določata <em>širina izreza</em> in <em>višina izreza</em>. Pomanjšava se izvede tako, da je krajša stranica sličice enaka <em>velikosti sličic</em>.

source: previous thumbs
sl_si: prejšnje sličice

source: next thumbs
sl_si: naslednje sličice

source: Images %1$u-%2$u of %3$u (%4$u/%5$u)
sl_si: Slike %1$u-%2$u od %3$u (%4$u/%5$u)

source: Clear ratings
sl_si: Izniči ocene

source: Sets all images and albums to unrated.
sl_si: Vse slike in albume nastavi kot neocenjene.

source: Rating
hu_hu: Osztályzat
sl_si: Ocena

source: Total votes
hu_hu: szavazatok
sl_si: Število glasov

source: 1 star out of 5
hu_hu: 1 csillag az 5-ből
sl_si: 1 zvezdica od 5

source: 2 stars out of 5
hu_hu: 2 csillag az 5-ből
sl_si: 2 zvezdici od 5

source: 3 stars out of 5
hu_hu: 3 csillag az 5-ből
sl_si: 3 zvezdice od 5

source: 4 stars out of 5
hu_hu: 4 csillag az 5-ből
sl_si: 4 zvezdice od 5

source: 5 stars out of 5
hu_hu: 5 csillag az 5-ből
sl_si: 5 zvezdic od 5

source: Ratings have been reset!
sl_si: Vse ocene so izničene!

source: Default user rights
sl_si: Privzete pravice uporabnika

source: No rights
sl_si: Brez pravic

source: View Rights
sl_si: Sme ogledovati

source: Notify
sl_si: Obvesti

source: Zenphoto Gallery registration
sl_si: Včlanitev v Zenphotovo galerijo

source: Registration confirmation
sl_si: Potrditev včlanjenja

source: you are already logged in.
sl_si: ste že vpisani.

source: Thank you for registering.
sl_si: Hvala, da ste se včlanili.

source: Your registration has been accepted.
sl_si: Vaš zahtevek za včlanjenje je bil sprejet.

source: Registration failed.
sl_si: Včlanjenje je spodletelo.

source: The user ID you chose is already in use.
sl_si: To ime je že v uporabi.

source: Invalid verification link.
sl_si: Napačna povezava do potrditve.

source: Enter a valid email address.
sl_si: Vnesite veljaven e-poštni naslov.

source: Size
hu_hu: Méret
sl_si: Velikost

source: Mode
hu_hu: Mód
sl_si: Način

source: flash
sl_si: bliskavica

source: Effect
hu_hu: Efektus
sl_si: Učinek

source: fade
sl_si: zatemnitev

source: slide X
sl_si: zdrs X

source: slide Y
sl_si: zdrs Y

source: scroll up
sl_si: poteg navzgor

source: scroll down
sl_si: poteg navzdol

source: scroll left
sl_si: poteg v levo

source: scroll right
sl_si: poteg v desno

source: Speed
hu_hu: Sebesség
sl_si: Hitrost

source: Speed of the transition in milliseconds.
hu_hu: Átmenetek sebessége ezredmásodpercben.
sl_si: Hitrost prehoda v milisekundah.

source: Timeout
hu_hu: Időtúllépés
sl_si: Trajanje

source: Invalid linking to the slideshow page.
hu_hu: Hibás a dia-vetítő oldalhoz való linkelés
sl_si: Neveljavna povezava na stran predstavitve.

source: This album is password protected!
hu_hu: Ezt az albumot jelszó védi!
sl_si: Ta album je zaščiten z geslom!

source: Play
hu_hu: Lejátszás
sl_si: Predvajaj

source: No flash player installed.
hu_hu: Nincs flash lejátszó telepítve.
sl_si: Predvajalnik Flash ni nameščen.

source: back
hu_hu: vissza
sl_si: Nazaj

source: Clear static html cache
sl_si: Izprazni predpomnilnik za HTML

source: Clears the static html cache.
sl_si: Brisanje predpomnilnika za HTML (cele strani).

source: Static html cache expire
sl_si: Poteče po

source: Excluded pages
sl_si: Izločene strani

source: Clear cache
sl_si: Izprazni predpomnilnik

source: Static HTML Cache cleared!
sl_si: Predpomnilnik za HTML izpraznjen!

source: Enable login form
sl_si: Omogoči prijavo

source: logout
hu_hu: Kijelentkezés
sl_si: odjavi

source: Image sizes allowed
sl_si: Dovoljene velikosti slik

source: Default size
sl_si: Privzeta velikost

source: Select image size
sl_si: Izberite velikost slik

source: %1$s x %2$s px
sl_si: %1$s x %2$s pik

source: %s px
sl_si: %s pik

source: Articles per page (theme)
sl_si: Članki na stran (tema)

source: News article text length
sl_si: Dolžina besedila novic

source: News article text shorten indicator
sl_si: Indikator skrajšanega besedila novic

source: Read more
sl_si: Preberite več

source: The text for the link to the full article.
sl_si: Besedilo povezave do celega članka.

source: RSS feed item number
sl_si: Število prispevkov v viru RSS:

source: The number of news articles you want to appear in your site's News RSS feed.
sl_si: Število novic in člankov, ki se pojavijo v viru RSS za novice.

source: RSS feed textlength
sl_si: Dolžina besedila viru RSS

source: News articles per page (admin)
sl_si: Število novic na stran (administracija)

source: News page name
sl_si: Ime strani z novicami

source: Pages page name
sl_si: Ime strani

source: CombiNews: Mode
sl_si: CombiNews: Način

source: CombiNews: Sortorder
sl_si: CombiNews: Vrstni red

source: date
sl_si: datum

source: Hash key
sl_si: Razpršitveni ključ

source: The key used in hashing the Captcha string. Note: this key will change with each successful Captcha verification.
sl_si: Ključ za razprševanje niza Captcha. Opomba: ta ključ se bo spremenil z vsako uspešno overitvijo s Captcha.

source: Allowed characters
sl_si: Dovoljeni znaki

source: The characters which may appear in the Captcha string.
sl_si: Znaki, ki se lahko pojavijo v nizu Captcha.

source: Captcha length
sl_si: Dolžina Captcha

source: The number of characters in the Captcha.
sl_si: Število znakov v nizu Captcha.

source: Title<strong>%s</strong>:
sl_si: Naslov<strong>%s</strong>:

source: Name<strong>%s</strong>:
sl_si: Ime<strong>%s</strong>

source: Company<strong>%s</strong>:
sl_si: Podjetje<strong>%s</strong>:

source: Street<strong>%s</strong>:
sl_si: Ulica<strong>%s</strong>:

source: City<strong>%s</strong>:
sl_si: Mesto<strong>%s</strong>:

source: Country<strong>%s</strong>:
sl_si: Država<strong>%s</strong>:

source: E-Mail<strong>%s</strong>:
sl_si: E-pošta<strong>%s</strong>:

source: Phone<strong>%s</strong>:
sl_si: Telefon<strong>%s</strong>:

source: Subject<strong>%s</strong>:
sl_si: Zadeva<strong>%s</strong>:

source: Message<strong>%s</strong>:
sl_si: Sporočilo<strong>%s</strong>:

source: Send e-mail
sl_si: Pošlji pošto

source: User ID:
sl_si: Uporabniško ime:

source: re-enter:
sl_si: še enkrat:

source: Email:
sl_si: E-pošta:

source: pass
hu_hu: átenged
sl_si: dovoli

source: moderate
hu_hu: visszatart
sl_si: preglej

source: reject
hu_hu: eldob
sl_si: zavrni

source: Album folder:
sl_si: Mapa albumov:

source: Page
sl_si: Stran

source: pages
sl_si: strani

source: articles
sl_si: članki

source: categories
sl_si: kategorije

source: *Select*
sl_si: *Izberi*

source: *Select an album*
sl_si: *Izberi album*

source: (select variant below)
sl_si: (Izberite možnost spodaj)

source: What to include
sl_si: Kaj naj bo zraven

source: Image title
sl_si: Naslov slike

source: Album title
sl_si: Naslov albuma

source: Custom text
sl_si: Besedilo po izbiri

source: Image size
sl_si: Velikost slike

source: Custom thumbnail
sl_si: Sličica po izbiri

source: Help
sl_si: Pomoč

source: Update Article
sl_si: Shrani spremembe

source: Save Article
sl_si: Shrani članek

source: Update Page
sl_si: Shrani spremembe

source: Save Page
sl_si: Shrani stran

source: Are you sure you want to delete this page? THIS CANNOT BE UNDONE AND WILL ALSO DELETE ALL SUB PAGES OF THIS PAGE!
sl_si: Ste prepričani, da bi radi zbrisali to stran? TEGA NE BOSTE MOGLI RAZVELJAVITI, POLEG TEGA BODO POBRISANE TUDI VSE PODSTRANI!

source: Edit Article:
sl_si: Urejanje članka:

source: (Article scheduled for publishing)
sl_si: (Članek bo objavljen ob nastavljenem času.)

source: Edit Page:
sl_si: Urejanje strani:

source: (Page scheduled for publishing)
sl_si: (Stran bo objavljena ob nastavljenem času.)

source: View
sl_si: Poglej

source: Enable permaTitlelink
sl_si: Nespremenljivo Unikatno ime

source: Locked for changes
sl_si: Zaklenjeno (za spremembe)

source: Expiration date:
sl_si: Poteče:

source: Last change:<br />%1$s<br />by %2$s
sl_si: Zadnja sprememba:<br />%1$s<br />by %2$s

source: Comments on
sl_si: Komentiranje je dovoljeno

source: Reset hitcounter (Hits: %1$s)
sl_si: Izniči števec ogledov (ogledov: %1$s)

source: TitleLink:
sl_si: Unikatno ime:

source: Content:
sl_si: Vsebina:

source: ExtraContent:
sl_si: Dodatna vsebina:

source: Articles
sl_si: Članki

source: Manage files
sl_si: Upravljanje z datotekami

source: Edit this article
sl_si: Uredi ta članek

source: Enable or disable comments
sl_si: Omogoči oz. onemogoči komentarje

source: locked
sl_si: zakljenjeno

source: View article
sl_si: Poglej članek

source: Select a page to edit or drag the pages into the order, including sub page levels, you wish them displayed.
sl_si: Povlecite strani (in podstrani), da jih uredite v željeni vrstni red.

source: Save order
sl_si: Shrani vrstni red

source: Edit this page
sl_si: Uredi to stran

source: Page <em>%s</em> added
sl_si: Stran <em>%s</em> je dodana

source: Page <em>%s</em> updated
sl_si: Stran <em>%s</em> je posodobljena

source: Page successfully deleted!
sl_si: Stran je uspešno pobrisana!

source: Sort order saved.
sl_si: Vrstni red je shranjen.

source: View page
sl_si: Poglej stran

source: Article <em>%s</em> added
sl_si: Članek <em>%s</em> je dodan

source: Article <em>%s</em> updated
sl_si: Članek <em>%s</em> je posodobljen

source: Article successfully deleted!
sl_si: Članek je uspešno pobrisan!

source: View all months
sl_si: Vsi meseci

source: Prev Page
sl_si: Prejšnja stran

source: All categories
sl_si: Vse kategorije

source: All articles
sl_si: Vsi članki

source: Unpublished
hu_hu: Nem publikus
sl_si: Neobjavljeno

source: You forgot to give your category a <strong>title or titlelink</strong>!
sl_si: Pozabili ste na <strong>naslov ali unikatno ime</strong> svoje strani!

source: Category <em>%s</em> added
sl_si: Kategorija <em>%s</em> je dodana

source: Category updated!
sl_si: Kategorija posodobljena!

source: Category successfully deleted!
sl_si: Kategorija je uspešno pobrisana!

source: Untitled category
sl_si: Kategorija brez naslova

source: Edit this category
sl_si: Uredi to kategorijo

source: Are you sure you want to delete this category? THIS CANNOT BE UNDONE!
sl_si: Ste prepričani, da bi radi zbrisali to kategorijo? TEGA NE BOSTE MOGLI RAZVELJAVITI!

source: Delete Category
sl_si: Zbriši kategorijo

source: Untitled page
sl_si: Stran brez naslova

source: Untitled article
sl_si: Brez naslova

source: Comments off
sl_si: Izključeni komentarji

source: hit
hu_hu: kattintás
sl_si: ogled

source: hits
hu_hu: kattintás
sl_si: ogledov

source: (<strong>%1$u</strong> page)
sl_si: (<strong>%1$u</strong> stran)

source: (<strong>%1$u</strong> page, <strong>%3$u</strong> unpublished)
sl_si: (<strong>%1$u</strong> stran, <strong>%2$u</strong> neobjavljena)

source: (<strong>%1$u</strong> news)
sl_si: (<strong>%1$u</strong> novica)

source: (<strong>%1$u</strong> newws, <strong>%3$u</strong> unpublished)
sl_si: (<strong>%1$u</strong> novica, <strong>%2$u</strong> neobjavljena)

source: (<strong>%1$u</strong> categorie)
sl_si: (<strong>%1$u</strong> kategorija)

source: Published/Not published/Scheduled for publishing
sl_si: Objavljeno/Neobjavljeno/Čaka na objavo

source: Comments on/off
sl_si: Vklop/Izklop komentiranja

source: Expired: %s
sl_si: Poteklo: %s

source: Expires: %s
sl_si: Poteče: %s

source: Prev page
sl_si: Prejšnja stran

source: View the %s album
sl_si: Poglej album %s

source: View the photo album %s
sl_si: Poglej album %s

source: View %s
sl_si: Pogled %s

source: Backup/Restore
sl_si: Varnostne kopije

source: Backup and restore your gallery database.
sl_si: Ustvarite ali uporabite varnostne kopije podatkovne zbirke vaše galerije.

source: Backup and Restore your Database
sl_si: Ustvarite ali uporabite varnostne kopije podatkovne zbirke

source: Failed to open %s for writing.
sl_si: Nisem mogel odpreti %s za pisanje.

source: failed writing to backup!
sl_si: Nisem mogel shraniti varnostne kopije!

source: MySQL SHOW TABLES failed!
sl_si: MySQL SHOW TABLES je spodletelo!
