Repository: dirkhusemann/zenphoto
Catalog: zp-core/locale/*/LC_MESSAGES/zenphoto.po
Languages: hu_hu, sl_si

source: Locale functionality is not implemented on your platform or the specified locale does not exist. Language translation may not work.
hu_hu: A lokalizációhoz szükséges funkciók hiányoznak a rendszereden, vagy a megadott nyelv támogatása nem létezik. Nem biztos, hogy a fordítások működni fognak.
sl_si: Funkcije za lokalizacijo na vašem strežniku niso implementirane ali pa manjkajo podatki za vašo lokacijo. Prevod v druge jezike morda ne bo deloval.

source: PHP <code>mbstring</code> package
hu_hu: PHP <code>mbstring</code> csomag
sl_si: PHP paket <code>mbstring</code>

source: PHP <code>MySQL support</code> [is not installed]
sl_si: Podpora za <code>MySQL</code> v PHP [ni nameščena]

source: You need to install MySQL support in your PHP
hu_hu: Telepítened kell a MySQL támogatást a PHP részére.
sl_si: Namestiti morate podporo za MySQL v vašem PHP

source: You can find the file in the "zp-core" directory.
hu_hu: A fájl a "zp-core" könyvtárban található.
sl_si: Datoteko lahko najdete v mapi "zp-core".

source: <em>Strict Permissions</em>
sl_si: <em>Stroga Dovoljenja</em>

source: When this option is not in effect, file and folder permissions are relaxed. This could constitute a security risk so it is recommended that you enable <em>Strict Permissions</em>. However, on some servers Zenphoto does not function correctly with strict file/folder permissions. If you enable this option and Zenphoto has permission errors, run setup again and disable the option.
sl_si: Ko so stroga dovoljenja izklopljena, je dostop do datotek in map bolj prost. To je potencialna varnostna ranljivost in predlagam, da vklopite <em>Stroga Dovoljenja</em> (<em>Strict Permissions</em>). Vendar pa na nekaterih strežnikih Zenphoto ne dela dobro s strožjimi dovoljenji. Če boste vklopili to možnost in ugotovili, da ima Zenphoto napake z dovoljenji, ponovno poženite namestitev in izklopite <em>Stroga Dovoljenja</em>.

source: Click <a href="?strict_chmod=1">here</a> to use strict file/folder permissions.
sl_si: <a href="?strict_chmod=1">Vklopi stroga dovoljenja za mape in datoteke.</a>

source: <strong>NOTE:</strong> This option applies only to new files and folders created by Zenphoto. You may have to change permissions on existing ones to resolve problems.
sl_si: <strong>Opomba:</strong> Ta možnost se nanaša le na novo ustvarjene mape in datoteke. Morda boste morali popraviti dovoljenja za obstoječe mape in datoteke, če se bodo pojavile težave z dovoljenji.

source: On some servers Zenphoto does not function correctly with strict file/folder permissions. If you are getting permission errors run setup again and disable the option.
sl_si: Na nekaterih strežnikih Zenphoto ne dela dobro s strožjimi dovoljenji. Če ima Zenphoto napake z dovoljenji, ponovno poženite namestitev in izklopite <em>Stroga Dovoljenja</em>.

source: Click <a href="?strict_chmod=0">here</a> to enable relaxed file/folder permissions.
sl_si: <a href="?strict_chmod=0">Izklopi stroga dovoljenja za mape in datoteke.</a>

source: Fill in the information below and <strong>setup</strong> will attempt to update your <code>zp-config.php</code> file.
sl_si: Izpolnite spodnji obrazec in <strong>namestitev</strong> bo poskušala posodobiti vašo datoteko <code>zp-config.php</code>.

source: MySQL admin user
hu_hu: MySQL admin felhasználó
sl_si: Administrator za MySQL

source: MySQL admin password
hu_hu: MySQL admin jelszó
sl_si: Geslo administratorja za MySQL

source: MySQL host
hu_hu: MySQL szerver
sl_si: Gostitelj MySQL

source: MySQL database
hu_hu: MySQL adatbázis
sl_si: Podatkovna zbirka v MySQL

source: Database table prefix
hu_hu: Adatbázis táblázat prefix-je
sl_si: Predpona tabel

source: required
hu_hu: szükséges
sl_si: zahtevano

source: MySQL setup in <em>zp-config.php</em>
hu_hu: MySQL beállítás a <em>zp-config.php</em> fájlban
sl_si: Nastavitve MySQL v <em>zp-config.php</em>

source: You have not set your <strong>MySQL</strong> <code>user</code>, <code>password</code>, etc. in your <code>zp-config.php</code> file and <strong>setup</strong> is not able to write to the file.
hu_hu: Be kell állítani a <strong>MySQL</strong> <code>user</code>, <code>password</code>, stb. értékeket a <code>zp-config.php</code> fájlban, és a <strong>telepétő</strong> nem tud írni a fájlba.
sl_si: Niste nastavili parametrov za <strong>MySQL</strong> (<code>user</code>, <code>password</code>, itd.) v datoteki <code>zp-config.php</code>, ta <strong>namestitev</strong> pa tudi ne more pisati v to datoteko.

source: Could not connect to the <strong>MySQL</strong> server. Check the <code>user</code>, <code>password</code>, and <code>database host</code> and try again.
sl_si: Ne morem se povezati s strežnikom <strong>MySQL</strong>. Preverite vrednosti za <code>user</code>, <code>password</code> in <code>database host</code> in poskusite znova.

source: MySQL version %s
sl_si: MySQL različica %s

source: Version %1$s or greater is required.<br />Version %2$s or greater is prefered.
sl_si: Nujna je različica %1$s ali novejša.<br />Zaželena je različica %2$s ali novejša.

source: Could not access the <strong>MySQL</strong> database (<code>%s</code>).
sl_si: Ne morem se povezati s podatkovno bazo (<code>%s</code>), ki teče na <strong>MySQL</strong>.

source: Also check the <code>MySQL host</code>.
hu_hu: Szintén ellenőrizd a <code>MySQL host</code>-ot.
sl_si: Preverite tudi <code>strežnik MySQL</code>.

source: MySQL <code>SQL mode</code>
sl_si: MySQL <code>način SQL</code>

source: Grants found:
hu_hu: Grant-ok rendben:
sl_si: Dovoljene operacije:

source: The <em>SHOW GRANTS</em> query failed.
hu_hu: A <em>SHOW GRANTS</em> lekérése sikertelen.
sl_si: Poizvedba <em>SHOW GRANTS</em> je spodletela.

source: MySQL <code>access rights</code>
sl_si: MySQL <code>pravice dostopa</code>

source: MySQL <code>access rights</code> [%s]
sl_si: MySQL <code>pravice dostopa</code> [%s]

source: Your MySQL user must have %s rights.
sl_si: Uporabniško ime za MySQL mora imeti pravice: %s.

source: MySQL <em>show tables</em> [found no tables]
sl_si: MySQL poizvedba <em>show tables</em> [ni nobenih tabel]

source: MySQL <em>show tables</em> found: %s
sl_si: Poizvedba MySQL <em>show tables</em> je našla: %s

source: MySQL <em>show tables</em> [Failed]
sl_si: MySQL poizvedba <em>show tables</em> [Spodletelo]

source: MySQL did not return a list of the database tables for <code>%s</code>.
sl_si: MySQL ni vrnil spiska tabel za <code>%s</code>.

source: <strong>Setup</strong> will attempt to create all tables. This will not over write any existing tables.
hu_hu: A <strong>telepítő</strong> megpróbálja létre hozni az összes szükséges táblázatot. Semmilyen létező táblázat sem lesz átírva.
sl_si: <strong>Namestitev</strong> bo poskušala samodejno ustvariti vse tabele. To ne bo povozilo nobene obstoječe tabele.

source: MySQL <code>field collations</code> [Image table]
sl_si: <code>kodne tabele za polja</code> MySQL [tabela Image]

source: MySQL <code>field collations</code> [Album table]
sl_si: <code>kodne tabele za polja</code> MySQL [tabela Album]

source: MySQL <code>field collations</code>
sl_si: <code>kodne tabele za polja</code> MySQL

source: Zenphoto core files [Some files are missing or their <em>filemtimes</em> seem out of variance]
sl_si: Temeljne datoteke Zenphoto [Nekatere datoteke manjkajo oz. njihovi datumi (<em>filemtime</em>) niso usklajeni]

source: Perhaps there was a problem with the upload. You should check the following files:
sl_si: Morda ste imeli kakšne težave z nalaganjem. Preverite, da je s sledečimi datotekami vse v redu:

source: Zenphoto core files [This is not an official build]
sl_si: Temeljne datoteke Zenphoto [To ni uradno sestavljena različica]

source: Zenphoto core files
sl_si: Temeljne datoteke Zenphota

source: <em>.htaccess</em> file
sl_si: datoteka <em>.htaccess</em>

source: Server seems not to be Apache or Apache-compatible, <code>.htaccess</code> not required.
sl_si: Izgleda, da strežnik ni Apache ali kompatibilen z Apache, datoteka <code>.htaccess</code> ni potrebna.

source: <em>.htaccess</em> file [is empty or does not exist]
sl_si: datoteka <em>.htaccess</em> [je prazna ali ne obstaja]

source: Edit the <code>.htaccess</code> file in the root zenphoto folder if you have the mod_rewrite module, and want cruft-free URLs.
hu_hu: Ha telepítve van a mod_rewrite modul és humánusabb URL-eket szeretnél használni, szerkesztsd át a <code>.htaccess</code> fájlt a zenphoto mappában.
sl_si: Uredite datoteko <code>.htaccess</code> v korenski mapi Zenphota, če imate omogočen modul mod_rewrite in želite lične spletne naslove (URL-je).

source: Just change the one line indicated to make it work.
hu_hu: Csak egy sor megváltoztatása szükséges, hogy működjön.
sl_si: Zgolj spremenite vrstico, ki je označena, pa bo delalo.

source: You can ignore this warning if you do not intend to set the option <code>mod_rewrite</code>.
hu_hu: Ha nem kívánsz <code>mod_rewrite</code>-ot használni, hagyd figyelmen kívül ezt az opciót.
sl_si: To opozorilo lahko spregledate, če nimate namena uporabiti možnosti <code>mod_rewrite</code>.

source: <em>.htaccess</em> file [wrong version]
sl_si: datoteka <em>.htaccess</em> [napačna različica]

source: You need to upload the copy of the .htaccess file that was included with the zenphoto distribution.
hu_hu: Kérlek töltsd fel a .htaccess fájlt, amelyet a zenphoto disztribúciód tartalmaz.
sl_si: Naložiti morate datoteko .htaccess, ki ste jo dobili skupaj z Zenphotom.

source: <em>.htaccess</em> file (<em>RewriteEngine</em> is <strong>%s</strong>)
sl_si: datoteka <em>.htaccess</em> (<em>RewriteEngine</em> je <strong>%s</strong>)

source: <em>.htaccess</em> RewriteBase [is <em>missing</em>]
sl_si: <em>.htaccess</em> RewriteBase [<em>manjka</em>]

source: <em>.htaccess</em> RewriteBase is <code>%s</code>
sl_si: Oznaka RewriteBase v <em>.htaccess</em> je <code>%s</code>

source: <em>.htaccess</em> RewriteBase is <code>%s</code> [Does not match install folder]
sl_si: <em>.htaccess</em> RewriteBase je <code>%s</code> [se ne ujema z mapo namestitve]

source: <em>.htaccess</em> RewriteBase is <code>%s</code> (fixed)
sl_si: Oznaka RewriteBase v <em>.htaccess</em> je <code>%s</code> (popravljeno)

source: Setup was not able to write to the file change RewriteBase match the install folder.
hu_hu: A telepéttő nem tudja megváltoztatni a RewriteBase értékét a telepítés mappájára.
sl_si: Namestitev ni uspela zapisati spremembe v datoteko, ki bi oznako RewriteBase nastavila na namestitveno mapo.

source: Either make the file writeable or set <code>RewriteBase</code> in your <code>.htaccess</code> file to <code>%s</code>.
sl_si: Poskusite nastaviti pravice pisanja za datoteko <code>.htaccess</code> ali vanjo ročno vnesite <code>%s</code> za oznako <code>RewriteBase</code>.

source: albums [<code>$conf['external_album_folder']</code> is deprecated[
sl_si: mapa albums [<code>$conf['external_album_folder']</code> ni več v uporabi

source: You should update your zp-config.php file to conform to the current zp-config.php.example file.
sl_si: Popraviti bi morali vašo datoteko zp-config.php tako, da bo podobna novejši zp-config.php.example.

source: <em>albums</em> folder
sl_si: mapa <em>albums</em>

source: <em>albums</em> folder [The line <code>$conf['album_folder']</code> is missing from your zp-config.php file]
sl_si: mapa <em>albums</em> [vrstica <code>$conf['album_folder']</code> manjka v vaši datoteki zp-config.php]

source: <em>locale</em> folders
sl_si: mape <em>locale</em>

source: <em>locale</em> folders [Are not complete]
sl_si: mape <em>locale</em> [Niso popolne]

source: Be sure you have uploaded the complete Zenphoto package. You must have at least the <em>en_US</em> folder.
sl_si: Prepričajte se, da ste naložili ves paket Zenphota. Imeti morate vsaj mapo <em>en_US</em>.

source: You need to address the problems indicated above then run <code>setup.php</code> again.
hu_hu: A fenti problémák elhárítása után futtasd újra a <code>setup.php</code> fájlt.
sl_si: Razrešiti morate zgornje probleme, potem pa ponovno pognati <code>setup.php</code>.

source: Select a language:
hu_hu: Válassz nyelvet:
sl_si: Izberite jezik:

source: You need <em>USER ADMIN</em> rights to run setup.
hu_hu: A telepítő futtatásához <em>USER ADMIN</em> jogokkal kell rendelkezned.
sl_si: Potrebujete pravico <em>USER ADMIN</em>, če želite pognati namestitev.

source: About to create tables
sl_si: Začenjam z ustvarjanjem tabel

source: About to update tables
sl_si: Pripravljen na posodobitev tabel

source: Table creation failure:
sl_si: Nisem uspel ustvariti tabele:

source: Failed. Error:
hu_hu: Nem sikerült. Hiba:
sl_si: je spodletela. Napaka:

source: Success.
hu_hu: Sikerült.
sl_si: Uspeh.

source: Done with table create!
sl_si: Končal sem s kreiranjem tabele!

source: Done with table create with errors!
sl_si: Ustvarjanje tabel je končano, a z napakami!

source: Done with table update
sl_si: Končal sem s posodobitvijo tabel

source: Done with table update with errors
sl_si: Ustvarjanje tabel je končano, a z napakami

source: You can now <a href="../">View your gallery</a> or <a href="admin.php">administer.</a>
sl_si: Zdaj si lahko <a href="../">ogledate svojo galerijo</a> ali <a href="admin.php">administrirate.</a>

source: Database tables to create: %s
sl_si: Tabele, ki jih moram ustvariti: %s

source: Database tables to update: %s
sl_si: Tabele, ki jih moram posodobiti: %s

source: create and or update the database tables.
hu_hu: adatbázis táblázatok létrehozása, vagy frissítése.
sl_si: ustvarjanje oz. posodoabljanje tabel podatkovne zbirke.

source: Go
sl_si: Zdaj!

source: database did not connect
hu_hu: Nem tudtam kapcsolódni az adatbázishoz
sl_si: nisem se mogel povezati s podatkovno bazo

source: Admin Toolbox
hu_hu: Szerszámosláda
sl_si: Orodjarna administratorja

source: Admin
sl_si: Administriranje

source: Sort gallery
hu_hu: Galéria elrendezése
sl_si: Razvrstitev galerije

source: Manual sorting
hu_hu: Kézi elrendezés
sl_si: Ročni vrstni red

source: New album
hu_hu: Új album
sl_si: Nov album

source: Edit album
hu_hu: Album szerkesztése
sl_si: Uredi album

source: Sort album
hu_hu: Album elrendezése
sl_si: Razvrsti album

source: Delete the album
hu_hu: Album törlése
sl_si: Zbriši ta album

source: Delete album
hu_hu: Album törlése
sl_si: Zbriši album

source: Upload Here
hu_hu: Feltöltés ide
sl_si: Naložite tule

source: New Album Here
hu_hu: Új album ide
sl_si: Izdelajte nov album tule

source: Are you sure you want to delete the image? THIS CANNOT BE UNDONE!
hu_hu: Biztosan törölni szeretnéd ezt a képet? EZ A MŰVELET VISSZAVONHATATLAN!
sl_si: Ste prepričani, da bi radi zbrisali to sliko? TEGA NE BOSTE MOGLI RAZVELJAVITI!

source: Delete the image
hu_hu: A kép törlése
sl_si: Zbriši sliko

source: Delete image
hu_hu: Kép törlése
sl_si: Zbriši sliko

source: Edit this image
sl_si: Uredi to sliko

source: Edit image
sl_si: Uredi sliko

source: Create an album from the search
hu_hu: Csinálj albumot a keresés eredményéből
sl_si: Izdela album iz rezultatov iskanja

source: Create Album
hu_hu: Csinálj albumot
sl_si: Ustvari album

source: Edit Article
sl_si: Uredi članek

source: Are you sure you want to delete this article? THIS CANNOT BE UNDONE!
sl_si: Ste prepričani, da bi radi zbrisali ta članek? TEGA NE BOSTE MOGLI RAZVELJAVITI!

source: Delete article
sl_si: Zbriši članek

source: Delete Article
sl_si: Zbriši članek

source: Add Article
sl_si: Dodaj članek

source: Edit Page
sl_si: Uredi stran

source: Are you sure you want to delete this page? THIS CANNOT BE UNDONE!
sl_si: Ste prepričani, da bi radi zbrisali to stran? TEGA NE BOSTE MOGLI RAZVELJAVITI!

source: Delete page
sl_si: Zbriši stran

source: Delete Page
sl_si: Zbriši stran

source: Add Page
sl_si: Dodaj stran

source: Logout
hu_hu: Kijelentkezés
sl_si: Odjavi

source: Previous Page
hu_hu: Előző oldal
sl_si: Prejšnja stran

source: Next Page
hu_hu: Következő oldal
sl_si: Naslednja stran

source: (Current Page)
hu_hu: (Aktuális oldal)
sl_si: (Trenutna stran)

source: (No title...)
sl_si: (Brez naslova ...)

source: Album Thumbnails
hu_hu: Album miniatűrök
sl_si: Sličice albumov

source: (No date...)
sl_si: (Brez datuma ...)

source: (No place...)
sl_si: (Brez lokacije ...)

source: (No description...)
sl_si: (Brez opisa ...)

source: (No data...)
sl_si: (Ni podatkov ...)

source: printImageEXIFData is deprecated. Use printImageMetadata().
sl_si: printImageEXIFData ni več v uporabi. Uporabite printImageMetadata().

source: (No data)
sl_si: (Ni podatkov)

source: printCustomSizedImageMaxHeight is deprecated. Use printCustomSizedImageMaxSpace().
sl_si: printCustomSizedImageMaxHeight ni več v uporabi. Uporabite printCustomSizedImageMaxSpace().

source: Anonymous
hu_hu: Névtelen
sl_si: Anonimno

source: getCommentDate is deprecated. Use getCommentDateTime().
sl_si: getCommentDate ni več v uporabi. Uporabite getCommentDateTime().

source: getCommentTime is deprecated. Use getCommentDateTime().
sl_si: getCommentTime ni več v uporabi. Uporabite getCommentDateTime().

source: You must supply an e-mail address.
hu_hu: Meg kell adnod az e-mail címedet
sl_si: Vpisati morate e-poštni naslov.

source: You must enter your name.
hu_hu: Meg kell adnod a nevedet.
sl_si: Vnesti morate svoje ime.

source: You must supply an WEB page URL.
hu_hu: Meg kell adnod egy honlap címet.
sl_si: Vpisati morate spletni naslov (URL).

source: Captcha verification failed.
hu_hu: A biztonsági kódot hibássan adtad meg.
sl_si: Preverjanje s Captcha je bilo neuspešno.

source: You must enter something in the comment text.
hu_hu: A hozzászólás mező üres.
sl_si: Nekaj morate vpisati v polje za komentar.

source: Your comment failed the SPAM filter check.
hu_hu: A hozzászólásod megbukott a SPAM ellenőrzésen.
sl_si: Vaš komentar je označen kot neželena vsebina (SPAM).

source: Your comment has been marked for moderation.
hu_hu: Hozzászólásodat ellenőrzésre jelölték.
sl_si: Vaš komentar mora odobriti administrator.

source: Comment error "%d" not defined.
sl_si: Nedefinirana napaka v zvezi s komentarjem: "%d".

source: Download Zip of the Album
hu_hu: Album letöltése Zip archívumként
sl_si: Snemi album v paketu ZIP

source: Download a zip file of this album
hu_hu: Töltsd le az albumot zip fájlként.
sl_si: Potegni paket zip s tem albumom

source: hitcounter is deprecated. Use getHitcounter().
sl_si: hitcounter ni več v uporabi. Uporabite getHitcounter().

source: View image: %s
sl_si: Poglej sliko: %s

source: (No tags...)
sl_si: (Brez oznak ...)

source: Latest images RSS
sl_si: Vir RSS za zadnje slike

source: Latest images of this album RSS
sl_si: Vir RSS za zadnje slike v tem albumu

source: Latest images of this album and its subalbums RSS
sl_si: Vir RSS za zadnje slike v tem albumu in podalbumih

source: Latest comments RSS
sl_si: Vir RSS za zadnje komentarje

source: Latest comments RSS for this image
sl_si: Vir RSS za zadnje komentarje na to sliko

source: Latest comments RSS for this album
sl_si: Vir RSS za komentarje za ta album

source: Latest albums RSS
sl_si: Vir RSS za zadnje albume

source: select search fields
sl_si: Polja za iskanje:

source: no date
hu_hu: nincs dátum
sl_si: brez datuma

source: Check your user and password and try again.
hu_hu: Ellenőrizd a nevet és a jelszót és próbáld újra.
sl_si: Preverite svoje uporabniško ime in geslo ter poskusite znova.

source: The page you are trying to view is password protected.
hu_hu: Az oldal, amelyet meg szeretnél nyitni jelszóval van védve.
sl_si: Stran je zaščitena z geslom.

source: Hint: %s
sl_si: Namig: %s

source: Powered by <a href="http://www.zenphoto.org" title="A simpler web photo album"><span id="zen-part">zen</span><span id="photo-part">PHOTO</span></a>
sl_si: Gnano z <a href="http://www.zenphoto.org" title="Preprostejši spletni fotoalbum"><span id="zen-part">Zen</span><span id="photo-part">PHOTO</span></a>

source: 1: Normal (0 deg)
hu_hu: 1: Normális (0 fok)
sl_si: 1: Običajno (0 stopinj)

source: 2: Mirrored
hu_hu: 2: Tükörkép
sl_si: 2: Zrcalno

source: 3: Upsidedown
hu_hu: 3: Fejjel lefelé
sl_si: 3: Obrnjeno na glavo

source: 4: Upsidedown Mirrored
hu_hu: 4: Fejjel lefelé, tükörkép
sl_si: 4: Zrcalno in obrnjeno na glavo

source: 5: 90 deg CW Mirrored
hu_hu: 5: 90 fok jobra, tükörkép
sl_si: 5: 90 stopinj v desno, zrcalno

source: 6: 90 deg CCW
hu_hu: 6: 90 fok balra
sl_si: 6: 90 stopinj v levo

source: 7: 90 deg CCW Mirrored
hu_hu: 7: 90 fok balra, tükörkép
sl_si: 7: 90 stopinj v levo, zrcalno

source: 8: 90 deg CW
hu_hu: 8: 90 fok jobra
sl_si: 8: 90 stopinj v desno

source: Unknown
hu_hu: Ismeretlen
sl_si: Neznano

source: No Unit
hu_hu: Nincs egység
sl_si: Brez enote

source: Inch
hu_hu: col (inch)
sl_si: Inč (palec)

source: Center of Pixel Array
sl_si: Sredina polja pikslov

source: Datum Point
sl_si: Točka Datum

source: Aperture Priority
hu_hu: Rekesz prioritás
sl_si: Prednost zaklopke

source: Shutter Priority
hu_hu: Záridő prioritás:
sl_si: Prednost zaklopke

source: Portrat
hu_hu: Portré
sl_si: Pokončno

source: Landscape
hu_hu: Fekvő
sl_si: Ležeče

source: Center Weighted Average
hu_hu: Központi súlyozott átlag
sl_si: Sredinsko uteženo povprečje

source: Spot
hu_hu: Pont
sl_si: Točkasto

source: Multi-Spot
hu_hu: Több pontos
sl_si: Večtočkovno

source: Multi-Segment
hu_hu: Több szegmensű
sl_si: Večsegmentno

source: Other
hu_hu: Más
sl_si: Drugo

source: Unknown or Auto
hu_hu: Ismeretlen, vagy automatikus
sl_si: Neznan ali Samodejno

source: Flash
hu_hu: Vaku
sl_si: Uporaba bliskavice

source: Standard Light A
hu_hu: Standard fény A
sl_si: Običajno svetilo A

source: Standard Light B
hu_hu: Standard fény B
sl_si: Običajno svetilo B

source: Standard Light C
hu_hu: Standard fény C
sl_si: Običajno svetilo C

source: No Flash
hu_hu: Vaku nélkül
sl_si: Brez bliskavice

source: Compulsory Flash
hu_hu: Kényszerített vaku
sl_si: Vsiljena bliskavica

source: Flash, Auto-Mode
hu_hu: Vaku, Automatikus mód
sl_si: Bliskavica, samodejno

source: Red Eye
hu_hu: Vörösszem
sl_si: S preprečevanjem rdečih oči

source: Red Eye, Compulsory Flash
hu_hu: Vörösszem, kényszerített vaku
sl_si: Preprečevanje rdečih oči, vsiljena bliskavica

source: Red Eye, Auto-Mode
hu_hu: Vörösszem, Automatikus mód
sl_si: Odprava rdečih oči, Samodejno

source: No Compression
hu_hu: Nincs tömörítés
sl_si: Brez stiskanja

source: Jpeg Compression
hu_hu: Jpeg tömörítés
sl_si: Stiskanje JPEG

source: Not defined
hu_hu: Nincs definiálva
sl_si: Ni definiran

source: version
hu_hu: Verzió
sl_si: različica

source: The file could not be found.
hu_hu: A fájl nem található.
sl_si: Ne najdem datoteke.

source: Couldnt Find SubIFD
hu_hu: A SubIFD nem található
sl_si: Nisem mogel najti SubIFD

source: Illegal size for SubIFD
hu_hu: Helytelen méret: SubIFD
sl_si: Neveljavna velikost za SubIFD

source: Couldnt Find IFD1
hu_hu: Az IFD1 nem található
sl_si: Nisem mogel najti IFD1

source: Illegal size for IFD1
hu_hu: Helytelen méret: IFD1
sl_si: Neveljavna velikost za IFD1

source: Couldnt Find InteroperabilityIFD
hu_hu: A InteroperabilityIFD nem található
sl_si: Nisem mogel najti InteroperabilityIFD

source: Illegal size for InteroperabilityIFD
hu_hu: Helytelen méret: InteroperabilityIFD
sl_si: Neveljavna velikost za InteroperabilityIFD

source: Macro
hu_hu: Makró
sl_si: Makro

source: Off
hu_hu: Ki kapcsolva
sl_si: Izključena

source: Fine
hu_hu: Finom
sl_si: Fino

source: Auto
hu_hu: Automatikus
sl_si: Samodejno

source: On
hu_hu: Be kapcsolva
sl_si: Vključena

source: Red Eye Reduction
hu_hu: Vörösszem redukció
sl_si: S preprečevanjem rdečih oči

source: Slow Synchro
hu_hu: Lassú szinkronizáció
sl_si: Počasna sinhronizacija

source: Auto + Red Eye Reduction
hu_hu: Automatikus + Vörösszem redukció
sl_si: Samodejno, s preprečevanjem rdečih oči

source: On + Red Eye Reduction
hu_hu: Bekapcsolva + Vörösszem redukció
sl_si: Vključena, s preprečevanjem rdečih oči
