Repository: dirkhusemann/zenphoto
Catalog: zp-core/locale/*/LC_MESSAGES/zenphoto.po
Languages: hu_hu, sl_si

source: <strong>Zenphoto error:</strong> zp-config.php not found. Perhaps you need to run <a href="%s/setup.php">setup</a> (or migrate your old config.php)
sl_si: <strong>Napaka v Zenphotu:</strong> ne najdem zp-config.php. Morda morate pognati <a href="%s/setup.php">namestitev</a> (ali prekopirati vašo staro datoteko config.php)

source: Oops.. Cannot edit from this page
sl_si: Opala... S te strani ne morete urejati.

source: Error: malformed Ajax POST
sl_si: Napaka: izmaličen niz Ajax (POST)

source: Could not save!
sl_si: Ne morem shraniti!

source: MySQL Error: The PHP MySQL extentions have not been installed. Please ask your administrator to add MySQL support to your PHP installation.
hu_hu: MySQLHiba: A PHP MySQL támogatása nem lett telepítve. Kérvényezd a rendszergaztádnál a PHP MySQL támogatás telepítését.
sl_si: Napaka z MySQL: Podaljšek (extension) PHP za MySQL ni bil nameščen. Naročite administratorju strežnika, da v namestitvi PHP doda podporo za MySQL.

source: MySQL Error: Zenphoto could not connect to the database server.
hu_hu: MySQL Hiba: A zenphoto nem tud csatlakozni az adatbázis szerverhez.
sl_si: Napaka z MySQL: Zenphoto se ne more povezati s podatkovnim strežnikom.

source: Check your <strong>zp-config.php</strong> file for the correct <em><strong>host</strong>, <strong>user name</strong>, and <strong>password</strong></em>.
hu_hu: Ellenőrizd a <strong>zp-config.php</strong> fájlt, hogy helyesen adtad-e meg a <em><strong>szerver</strong>, <strong>felhasználónév</strong>, és a <strong>jelszó</strong></em> értékeket.
sl_si: Prepričajte se, da imate v datoteki <strong>zp-config.php</strong> pravilne vrednosti za <em><strong>host</strong> (strežnik), <strong>user name</strong> (uporabniško ime na strežniku) in <strong>password</strong> (geslo)</em>.

source: Note that you may need to change the <em>host</em> from localhost if your web server uses a separate MySQL server, which is common in large shared hosting environments like Dreamhost and GoDaddy.
hu_hu: Vedd figyelembe, hogy néha szükséges a <em>szerver</em>-t localhost-ról másra állítani, ha a webservered külső MySQL szerverhez csatlakozik. Ez általános lehet nagy megosztottszolgáltatóknál.
sl_si: Vedite, da za <em>host</em> (ime strežnika) vrednost localhost morda ne bo primerna, če vaš spletni strežnik uporablja ločen strežnik MySQL, kar je običajno pri velikih ponudnikih spletnega prostora, npr. Dreamhost in GoDaddy.

source: Also make sure the server is running, if you control it.
hu_hu: Szintén ellenőrizd, hogy fut-e a szerver.
sl_si: Prepričajte se tudi, da je strežnik pognan.

source: MySQL Error: The database is connected, but Zenphoto could not select the database %s.
sl_si: Napaka z MySQL: Povezava s strežnikom deluje, vendar Zenphoto ne more izbrati podatkovne baze %s.

source: Make sure it already exists, create it if you need to.
hu_hu: Bizonyosodj meg róla, hogy létezik. Ha szükséges hozd létre.
sl_si: Prepričajte se, da obstaja in jo ustvarite, če je potrebno.

source: Also make sure the user you're trying to connect with has privileges to use this database.
hu_hu: Szintén ellenőrizd az adatbázisfelhasználó jogosultságait.
sl_si: Prepričajte se tudi, da ima uporabniško ime, s katerim se povezujete na to podatkovno bazo, ustrezne pravice.

source: MySQL Query ( <em>%1$s</em> ) failed. Error: %2$s
sl_si: Poizvedba v MySQL ( <em>%1$s</em> ) ni uspela. Napaka: %2$s

source: It looks like your zenphoto tables haven't been created.
hu_hu: A jelek szerint a zenphoto táblázatok nem lettek létrehozva.
sl_si: Izgleda, da tabele za vaš Zenphoto niso bile ustvarjene.

source: You may need to run <a href="%s/%s/setup.php">the setup script.</a>
sl_si: Morda morate pognati <a href="%s/%s/setup.php">namestitev.</a>

source: Afrikaans
sl_si: Afriški

source: Albanian
sl_si: Albanski

source: Arabic (United Arab Emirates)
sl_si: Arabski (Združeni Arabski emirati)

source: Arabic (Bahrain)
sl_si: Arabski (Bahrain)

source: Arabic (Algeria)
sl_si: Arabski (Algeria)

source: Arabic (Egypt)
sl_si: Arabski (Egipt)

source: Arabic (Iran)
sl_si: Arabski (Iran)

source: Arabic (Iraq)
sl_si: Arabski (Irak)

source: Arabic (Jordan)
sl_si: Arabski (Jordan)

source: Arabic (Kuwait)
sl_si: Arabski (Kuvait)

source: Arabic (Lebanon)
sl_si: Arabski (Lebanon)

source: Arabic (Libya)
sl_si: Arabski (Libija)

source: Arabic (Morocco)
sl_si: Arabski (Morocco)

source: Arabic (Oman)
sl_si: Arabski (Oman)

source: Arabic (Qatar)
sl_si: Arabski (Katar)

source: Arabic (Saudi Arabia)
sl_si: Arabski (Savdska arabija)

source: Arabic (Sudan)
sl_si: Arabski (Sudan)

source: Arabic (Syria)
sl_si: Arabski (Sirija)

source: Arabic (Tunisia)
sl_si: Arabski (Tunizija)

source: Arabic (Yemen)
sl_si: Arabski (Jemen)

source: Basque (Basque)
sl_si: Baskovski

source: Belarusian
hu_hu: Fehérorosz
sl_si: Beloruski

source: Bengali
hu_hu: Bengáli
sl_si: Bengalski

source: Bulgarian
hu_hu: Bolgár
sl_si: Bolgarski

source: Catalan
hu_hu: Katalán
sl_si: Katalonski

source: Chinese (People's Republic of China)
sl_si: Kitajski (Ljudska republika Kitajska)

source: Chinese (Hong Kong)
sl_si: Kitajski (Hong Kong)

source: Chinese (Taiwan)
sl_si: Kitajski (Tajvan)

source: Croatian
hu_hu: Horvát
sl_si: hrvaški

source: Czech
hu_hu: Cseh
sl_si: Češki

source: Cambodian
hu_hu: Kambodzsai
sl_si: Kambodžki

source: Danish
hu_hu: Dán
sl_si: Danski

source: Dutch (Belgium)
sl_si: Nizozemski (Belgija)

source: Dutch (The Netherlands)
sl_si: Nizozemski (Nizozemska)

source: English (Australia)
sl_si: Angleški (Avstralija)

source: English (Canada)
sl_si: Angleški (Kanada)

source: English (United Kingdom)
sl_si: Angleški (Velika Britanija)

source: English (India)
sl_si: Angleški (Indija)

source: English (New Zealand)
sl_si: Angleški (Nova Zelandija)

source: English (Philippines)
sl_si: Angleški (Filipini)

source: English (United States)
sl_si: Angleški (ZDA)

source: English (South Africa)
sl_si: Angleški (Južna Afrika)

source: English (Zimbabwe)
sl_si: Angleški (Zimbabve)

source: Estonian
hu_hu: Észt
sl_si: Estonski

source: Finnish
hu_hu: Finn
sl_si: Finski

source: French (Belgium)
sl_si: Francoski (Belgija)

source: French (Canada)
sl_si: Francoski (Kanada)

source: French (Switzerland)
sl_si: Francoski (Švica)

source: French (France)
sl_si: Francoski (Francija)

source: French (Luxembourg)
sl_si: Francoski (Luksemburg)

source: Galician
hu_hu: Gall
sl_si: Galijski

source: Greek
hu_hu: Görög
sl_si: Grški

source: German (Austria)
sl_si: Nemški (Avstrija)

source: German (Belgium)
sl_si: Nemški (Belgija)

source: German (Switzerland)
sl_si: Nemški (Švica)

source: German (Germany)
sl_si: Nemški (Nemčija)

source: German (Luxembourg)
sl_si: Nemški (Luksemburg)

source: Hebrew
hu_hu: Héber
sl_si: Hebrejski

source: Hindi
sl_si: Hindujski

source: Hungarian
hu_hu: Magyar
sl_si: Madžarski

source: Indonesian
hu_hu: Indonéz
sl_si: Indonezijski

source: Icelandic
hu_hu: Izlandi
sl_si: Islandski

source: Italian (Switzerland)
sl_si: Italijanski (Švica)

source: Italian (Italy)
sl_si: Italijanski (Italija)

source: Japanese
sl_si: Japonski

source: Korean
hu_hu: Kóreai
sl_si: Korejski

source: Lithuanian
hu_hu: Litván
sl_si: Litvanski

source: Latvian
hu_hu: Lett
sl_si: latvijski

source: Macedonian
hu_hu: Makedón
sl_si: Makedonski

source: Mongolian
sl_si: Mongolski

source: Malay
hu_hu: Maláj
sl_si: Malajski

source: Norwegian (Bokml)
sl_si: Norveški (Bokml)

source: Norwegian
hu_hu: Norvég
sl_si: Norveški

source: Persian
hu_hu: Perzsa
sl_si: Perzijski

source: Polish
hu_hu: Lengyel
sl_si: poljski

source: Portuguese (Brazil)
sl_si: Portugalski (Brazilija)

source: Portuguese (Portugal)
sl_si: Portugalski (Portugalska)

source: Romanian
hu_hu: Román
sl_si: Romunski

source: Russian (Russia)
sl_si: Ruski (Rusija)

source: Russian (Ukraine)
sl_si: Ruski (Ukrajina)

source: Slovak
hu_hu: Szlovák
sl_si: Slovaški

source: Slovenian
hu_hu: Szalovén
sl_si: Slovenski

source: Spanish (Argentina)
sl_si: Španski (Argentina)

source: Spanish (Bolivia)
sl_si: Španski (Bolivija)

source: Spanish (Chile)
sl_si: Španski (Čile)

source: Spanish (Columbia)
sl_si: Španski (Kolumbija)

source: Spanish (Costa Rica)
sl_si: Španski (Costa Rica)

source: Spanish (Dominican Republic)
sl_si: Španski (Dominikanska republika)

source: Spanish (Ecuador)
sl_si: Španski (Ekvador)

source: Spanish (Spain)
sl_si: Španski (Španija)

source: Spanish (Guatemala)
sl_si: Španski (Gvatemala)

source: Spanish (Honduras)
sl_si: Španski (Honduras)

source: Spanish (Mexico)
sl_si: Španski (Meksiko)

source: Spanish (Nicaragua)
sl_si: Španski (Nikaragva)

source: Spanish (Panama)
sl_si: Španski (Panama)

source: Spanish (Peru)
sl_si: Španski (Peru)

source: Spanish (Puerto Rico)
sl_si: Španski (Puerto Rico)

source: Spanish (Paraguay)
sl_si: Španski (Paragvaj)

source: Spanish (El Salvador)
sl_si: Španski (El Salvador)

source: Spanish (United States)
sl_si: Španski (ZDA)

source: Spanish (Uruguay)
sl_si: Španski (Urugvaj)

source: Spanish (Venezuela)
sl_si: Španski (Venezuela)

source: Spanish (Latin America)
sl_si: Španski (Latinska Amerika)

source: Serbian
hu_hu: Szerb
sl_si: Srbski

source: Swedish (Finland)
sl_si: Švedski (Finska)

source: Swedish (Sweden)
sl_si: Švedski (Švedska)

source: Thai
sl_si: Tajski

source: Turkish
hu_hu: Török
sl_si: Turški

source: Ukrainian
hu_hu: Ukrán
sl_si: Ukrajinski

source: Uzbek
hu_hu: Uzbég
sl_si: Uzbekistanski

source: Urdu (Pakistan)
sl_si: Urdski (Pakistan)

source: Vietnamese
sl_si: Vijetnamski

source: Welsh
hu_hu: Walesi
sl_si: Velski

source: HTTP Accept Language
sl_si: določi jezik iz brskalnika

source: Zenphoto Image Processing Error: %s
sl_si: Napaka pri procesiranju slike: %s

source: Request URI: [ <code>%s</code> ]
sl_si: URI za zahtevek: [ <code>%s</code> ]

source: Cache: [<code>%s</code>]
sl_si: Predpomnilnik: [<code>%s</code>]

source: Image: [<code>%s</code>]
sl_si: Slika: [<code>%s</code>]

source: Debug
hu_hu: Nyomkövetés
sl_si: Razhroščevanje

source: Arguments:
hu_hu: Argumentumok:
sl_si: Parametri:

source: Image not found or is unreadable.
hu_hu: A kép nem található,vagy olvashatatlan.
sl_si: Ne najdem slike oz. je ne morem prebrati.

source: Unknown error! Please report to the developers at <a href="http://www.zenphoto.org/">www.zenphoto.org</a>
sl_si: Neznana napaka! Prosim, poročajte razvijalcem Zenphota na <a href="http://www.zenphoto.org/">www.zenphoto.org</a>

source: Orientation
hu_hu: Tájolás
sl_si: Usmerjenost

source: 35mm Equivalent Focal Length
hu_hu: 35 mm-nek megfelelő gyújtótávolság
sl_si: Goriščna razdalja (ekvivalent 35mm)

source: Time Taken
hu_hu: Készítés időpontja
sl_si: Čas posnetka

source: Original Width
hu_hu: Eredeti szélesség
sl_si: Izvorna širina

source: Original Height
hu_hu: Eredeti magasság
sl_si: Izvorna višina

source: Subject Distance
sl_si: Oddaljenost motiva

source: Latitude
hu_hu: Szélességi fok
sl_si: Zemljepisna širina

source: Latitude Reference
hu_hu: Szélességi fok
sl_si: Referenca zemljepisne širine

source: Longitude
hu_hu: Hosszúsági fok
sl_si: Zemljepisna dolžina

source: Longitude Reference
hu_hu: Hosszúsági fok
sl_si: Referenca zemljepisne dolžine

source: Altitude
hu_hu: Magasság
sl_si: Višina

source: Altitude Reference
hu_hu: Tengerszint feletti magasság
sl_si: Referenca višine

source: A comment has been placed in moderation on your album "%1$s".
sl_si: V albumu "%1$s" je nov neodobren komentar.

source: A comment has been posted on your album "%1$s".
sl_si: Nekdo je komentiral vaš album "%1$s".

source: A comment has been placed in moderation on your article "%1$s".
sl_si: K članku "%1$s" je dodan nov neodobren komentar.

source: A comment has been posted on your article "%1$s".
sl_si: Nekdo je komentiral vaš članek "%1$s".

source: A comment has been placed in moderation on your page "%1$s".
sl_si: K strani "%1$s" je dodan nov neodobren komentar.

source: A comment has been posted on your page "%1$s".
sl_si: Nekdo je komentiral vašo stran "%1$s".

source: A comment has been placed in moderation on your image "%1$s" in the album "%2$s".
sl_si: K sliki "%1$s" v albumu "%2$s" je dodan nov neodobren komentar.

source: A comment has been posted on your image "%1$s" in the album "%2$s".
sl_si: K sliki "%1$s" v albumu "%2$s" je dodan nov komentar.

source: Author: %1$s Email: %2$s Website: %3$s Comment: %4$s
sl_si: Avtor: %1$s E-pošta: %2$s Spletna stran: %3$s Komentar: %4$s

source: You can view all comments about this item here: %1$s
sl_si: Tule lahko vidite vse komentarje na ta predmet: %1$s

source: You can edit the comment here: %1$s
sl_si: Tu lahko popravite komentar: %1$s

source: Comment posted
sl_si: Komentar je dodan

source: Page access %2$s (%1$s)
sl_si: Dostop do strani %2$s (%1$s)

source: Too few arguments! Image not found.
hu_hu: Túl kevés argumentum! A kép nem található.
sl_si: Premalo argumentov! Ne najdem slike.

source: The cache directory does not exist. Please create it and set the permissions to 0777.
hu_hu: A gyorsítótár mappája nem létezik. Kérlek hozd létre, és tedd írhatóvá.
sl_si: Mapa za predpomnenje cache ne obstaja. Prosim, ustvarite jo in nastavite dovoljenja na 0777.

source: The cache directory is not writable! Attempts to chmod didn't work.
hu_hu: A gyorsítótár mappája nem írható! Chmod alkalmazása nem sikerült.
sl_si: Ne morem pisati v mapo za predpomnenje cache! Poskusi nastavitve dovoljenj s chmod mi niso uspeli.

source: Image not found; file does not exist.
hu_hu: A kép nem található; a fájl nem létezik.
sl_si: Ne najdem slike; datoteka ne obstaja.

source: Abort
hu_hu: Megszakítás
sl_si: Neuspelo

source: Missing zlib extensions
hu_hu: Hiányzó zlib kiterjesztések
sl_si: Manjka podaljšek (extension) za zlib.

source: Invalid number / type of arguments
hu_hu: érvénytelen szám / argumentum típus
sl_si: Nepravilno število ali tip argumentov

source: Invalid variable type p_filelist
hu_hu: érvénytelen változó p_filelist
sl_si: Nepravilen tip spremenljivke p_filelist

source: Invalid variable type %s for p_filelist
sl_si: Nepravilen tip spremenljivke %s za p_filelist

source: Unable to open archive %s in binary read mode
sl_si: Ne morem odpreti paketa %s v načinu za binarno branje

source: No file with filename
hu_hu: Nincs ilyen nevű fájl
sl_si: Ne obstaja datoteka z imenom

source: Invalid variable type p_archive_to_add
hu_hu: Érvénytelen válltozó típus: p_archive_to_add
sl_si: Nepravilen tip spremenljivke p_archive_to_add

source: Missing archive file
hu_hu: Hiányzó archívumfájl
sl_si: Ni arhiva

source: Unable to read archive
hu_hu: Nem lehet olvasni az archívumot
sl_si: Ne morem brati arhiva

source: Invalid optional parameter %s for this method
sl_si: Neveljeven neobvezen (optional) parameter %s za to metodo

source: Missing parameter value for option
hu_hu: Hiányzó paraméter érték az opciónál
sl_si: Manjka vrednost parametra za opcijo

source: Wrong parameter value for option
hu_hu: Hibás paraméter érték az opciónál
sl_si: Napačna vrednost parametra za opcijo

source: Value must be integer, string or array for option
hu_hu: Az értéknek egész számnak, szóláncnak, vagy tömbnek kell lennie
sl_si: Vrednost mora biti integer, string ali array za opcijo

source: Too many values in index range for option
hu_hu: Túl sok érték az index tartományban
sl_si: Preveč vrednosti v polju za opcijo

source: Invalid order of index range for option
hu_hu: Helytelen sorrend az index tartomány opciójában
sl_si: Napačen vrstni red v polju za opcijo

source: Unknown parameter
hu_hu: Ismeretlen paraméter
sl_si: Neznan parameter

source: Missing mandatory parameter
hu_hu: Hiányzó kötelező paraméter.
sl_si: Manjka obvezen parameter

source: Invalid file attribute
hu_hu: Érvénytelen fájl attribútum
sl_si: Napačen atribut datoteke

source: Invalid type %1$s String expected for attribute %2$s
sl_si: Pričakovan tip %1$s je string za atribut %2$s

source: Invalid empty filename for attribute
hu_hu: Helytelen: a fájlnév üres
sl_si: Ime datoteke je prazno (napaka) za atribut

source: Invalid empty short filename for attribute
hu_hu: Helytelen: a rövid fájlnév üres
sl_si: Kratko ime datoteke je prazno (napaka) za atribut

source: Invalid empty full filename for attribute %s
sl_si: Polno ime datoteke je prazno (napaka) za atribut %s

source: Invalid type %1$s Integer expected for attribute %2$s
sl_si: Pričakovan tip %1$s je integer za atribut %2$s

source: File
hu_hu: Fájl
sl_si: Datoteka

source: Unable to open temporary file %s in binary write mode
sl_si: Ne morem odpreti začasne datoteke %s v načinu za binarno pisanje

source: Zip file %s already open
sl_si: Datoteka zip %s je že odprta

source: Unable to open archive %1$s in %2$s mode
sl_si: Ne morem odpreti paketa %1$s v načinu %2$s

source: File %s does not exists
sl_si: Datoteka %s ne obstaja

source: Invalid file list parameter (invalid or empty list)
hu_hu: Helytelen fájl lista paraméter (helytelen vagy üres lista)
sl_si: Napačen parameter za spisek datotek (napačen ali prazen)

source: Unable to open file %s in binary read mode
sl_si: Ne morem odpreti datoteke %s v načinu za binarno branje

source: Invalid archive size
hu_hu: Érvénytelen archívum méret
sl_si: Napačna velikost paketa

source: Filename %1$s is compressed by an unsupported compression method (%2$s)
sl_si: Datoteka %1$s je stisnjena z nepodprto metodo (%2$s)

source: Unsupported encryption for filename %s
sl_si: Datoteka %s je zakriptirana z nepodprto metodo

source: Filename %s is outside PCLZIP_OPT_EXTRACT_DIR_RESTRICTION
sl_si: Datoteka %s je zunaj PCLZIP_OPT_EXTRACT_DIR_RESTRICTION

source: Filename %s is already used by an existing directory
sl_si: Ime datoteke %s je že v uporabi kot ime mape

source: Filename %s exists and is write protected
sl_si: Datoteka %s že obstaja in je zaščitena proti pisanju

source: Newer version of %s exists and option PCLZIP_OPT_REPLACE_NEWER is not selected
sl_si: Obstaja nova različica %s in možnost PCLZIP_OPT_REPLACE_NEWER ni aktivna

source: Invalid archive structure
hu_hu: Érvénytelen archívum struktúra
sl_si: Napačna struktura paketa

source: Invalid block size :
hu_hu: Érvénytelen blokk méret :
sl_si: Napačna velikost bloka :

source: Unable to go to the end of the archive
hu_hu: Nem sikerült az archívum végére ugrani
sl_si: Ne morem priti do konca paketa

source: Unable to seek back to the middle of the archive
hu_hu: Nem lehet visszatalálni az archívum közepére
sl_si: Ne morem se premakniti (seek) na sredo paketa

source: Unable to find End of Central Dir Record signature
hu_hu: Képtelen megtalálni a Központi Jegyzék Bejegyzés aláírásának végét
sl_si: Ne morem najti End of Central Dir Record

source: Invalid End of Central Dir Record size :
hu_hu: Központi Jegyzék Bejegyzés méretének érvénytelen vége:
sl_si: Napačna velikost End of Central Dir Record :

source: The central dir is not at the end of the archive.
hu_hu: A központi jegyzék nincs az archívum végén.
sl_si: Central Dir ni na koncu paketa.

source: Some trailing bytes exists after the archive.
hu_hu: Néhány követő byte van az archívum után.
sl_si: Nekaj bajtov obstaja še za koncem paketa.

source: Unable to create directory
hu_hu: Sikertelen könyvtár létrehozás
sl_si: Ne morem ustvariti mape

source: Unable to open archive file %s in binary write mode
sl_si: Ne morem odpreti paketa %s v načinu za binarno pisanje

source: Click here to register for this site.
sl_si: Tu kliknite, če se želite včlaniti.

source: create
hu_hu: létrehozás
sl_si: ustvari

source: update
hu_hu: frissítés
sl_si: posodobi

source: Zen Photo Setup
hu_hu: Zen Photo Beállítás
sl_si: Namestitev Zenphota

source: Upgrade
hu_hu: Frissítés
sl_si: Posodobitev

source: Setup
hu_hu: Beállítások
sl_si: Namestitev

source: Zenphoto has detected that you're upgrading to a new version.
hu_hu: A zenphoto észlelte, hogy egy újabb veziót telepétesz.
sl_si: Zenphoto je zaznal, da ga želite posodobiti.

source: Welcome to Zenphoto! This page will set up Zenphoto on your web server.
hu_hu: Üdvözöllek a Zenphoto-ban! Ez az oldal telepíteni fogja a Zenphoto-t a szerveredre.
sl_si: Dobrodošli v ZenPhoto! Ta stran bo namestila ZenPhoto na vaš strežnik.

source: Systems Check:
hu_hu: Rendszer ellenőrzése:
sl_si: Preverjanje sistema:

source: Error!
sl_si: Napaka!

source: Warning!
sl_si: Pozor!

source: <strong>Notice!</strong> click for details
sl_si: <strong>Opomba!</strong> Kliknite za podrobnosti

source: Notice!
sl_si: Opomba!

source: You must create the folder <em>%1$s</em><br /><code>mkdir(%2$s, 0777)</code>.
sl_si: Izdelati morate mapo <em>%1$s</em><br /><code>mkdir(%2$s, 0777)</code>.

source: <em>%1$s</em> folder [<em>%2$s</em> does not exist]
sl_si: mapa <em>%1$s</em> [<em>%2$s</em> ne obstaja]

source: <em>%1$s</em> folder [<em>%2$s</em> does not exist and <strong>setup</strong> could not create it]
sl_si: mapa <em>%1$s</em> [<em>%2$s</em> ne obstaja in <strong>namestitev</strong> tega ne more ustvariti]

source: Change the permissions on the <code>%1$s</code> folder to be writable by the server (<code>chmod 777 %2$s</code>)
sl_si: Spremenite dovoljenja za mapo <code>%1$s</code>, tako da bo strežnik smel pisati vanjo (<code>chmod 777 %2$s</code>)

source: PHP version %s
sl_si: PHP različica %s

source: Version %1$s or greater is required.
sl_si: Nujna je različica %1$s ali novejša.

source: Zenphoto functionality is reduced when PHP <code>safe mode</code> restrictions are in effect.
hu_hu: A zenphoto képességei korlátozva vannak, ha a PHP <code>safe mode</code> érvényben van.
sl_si: Zenphoto ima manj funkcij, kadar je PHP <code>safe mode</code> vklopljen.

source: You should consider disabling <code>magic_quotes_gpc</code>. For more information <a href="http://www.zenphoto.org/2008/08/troubleshooting-zenphoto/#25" target="_new">click here</a>.
sl_si: Predlagamo, da deaktivirate <code>magic_quotes_gpc</code>. Preberete si <a href="http://www.zenphoto.org/2008/08/troubleshooting-zenphoto/#25" target="_new">več o tem</a>.

source: Your PHP graphics library does not support %1$s or %2$s
sl_si: Vaša knjižnica PHP za grafiko ne podpira %1$s ali %2$s

source: Your PHP graphics library does not support %1$s
sl_si: Vaša knjižnica PHP za grafiko ne podpira %1$s

source: To correct this you should install a graphics library with appropriate image support in your PHP
sl_si: To popravite tako, da v vaš PHP namestite grafično knjižnico s podporo za ustrezne formate slik

source: Your PHP graphics library does not support %1$s, %2$s, or %3$s
sl_si: Vaša knjižnica PHP za grafiko ne podpira %1$s, %2$s ali %3$s

source: To correct this you need to a install GD with appropriate image support in your PHP
sl_si: V vašem PHP morate namestiti modul GD s podporo za ustrezne formate

source: PHP graphics image support
sl_si: PHP podpora za grafiko

source: The unsupported image types will not be viewable in your albums.
hu_hu: A nem támogatott képformátumok nem láthatóak az albumokban.
sl_si: Nepodprti formati ne bodo vidni v vaših albumih.

source: No Zenphoto image handling library was loaded. Check your install files.
sl_si: Nobena knjižnica ZenPhota za upravljanje s slikami ni naložena. Preverite namestitvene datoteke.

source: PHP <code>gettext()</code> support
hu_hu: PHP <code>gettext()</code> támogatás
sl_si: PHP podpora za <code>gettext()</code>

source: Localization of Zenphoto currently requires native PHP <code>gettext()</code> support
hu_hu: A Zenphoto lokalizációjához jelenleg natív PHP <code>gettext()</code> támogatás szükséges
sl_si: Za lokalizacijo (prevod) ZenPhota je potrebna podpora za <code>gettext()</code> v PHP
