Repository: dirkhusemann/zenphoto
Catalog: zp-core/locale/*/LC_MESSAGES/zenphoto.po
Languages: hu_hu, sl_si

source: backup completed using <em>%1$s(%2$s)</em> compression
sl_si: Varnostna kopija je ustvarjena. Uporabljena je bilo stiskanje <em>%1$s(%2$s)</em>.

source: backup completed
sl_si: Izdelava varnostne kopije je zaključena

source: backup failed
sl_si: Izdelava varnostne kopije ni uspela

source: restore completed
sl_si: Obnova iz varnostne kopije je zaključena

source: restore completed using %s compression
sl_si: Obnovitev je zaključena. Uporabljeno je bilo stiskanje %s.

source: restore failed
sl_si: Obnova iz varnostne kopije ni uspela

source: Your database is <strong>%s</strong>
sl_si: Vaša podatkovna zbirka je <strong>%s</strong>

source: Tables are prefixed by <strong>%s</strong>
sl_si: Tabele v njej imajo predpono <strong>%s</strong>

source: Backup the tables in your database.
sl_si: Izdela varnostno kopijo tabel podatkovne zbirke in zapiše v datoteko.

source: Backup the Database
sl_si: Ustvari varnostno kopijo podatkovne zbirke

source: You have not yet created a backup set.
sl_si: Nimate še nobene varnostne kopije.

source: Select the database restore file:
sl_si: Izberite datoteko z varnostno kopijo:

source: Restore the Database
sl_si: Obnovi podatkovno zbirko iz varnostne kopije

source: Gallery Statistics
sl_si: Statistika galerije

source: News Articles
sl_si: Novice

source: News Categories
sl_si: Kategorije novic

source: most used
sl_si: največkrat uporabljeno

source: most viewed
sl_si: največkrat ogledano

source: most rated
sl_si: največkrat ocenjeno

source: top rated
sl_si: najbolje ocenjeno

source: most commented
sl_si: največkrat komentirano

source: most images
sl_si: največ slik

source: latest
sl_si: novejše

source: No statistic available
sl_si: Ni podatkov

source: Back to the top 10 lists
sl_si: Nazaj na spisek naj 10

source: View more
sl_si: Več

source: top
sl_si: na vrh

source: %s images
sl_si: %s slik

source: <strong>%1$u</strong> images (%2$u not visible)
sl_si: <strong>%1$u</strong> slik (%2$u nevidnih)

source: <strong>%u</strong> images
sl_si: <strong>%u</strong> slik

source: <strong>%1$u</strong> albums (%2$u not published)
sl_si: <strong>%1$u</strong> albumov (%2$u neobjavljenih)

source: <strong>%u</strong> albums
sl_si: <strong>%u</strong> albumov

source: <strong>%1$u</strong> comments (%2$u in moderation)
sl_si: <strong>%1$u</strong> komentarjev (%2$u neobjavljenih)

source: <strong>1</strong> comment (%u in moderation)
sl_si: <strong>1</strong> komentar (%u neodobrenih)

source: <strong>%u</strong> comments
sl_si: <strong>%u</strong> komentarjev

source: <strong>1</strong> comment
sl_si: <strong>1</strong> komentar

source: <strong>%1$u</strong> Pages
sl_si: <strong>%1$u</strong> strani

source: <strong>%1$u</strong> News articles
sl_si: <strong>%1$u</strong> Novic

source: <strong>%1$u</strong> News articles (<strong>%2$u</strong> unpublished)
sl_si: <strong>%1$u</strong> Novic (<strong>%2$u</strong> neobjavljenih)

source: <strong>%1$u</strong> Categories
sl_si: <strong>%1$u</strong> Kategorij

source: News categories
sl_si: Kategorije novic

source: From
sl_si: Od

source: to
sl_si: do

source: Show
hu_hu: Mutat
sl_si: Pokaži

source: Back to top
sl_si: Na vrh

source: Reset thumbs
sl_si: Sličice albumov

source: Reset album thumbnails.
sl_si: Masovno nastavljanje sličic albumov.

source: Reset your album thumbnails
sl_si: Nastavite sličice svojih albumov

source: Thumbnails all set to <em>%s</em>.
sl_si: Vse sličice so nastavljene na <em>%s</em>.

source: Thumbnail reset query failed
sl_si: Nastavitev sličic albumov ni uspela

source: Sets all album thumbs to <em>random</em>.
sl_si: Vse sličice albumov nastavi na <em>naključno</em>.

source: Set to random
sl_si: Nastavi na naključno

source: Set to most recent
sl_si: Nastavi na najnovejšo

source: Publish content
sl_si: Objavljanje vsebine

source: Manage unpublished content in your gallery.
sl_si: Upravljanje z neobjavljeno vsebino vaše galerije.

source: Manage content publication
sl_si: Upravljanje objave vsebine

source: Publish albums by default
sl_si: Nove albume vedno takoj objavi

source: Make images visible by default
sl_si: Nove slike naj bodo vedno takoj vidne

source: Set defaults for album publishing and image visibility.
sl_si: Shrani izbrano delovanje za objavljanje albumov in vidnost novih slik.

source: Set defaults
sl_si: Nastavi kot privzeto

source: Unpublished albums:
sl_si: Neobjavljeni albumi:

source: Publish waiting albums.
sl_si: Objavi albume, ki so na čakanju.

source: Publish albums
sl_si: Objavi albume

source: No albums are unpublished.
sl_si: Noben album ni neobjavljen.

source: Review images older than: %s
sl_si: Pregled slik starejših od: %s

source: Review not visible images.
sl_si: Preglej slike, ki niso vidne.

source: Review images
sl_si: Pregled slik

source: Set visible:
sl_si: Nastavi vidnost:

source: Set waiting images to visible.
sl_si: Označene slike postanejo vidne.

source: Make images visible
sl_si: Naj bodo slike vidne

source: No images meet the criteria.
sl_si: Nobena slika ne ustreza.

source: Show fields
hu_hu: Mutatsd a mezőket

source: File name
hu_hu: Fájl neve

source: Hint:
hu_hu: Tipp:

source: delete checked tags
hu_hu: kijelölt címkék törlése

source: To delete tags from the gallery, place a checkmark in the box for each tag you wish to delete then press the <em>delete checked tags</em> button. The brackets contain the number of times the tag appears.
hu_hu: Pipáld ki a törölni kívánt címkéket, majd nyomd meg al <em>kijelölt címkék törlése</em> gombot. A szögletes zárójelben a címkék előfordulása szerepel.

source: rename tags
hu_hu: címkék átnevezése

source: To change the value of a tag enter a new value in the text box in front of the tag. Then press the <em>rename tags</em> button
hu_hu: Egy címke megváltoztatásához írd be az új címkét az előtte lévő mezőbe, majd nyomd meg a <em>címkék átnevezése</em> gombot.

source: save new tags
hu_hu: új címkék mentése

source: Add tags to the list by entering their names in the input fields of the <em>New tags</em> list. Then press the <em>save new tags </em>button
hu_hu: Új címkék hozzáadásához írd be azok neveit az üres mezőkbe, majd nyomd meg az <em>új címkék mentése</em> gombot.

source: Show theme for
hu_hu: Téma mutatása erre:

source: Current theme for
hu_hu: Jelenlegi téma:

source: Themes allow you to visually change the entire look and feel of your gallery. Theme files are located in your
hu_hu: A témák lehetővé teszik galériád küllemének és működésének teljes átformálását. A témafájlokat megtalálhatod a

source: folder. You can download more themes from the
hu_hu: mappában. További témákat letölthetsz a

source: zenphoto themes page
hu_hu: zenphoto témák oldala

source: Place the downloaded themes in the
hu_hu: A letöltött témákat helyezd el a

source: folder and they will be available for your use.
hu_hu: mappában, és használhatóak lesznek.

source: Use this Theme
hu_hu: Használd ezt a témát

source: Assign Theme
hu_hu: Téma hozzárendelése

source: Arabic
hu_hu: Arab

source: Basque
hu_hu: Baszk

source: Chinese
hu_hu: Kínai

source: Chinese Hong Kong
hu_hu: Kínai - Hong Kong

source: Chinese Taiwan
hu_hu: Kínai - Taiwan

source: Dutch
hu_hu: Holland

source: English (US)
hu_hu: Angol (US)

source: English (UK)
hu_hu: Angol (GB)

source: French
hu_hu: Francia

source: German
hu_hu: Német

source: Italian
hu_hu: Olasz

source: Malagasy
hu_hu: Madagasi

source: Brazilian Portuguese
hu_hu: Portugál (Brazil)

source: European Portuguese
hu_hu: Portugál (Európai)

source: Russian
hu_hu: Orosz

source: Sinhala
hu_hu: Szingalézi

source: Spanish
hu_hu: Spanyol

source: Spanish Latin America
hu_hu: Spanyol (Latinamerikai)

source: Swedish
hu_hu: Svéd

source: vi_VN
hu_hu: Vietnámi

source: This web-based upload accepts ZenPhoto formats:
hu_hu: A web feltöltés a következő képformátumokat támogatja:

source: The maximum size for any one file is
hu_hu: Bármelyik fájl maximális mérete

source: Don't forget, you can also use
hu_hu: Ne feledd,

source: File Transfer Protocol
hu_hu: Fájlátviteli protokoll

source: to upload folders of images into the albums directory!
hu_hu: segétségével szintén feltöltheted képeid mappáit az albums könyvtárba!

source: Doesn't reload!
hu_hu: Ne töltsd be újra az oldalat!

source: and <strong>setup</strong> could not create it
hu_hu: és a <strong>telepítő</strong> képtelen létrehozni

source: does not exist
hu_hu: nem létezik.

source: You must create the folder
hu_hu: Létre kell hoznod a mappát

source: is not writeable and
hu_hu: nem írható és

source: could not make it so]
hu_hu: nem teheti írhatóvá]

source: Change the permissions on the
hu_hu: Változtasd meg a hozzáférési jogokat a

source: folder to be writable by the server
hu_hu: a mappának írhatónak kell lennie a szerver számára

source: folder
hu_hu: mappa

source: PHP version
hu_hu: PHP verzió

source: Version
hu_hu: Verzió

source: or greater is required.
hu_hu: vagy újabb szükséges.

source: [is set]
hu_hu: [be van kapcsolva]

source: PHP GD support
hu_hu: PHP GD támogatás

source: is not installed
hu_hu: nincs telepítve

source: You need to install GD support in your PHP
hu_hu: Telepétened kell a PHP GD támogatását

source: should
hu_hu: lehet

source: need to
hu_hu: szükséges

source: PHP GD image support
hu_hu: PHP GD képtámogatás

source: Your PHP GD does not support
hu_hu: A telepített PHP GD nem támogatja

source: To correct this you
hu_hu: Ahhoz, hogy ezt kijavítsd

source: install GD with appropriate image support in your PHP
hu_hu: Telepítsd a PHP GD könyvtárat a megfelelő képformátum támogatással.

source: PHP <code>glob()</code> support
hu_hu: PHP <code>glob()</code> támogatás

source: is disabled
hu_hu: le van tiltva

source: You need to set the define <code>SAFE_GLOB</code> to <code>true</code> in <code>functions.php</code>
hu_hu: Állítsd a <code>SAFE_GLOB</code> értékét <code>true</code>-ra a <code>functions.php</code> fájlban

source: [is not present]
hu_hu: [nincs telepítve]

source: failed
hu_hu: nem sikerült

source: Strings generated internally by PHP may not display correctly. (e.g. dates)
hu_hu: A PHP által generált kifejezések nem mindig korrektek. (pl. dátum)

source: PHP MySQL support
hu_hu: PHP MySQL támogatás

source: file
hu_hu: fájl

source: [does not exist]
hu_hu: [nem létezik]

source: Edit the <code>zp-config.php.source</code> file and rename it to <code>zp-config.php</code>
hu_hu: Szerkeszd a <code>zp-config.php.source</code> fájlt, és nevezd át <code>zp-config.php</code>-ra

source: MySQL setup in
hu_hu: MySQL beállítása itt:

source: Fill in the missing information below and <strong>setup</strong> will attempt to update your <code>zp-config.php</code> file.
hu_hu: Töltsd ki az alábbi információkat és a <strong>telepítő</strong> megpróbálja frissíteni a <code>zp-config.php</code> fájlt.

source: connect to MySQL
hu_hu: csatlakozás az adatbázisszerverhez

source: Could not connect to the <strong>MySQL</strong> server. Check the <code>user</code>, <code>password</code>, and <code>database host</code> in your <code>zp-config.php</code> file and try again.
hu_hu: Nem sikerült csatlakozni a <strong>MySQL</strong> szerverhez. Ellenőrizd a <code>user</code>, <code>password</code>, és a <code>database host</code> értékeket a <code>zp-config.php</code> fájlban és próbáld újra.

source: MySQL version
hu_hu: MySQL verzió

source: or greater is required
hu_hu: vagy újabb szükséges

source: connect to the database <code>
hu_hu: adatbázishoz való csatlakozás <code>

source: Could not access the <strong>MySQL</strong> database
hu_hu: Nem sikerült csatlakozni a <strong>MySQL</strong> adatbázishoz.

source: Check the <code>user</code>, <code>password</code>, and <code>database name</code> and try again.
hu_hu: Ellenőrizd a <code>user</code>, <code>password</code>, és a <code>database name</code> értékeket és próbáld újra.

source: Make sure the database has been created, and the <code>user</code> has access to it.
hu_hu: Bizonyosodj meg róla, hogy az adatbázis létre lett hozva, és a <code>felhasználó</code> számára hozzáférhető.

source: Select
hu_hu: Kiválaszt

source: Create
hu_hu: Létrehoz

source: Drop
hu_hu: Eldob

source: Insert
hu_hu: Beszúr

source: Update
hu_hu: Frissít

source: Alter
hu_hu: Módosít

source: MySQL access rights
hu_hu: MySQL hozzáférési jogok

source: Your MySQL user must have
hu_hu: Az MySQL felhasználódnak rendelkeznie kell

source: found
hu_hu: találtam

source: [Failed]
hu_hu: [Sikertelen]

source: Server seems not to be Apache or Apache-compatible, skipping <code>.htaccess</code> test
hu_hu: A szervered nem Apache vagy Apache kompatibilis, kihagyom a <code>.htaccess</code> fájl tesztelését

source: is empty or does not exist
hu_hu: üres, vagy nem létezik

source: wrong version
hu_hu: rossz verzió

source: (<em>RewriteEngine</em> is
hu_hu: (a <em>RewriteEngine</em>

source: missing
hu_hu: hiányzik

source: <em>.htaccess</em> RewriteBase is
hu_hu: A <em>.htaccess</em> fájl RewriteBase-je:

source: [Does not match install folder]
hu_hu: [Nem egyezik az installálás mappájával]

source: Either make the file writeable or set <code>RewriteBase</code> in your <code>.htaccess</code> file to
hu_hu: Tedd írhatóvá a fájlt, vagy állítsd be a <code>RewriteBase</code> értékét a <code>.htaccess</code> fájlban erre:

source: About to
hu_hu: Készülődés

source: tables
hu_hu: táblázatok

source: Table creation failure
hu_hu: Táblázatgenerálás sikertelen

source: Done with table
hu_hu: A táblázat kész

source: with errors
hu_hu: hibákkal

source: You need to
hu_hu: Szükséged van

source: set your admin user and password
hu_hu: add meg az admin felhasználót és jelszavát

source: You can now
hu_hu: Most

source: View your gallery
hu_hu: Galériád megtekintése

source: , or
hu_hu: , vagy

source: administrate.
hu_hu: adminisztrálhatod azt.

source: We are all set to
hu_hu: Készen állok

source: create the database tables
hu_hu: adatbázis táblázatok létrehása

source: create the database table
hu_hu: adatbázis táblázat létrehása

source: update the database table
hu_hu: adatbázis táblázat frissítése

source: You should run setup.php to check your configuration. If you haven't created the database yet, now would be a good time.
hu_hu: Futtatnod kéne a setup.php fájlt, hogy ellenőrizhesse a konfigurációt. Ha még nem hoztad létre az adatbázist, itt az idő!

source: The zp-config.php file does not exist. You should run setup.php to check your configuration and create this file.
hu_hu: A zp-config.php fájl nem létezik. Futtatnod kéne a setup.php fájlt, hogy ellenőrizhesse a konfigurációt és létrehozhassa ezt a fájlt.

source: Zenphoto Image Processing Error:
hu_hu: Zenphoto - Képfeldolgozási hiba:

source: Request URI:
hu_hu: URI kérés:

source: Cache:
hu_hu: Gyorsétótár:

source: Image:
hu_hu: Kép:

source: size =
hu_hu: méret =

source: width =
hu_hu: szélesség =

source: height =
hu_hu: magasság =

source: quality =
hu_hu: minőség =

source: thumb =
hu_hu: miniatűr =

source: crop =
hu_hu: levágás =

source: The GD Library is not installed or not available.
hu_hu: A GD könyvtár nincs telepétve, vagy nem elérhető.

source: Unknown error! Please report to the developers at
hu_hu: Ismeretlen hiba! Kérlek értesítsd a fejlesztőket:

source: Can only use download_file() if archive is in memory. Redirect to file otherwise, it is faster.
hu_hu: Csak akkor használható a download_file(), ha az archívum a memóriában van. Egyébként a fájlhoz átirányítás gyorsabb.

source: Could not add
hu_hu: Nem sikerült hozzáadni a

source: to archive because the filename is too long.
hu_hu: az achívum fájlhoz, mert a fájlneve túl hosszú.

source: Could not open file
hu_hu: Nem sikerült a fájl megnyitása

source: for reading. It was not added.
hu_hu: olvasásra. Nem lett hozzáadva.

source: Could not extract from
hu_hu: Nem sikerült kicsomagolni innen:

source: it is corrupt.
hu_hu: hibás

source: already exists.
hu_hu: már létezik.

source: Could not open
hu_hu: Nem sikerült megnyitni

source: for writing.
hu_hu: írásra

source: Could not open sfx module from
hu_hu: Nem lehet megnyitni az sfx modult innen:

source: Forum
hu_hu: Fórum

source: admin information
hu_hu: admin információ

source: gallery configuration
hu_hu: galéria beállítása

source: image display
hu_hu: kép megjelenítés

source: comment configuration
hu_hu: hozzászólások kezelése

source: theme options
hu_hu: témák beállítása

source: plugin options
hu_hu: bővítmények beállítása

source: Admin login information
hu_hu: Admin bejelentkezési információk

source: Username:
hu_hu: Felhasználónév:

source: View all albums
hu_hu: Minden albumot lát

source: Administrators with <em>User admin</em> rights can manage all albums. All others may manage only those that are selected.
hu_hu: <em>Felhasználó kezelő</em> jogokkal rendelkező adminisztrátorok az összes albumot menedzselhetik, a többiek csak a hozzájuk rendelt albumokat.

source: Your
hu_hu: A Te

source: passwords were empty or did not match
hu_hu: A jelszavak nem lettek megadva, vagy nem egyeznek.

source: is not available.
hu_hu: nem elérhető.

source: The locale
hu_hu: A lokalizáció

source: is not supported on your server.
hu_hu: a szervered nem támogatja.

source: General Gallery Configuration
hu_hu: A galéria általános beállításai

source: Enable user name login field:
hu_hu: Felhasználó név mező engedélyezése:

source: Password for the the search guest user. If this is set, visitors must know this password to view search results.
hu_hu: A kereső vendég felhasználó jelszava. Ha be van állítva, a látogatóknak ismerniük kell a jelszavat, hogy láthassák a keresések eredményeit.

source: If you're in a different time zone from your server, set the offset in hours.
hu_hu: Ha más időzónában vagy, mint a szervered, állítsd be az eltolódást órákban.

source: Enable mod_rewrite:
hu_hu: mod_rewrite használata:

source: If you have Apache <em>mod_rewrite</em>, put a checkmark here, and you'll get nice cruft-free URLs.
hu_hu: Ha szervered támogatja, pipáld ki, hogy szép és érthetőbb URL-eket használhass.

source: Mod_rewrite Image suffix:
hu_hu: Mod_rewrite kép kiterjesztés:

source: If <em>mod_rewrite</em> is checked above, zenphoto will appended this to the end (helps search engines). Examples: <em>.html, .php, /view</em>, etc.
hu_hu: Ha a <em>mod_rewrite</em> engedélyezve van, ez a kiterjesztés lesz hozzáadva a képekhez (segít a kereső robotoknak). Például: <em>.html, .php, /view</em>, stb.

source: <strong>Note:</strong> if you have created multi-language strings, uncheck this option, then save anything, you will loose your strings.
hu_hu: <strong>Megjegyzés:</strong> ha használod ezt a funkciót, majd letiltod, az összes többnyelvű mező törlődik.

source: The number of new images/albums/comments you want to appear in your site's RSS feed.
hu_hu: Képek, albumok és hozzászólások száma az RSS feed-ben.

source: Album date:
hu_hu: Az album dátuma:

source: Use latest image date
hu_hu: Használd a legújabb kép dátumát

source: Set this option if you wish your album date to reflect the date of the latest image uploaded. Otherwise it will initially be set to the date the album was created.
hu_hu: Aktiváld, ha azt szeretnéd, hogy az albumod dátuma megegyezzen az utoljára feltöltött kép dátumával. Egyébként az album dátuma a létrehozásának dátuma lesz.

source: Sort order for the albums on the index of the gallery
hu_hu: Az albumok sorrendje a galéria index oldalán.

source: The set of fields on which searches may be performed.
hu_hu: Azon mezők csoportja, amelyekben keresni szeretnél.

source: Enable Persistent Archives:
hu_hu: Állandó archívumok engedélyezése:

source: Put a checkmark here to re-serve Zip Archive files. If not checked they will be regenerated each time.
hu_hu: Aktiváld, ha állandó ZIP archívumokat szeretnél szolgáltatni. Ha nincs engedélyezve, akkor minden egyes alkalommal újra ki lesznek generálva.

source: Enable gallery sessions:
hu_hu: Galéria session-ök használata

source: Put a checkmark here if you are having issues with with album password cookies not being retained. Setting the option causes zenphoto to use sessions rather than cookies.
hu_hu: Aktiváld, ha gondjaid támadtak a jelszóval védett albumokkal. Ha engedélyezve van a zenphoto sütik helyett munkameneteket (session-öket) használ.

source: Visual Thumb selection:
hu_hu: Vizuális miniatűr választás:

source: Setting this option places thumbnails in the album thumbnail selection list (the dropdown list on each album's edit page). In Firefox the dropdown shows the thumbs, but in IE and Safari only the names are displayed (even if the thumbs are loaded!). In albums with many images loading these thumbs takes much time and is unnecessary when the browser won't display them. Uncheck this option and the images will not be loaded.
hu_hu: Ezzel a beállítással miniatűröket helyezhetsz el az album miniatűr választó listában (ez a legördülő lista az albumok szerkesztése oldalon). Firefox-ban a miniatűrök megjelennek a listában, de IE-ban és a Safari-ban csak a nevek jelennek meg (mégha a miniatűrök be is töltődnek!). Ha sok kép van egy albumban, sokáig tarthat a miniatűrök betöltése és felesleges, ha a böngésző nem jeleníti meg őket. Ha nem használod ezt az opcióot, a képek nem lesznek betöltve.

source: passwords did not match
hu_hu: a jelszavak nem egyeznek.

source: Image Display
hu_hu: Képek kezelése

source: Default sort order for images
hu_hu: Képek alapértelmezett sorrendje.

source: JPEG Compression quality for all images.
hu_hu: Képek JPEG tömörítésének minősége.

source: Thumb quality:
hu_hu: Miniatűr minősége:

source: JPEG Compression quality for all thumbnails.
hu_hu: Miniatűrök JPEG tömörítésének minősége.

source: Add a small amount of unsharp mask to images and/or thumbnails. <strong>Warning</strong>: can overload slow servers.
hu_hu: Egy picit élesebbé teszi a képeket, illetve a miniatűröket. <strong>Figyelem</strong>: túlterhelheti a lassabb szervereket!

source: The watermark image (png-24). (Place the image in the
hu_hu: Vízjel kép (PNG-24). (helyezd el a vízjel képet a

source: directory
hu_hu: könyvtárban

source: Watermark video thumbs:
hu_hu: Videó miniatűrök vízjele:

source: The watermark image (png-24) that will be overlayed on the video thumbnail (if one exists). (Place the image in the
hu_hu: A vízjel (png-24), amely lefedi a videó miniatűrét (ha létezik). (A képet helyezd el a

source: Full image quality:
hu_hu: Teljes kép minősége:

source: Controls compression on full images.
hu_hu: Teljes méretű képek tömörítésének beállítása.

source: Select the level of protection for full sized images.
hu_hu: Válassz biztonsági szintet a teljes méretű képek védelmére.

source: Disabling hotlinking prevents linking to the full image from other domains. If enabled, external links are redirect to the image page. If you are having problems with full images being displayed, try disabling this setting. Hotlinking is not prevented if <em>Full image protection</em> is <em>Unprotected</em>.
hu_hu: A hotlinkelés letiltásával megakadályozhatod, hogy más tartományokból elérhessék a teljesméretű képeidet. Ha engedélyezve van, a kűlső hivatkozások át lesznek irányítva a kép oldalára. Amennyiben problémák merülnének fel a teljes képek megjelenítésekor, próbáld meg kikapcsolni ezt az opciót. A hotlinkelés nem védhető ki, ha a <em>Teljesméretű kép védelme</em> értéke <em>Védelem nélküli</em>.
