Repository: dirkhusemann/zenphoto
Catalog: zp-core/locale/*/LC_MESSAGES/zenphoto.po
Languages: hu_hu, sl_si

source: <strong>Error parsing <em>plugin_description</em> string!</strong> Try removing semicolons from string.
hu_hu: <strong>Hibás szintaktus <em>plugin_description</em> string!</strong> Próbáld pontosvessző nélkül.
sl_si: <strong>Napaka pri branju niza <em>plugin_description</em>!</strong> Poskusite odstraniti podpičja iz niza.

source: <strong>Error parsing <em>plugin_author</em> string!</strong> Try removing semicolons from string.
hu_hu: <strong>Hibás szintaktus <em>plugin_author</em> string!</strong> Próbáld pontosvessző nélkül.
sl_si: <strong>Napaka pri tolmačenju niza <em>plugin_author</em>!</strong> Poskusite odstraniti podpičja iz niza.

source: <strong>Error parsing <em>plugin_version</em> string!</strong> Try removing semicolons from string.
hu_hu: <strong>Hibás szintaktus <em>plugin_version</em> string!</strong> Próbáld pontosvessző nélkül.
sl_si: <strong>Napaka pri tolmačenju niza <em>plugin_version</em>!</strong> Poskusite odstraniti podpičja iz niza.

source: <strong>Error parsing <em>plugin_URL</em> string!</strong> Try removing semicolons from string.
hu_hu: <strong>Hibás szintaktus <em>plugin_URL</em> string!</strong> Próbáld pontosvessző nélkül.
sl_si: <strong>Napaka pri tolmačenju niza <em>plugin_string</em>!</strong> Poskusite odstraniti podpičja iz niza.

source: <strong>Error parsing <em>plugin_disable</em> string!</strong> Try removing semicolons from string.
sl_si: <strong>Napaka pri tolmačenju niza <em>plugin_disable</em>!</strong> Poskusite odstraniti podpičja iz niza.

source: Usage information
hu_hu: Használati információ
sl_si: Podrobnosti

source: Author
hu_hu: Szerző
sl_si: Avtor

source: Refresh Database
sl_si: Osveži podatkovno zbirko

source: Finished refreshing the database
sl_si: Podatkovna zbirka je osvežena

source: Database refresh is incomplete
sl_si: Podatkovna zbirka ni bila popolnoma osvežena

source: We're all set to refresh the database
sl_si: Vse je pripravljeno na osvežitev podatkovne zbirke

source: Continue refreshing the database.
sl_si: Nadaljuj z osveževanjem podatkovne zbirke

source: Finished refershing the metadata
sl_si: Meta podatki so osveženi

source: Metadata refresh is incomplete
sl_si: Meta podatki niso bili popolnoma osveženi

source: We're all set to refresh the metadata
sl_si: Vse je pripravljeno na osvežitev meta podatkov

source: Continue refreshing the metadata.
sl_si: Nadaljuj z osveževanjem meta podatkov.

source: you should return automatically. If not press:
sl_si: vrniti bi se morali samodejno. Če se ne, kliknite:

source: This process should continue automatically. If not press:
sl_si: Ta proces naj bi nadaljeval samodejno. Če ne, kliknite:

source: Continue!
sl_si: Nadaljuj!

source: database connected
hu_hu: az adatbázis csatlakoztatva
sl_si: povezan sem s podatkovno zbirko

source: <em>%s</em> not found
sl_si: ne najdem <em>%s</em>

source: We're all set to refresh the metadata for <em>%s</em>
sl_si: Vse je pripravljeno na osvežitev meta podatkov za <em>%s</em>

source: This process should start automatically. If not press:
sl_si: Ta proces naj bi se pognal samodejno. Če ne, kliknite:

source: Refresh image metadata.
hu_hu: Kép meta-adatainak frissítése.
sl_si: Osveži meta podatke slik.

source: Go!
hu_hu: Gyerünk!
sl_si: Zdaj!

source: database not connected
hu_hu: az adatbázis nincs csatlakoztatva
sl_si: nisem povezan s podatkovno zbirko

source: Check the zp-config.php file to make sure you've got the right username, password, host, and database. If you haven't created the database yet, now would be a good time.
hu_hu: Ellenőrizd a zp-config.php fájlt és bizonyosodj meg róla, hogy helyes a felhasználónév, a jelszó, a szervernév és a adatbázis. Ha még nem hoztad létre az adatbázisodat, itt az idő!
sl_si: Preverite datoteko zp-config.php in se prepričajte, da imate prave podatke za username (uporabniško ime), password (geslo), host (strežnik) in database (podatkovno zbirko). Če podatkovne zbirke še niste ustvarili, je najbolje, da to storite zdaj.

source: Tag Management
hu_hu: Címkék kezelése
sl_si: Upravljanje z oznakami

source: Sort the tags alphabetically
hu_hu: Címkék ABC szerinti elrendezése
sl_si: Oznake razvrsti po abecedi

source: Order alphabetically
hu_hu: ABC sorrend
sl_si: Razrvsti po abecedi

source: Sort the tags by most used
hu_hu: Címkék gyakoriság szerinti elrendezése
sl_si: Razvrsti oznake glede na pogostnost uporabe

source: Order by most used
hu_hu: Sorrend használat szerint
sl_si: Razvrsti po pogostnosti uporabe

source: Delete tags from the gallery
hu_hu: Cémkék törlése a galériából
sl_si: Brisanje oznak

source: Rename tags
hu_hu: Címkék átnevezése
sl_si: Preimenovanje oznak

source: New tags
hu_hu: Új címkék
sl_si: Nove oznake

source: Delete checked tags
sl_si: Zbriši obkljukane oznake

source: Delete all the tags checked above.
hu_hu: Az összes fent kijelölt címket törlése.
sl_si: Zbriše vse obkljukane oznake.

source: To delete tags from the gallery, place a checkmark in the box for each tag you wish to delete then press the <em>Delete checked tags</em> button. The brackets contain the number of times the tag appears.
sl_si: Vsem oznakam, ki jih želite zbrisati, dodajte kljukico, nato pa kliknite gumb <em>zbriši obkljukane oznake</em>. V oklepaju je navedeno, kolikokrat je oznaka uporabljena.

source: Save all the changes entered above.
hu_hu: Az összes fenti vátoztatás mentése.
sl_si: Shrani vsa nova imena.

source: To change the value of a tag enter a new value in the text box below the tag. Then press the <em>Rename tags</em> button
sl_si: Pod oznakami, ki jih želite preimenovati, vpišite njihovo novo ime, nato pa kliknite <em>preimenuj oznake</em>.

source: Add tags
sl_si: Dodaj oznake

source: Add all the tags entered above.
hu_hu: Az összes fenti új címke hozzáadása.
sl_si: Doda vse vpisane oznake.

source: Add tags to the list by entering their names in the input fields of the <em>New tags</em> list. Then press the <em>Add tags</em> button
sl_si: Oznake dodajate tako, da v vsako polje zgoraj vpišete po eno novo oznako. Na koncu kliknite na <em>shrani nove oznake</em>.

source: Cannot edit this file!
sl_si: Te datoteke ne morete urejati!

source: File updated successfully
sl_si: Datoteka je uspešno posodobljena

source: Could not write file. Please check its write permissions
sl_si: Ne morem pisati v datoteko. Prosim, preverite dovoljenja za pisanje

source: Theme File Editor
sl_si: Urejevalnik datotek za teme

source: Theme template files (.php)
sl_si: Datoteke tem (.php)

source: Javascript files (.js)
sl_si: Datoteke Javascripta (.js)

source: Stylesheets (.css)
sl_si: Datoteke izgleda (.css)

source: Other text files
sl_si: Druge besedilne datoteke

source: Edit this file
sl_si: Uredi to datoteko

source: File <tt>%s</tt> from theme %s
sl_si: Datoteka <tt>%s</tt> iz teme %s

source: Update File
sl_si: Posodobi datoteko

source: Select a file to edit from the list on your right hand. Keep in mind that you can <strong>break everything</strong> if you are not careful when updating files.
sl_si: Izberite datoteko s spiska na desni in lahko jo boste uredili. Vedite, da lahko <em>vse pokvarite</em>, če niste pazljivi, ko posodobljate datoteke.

source: New theme name? (eg. "My Theme")
sl_si: Ime nove teme (na primer: "Moja Tema")?

source: My Theme
sl_si: Moja Tema

source: New directory name? (eg. "my_theme")
sl_si: Novo ime mape (npr. "moja_tema")?

source: no theme assigned, defaulting to Gallery theme
hu_hu: nem lett téma hozzárendelve, a Galéria témája lesz haználva
sl_si: dodeljena ni nobena tema, uporabil bom kar temo galerije

source: Show theme for:
sl_si: Pokaži temo za:

source: Current theme for <code><strong>%1$s</strong></code>: <em>%2$s</em>
sl_si: Izbrana tema za <code><strong>%1$s</strong></code>: <em>%2$s</em>

source: Clear theme assignment
hu_hu: Téma hozzárendelés törlése
sl_si: Prekliči dodeljenost teme

source: Themes allow you to visually change the entire look and feel of your gallery. Theme files are located in your Zenphoto <code>/themes</code> folder.
sl_si: S temami lahko spremenite izgled in način uporabe vaše galerije. Datoteke tem so shranjene v podmapi <code>/themes</code>.

source: You can download more themes from the <a href="http://www.zenphoto.org/zp/theme/">zenphoto themes page</a>.
sl_si: Več tem lahko dobite na <a href="http://www.zenphoto.org/zp/theme/">strani s temami za ZenPhoto</a>.

source: Place the downloaded themes in the <code>/themes</code> folder and they will be available for your use.
sl_si: Shranite teme, ki ste jih dobili z interneta, v mapo <code>/themes</code> in že jih boste lahko uporabili.

source: You can edit files from custom themes. Official themes shipped with Zenphoto are not editable, since your changes would be lost on next update.
sl_si: Popravljate lahko le datoteke tem, ki ste jih izdelali po meri. Uradnih tem ZenPhota ni moč popravljati, saj bi bile vse spremembe izgubljene ob naslednji posodobitvi.

source: If you want to customize an official theme, please first <em>duplicate</em> it. This will place a copy in your <code>/themes</code> folder for you to edit.
sl_si: Če želite popravljati uradno temo, prosim najprej <em>izdelajte dvojnika</em> te teme. Tako boste v mapo <code>/themes</code> dobili kopijo teme, ki jo pa lahko popravljate.

source: Installed themes
sl_si: Nameščene teme

source: Action
hu_hu: Művelet
sl_si: Opravila

source: Set this as your theme
hu_hu: Beállítás témaként.
sl_si: Uporabi to temo

source: Activate
sl_si: Aktiviraj

source: Assign this as your album theme
hu_hu: téma hozzárendelése az albumhoz
sl_si: Nastavi to temo za vaš album

source: Assign
sl_si: Uporabi

source: Current Theme
hu_hu: Jelenlegi téma
sl_si: To je izbrana tema

source: Edit this theme
sl_si: Uredi to temo

source: Duplicate
sl_si: Izdelaj dvojnika

source: Custom thumbnail cropping
sl_si: Izrez sličic po meri

source: You can change the portion of your image which is shown in thumbnails by cropping it here.
sl_si: Določite lahko izrez slike, ki bo služil za sličico.

source: current thumbnail
sl_si: zdajšnja sličica

source: Reset to the default cropping
sl_si: Nastavi na običajen izrez

source: Save the cropping
sl_si: Shrani izrez

source: Thumbnail cropping is disabled. Enable this option for the theme if you wish cropped thumbnails.
sl_si: Izdelava sličic z izrezovanjem je onemogočena. Omogočite jo lahko v možnostih teme.

source: thumbnail preview
sl_si: nova sličica

source: The album couldn't be created in the 'albums' folder. This is usually a permissions problem. Try setting the permissions on the albums and cache folders to be world-writable using a shell:
hu_hu: Az albumot nem tudtam létrehozni az 'albums' mappában. Ezt általában hozzáférési problémák okozzák. Próbáld írhatóvá tenni az 'albums' és a 'cache' mappákat a következő szkript segítségével:
sl_si: Nisem mogel ustvariti albuma v mapi 'albums'. Običajno je to posledica težav z dovoljenji. Poskusite nastaviti dovoljenja map albums in cache tako, da lahko vanje pišejo vsi, z ukazom:

source: or use your FTP program to give everyone write permissions to those folders.
hu_hu: vagy használj FTP alkalmazást ezen mappák írhatóvá tételéhez.
sl_si: ali uporabite vaš program za FTP in dajte vsem dovoljenje za pisanje v omenjeni mapi.

source: You must upload at least one file.
hu_hu: Legalább egy fájlt fel kell tőltened.
sl_si: Naložiti morate vsaj eno datoteko.

source: You must enter a folder name for your new album.
hu_hu: Meg kell adnod az új albumod mappájának nevét.
sl_si: Vnesti morate ime mape za svoj novi album.

source: You've most likely exceeded the upload limits. Try uploading fewer files at a time, or use a ZIP file.
hu_hu: Valószínűleg túllépted a feltöltési kolátozásokat. Próbálj egyszerre kevesebb fájlt feltölteni, vagy használj egy Zip fájlt.
sl_si: Najverjetneje ste presegli dovoljeno količino za prenos. Poskusite prenesti manj datotek naenkrat ali pa jih stisnite v paket zip.

source: There was an error submitting the form. Please try again. If this keeps happening, check your server and PHP configuration (make sure file uploads are enabled, and upload_max_filesize is set high enough)
hu_hu: Hiba az űrlap elküldésekor. Kérlek próbáld újra. Ha továbra sem sikerül, ellenőrizd a szerver és a PHP beállításokat (bizonyosodj meg a feltöltések engedélyezéséről, és a upload_max_filesize paraméter értékéről)
sl_si: Napaka pri pošiljanju obrazca. Prosim, poskusite znova. Če se napaka ponavlja, preverite nastavitve strežnika in PHP (prepričajte se, da je nalaganje datotek omogočeno in da je opcija upload_max_filesize nastavljena dovolj visoko)

source: If you think this is a bug, file a bug report. Thanks!
hu_hu: Ha úgy gondolod, hogy ez programhiba, értesítsd a fejlesztőket. Köszi!
sl_si: Če mislite, da je to hrošč, oddajte prijavo hrošča. Hvala!

source: Upload Photos
hu_hu: Képek feltöltése
sl_si: Nalaganje slik

source: This web-based upload accepts ZenPhoto formats: %s, %s, and %s.
sl_si: Naložite lahko naslednje formate slik: %s, %s in %s.

source: You can also upload a <strong>ZIP</strong> archive containing any of those file types.
hu_hu: E formátumok <strong>ZIP</strong> archívumba tömörítve szintén feltölthetőek.
sl_si: Naložite lahko tudi paket <strong>ZIP</strong>, ki vsebuje katere koli od teh tipov.

source: The maximum size for any one file is <strong>%sB</strong>.
sl_si: Največja dovoljena velikost posamezne datoteke je <strong>%sB</strong>.

source: Don't forget, you can also use <acronym title="File Transfer Protocol">FTP</acronym> to upload folders of images into the albums directory!
sl_si: Ne pozabite, uporabite lahko tudi <acronym title="File Transfer Protocol">FTP</acronym> za nalaganje map in slik v mapo albums!

source: Something went wrong...
hu_hu: Valami nem jött össze...
sl_si: Nekaj je šlo narobe...

source: There was an error submitting the form. Please try again.
hu_hu: Hiba történt az űrlap elküldésekor. Kérlek próbáld újra.
sl_si: Prišlo je do napake pri pošiljanju obrazca. Prosim, poskusite znova.

source: PHP Safe Mode Restrictions in effect!
hu_hu: PHP Safe Mode korlátozások érvényben vannak!
sl_si: Vklopljen je PHP Safe Mode!

source: Zenphoto may be unable to perform uploads when PHP Safe Mode restrictions are in effect
hu_hu: Amennyiben érvényben vannak a PHP Safe Mode korlátozásai, a Zenphoto képtelen lehet a feltöltésre.
sl_si: Zenphoto morda ne bo mogel izvesti nalaganja, če je PHP Safe Mode vklopljen

source: That name is already used.
hu_hu: Ez a név már használatban van.
sl_si: To ime je že v uporabi.

source: This upload has to have a folder. Type a title or folder name to continue...
hu_hu: A feltöltésnek szüksége van egy mappára. Írd be a címet vagy a mappa nevét a folytatáshoz...
sl_si: To, kar nalagate, mora iti v neko mapo. Vtipkajte naslov albuma oz. ime obstoječe mape...

source: Upload to:
hu_hu: Feltöltés ide:
sl_si: Naloži v:

source: Make a new Album
hu_hu: Csinálj új Albumot
sl_si: Izdelaj nov album

source: and
hu_hu: és
sl_si: in

source: Publish the album so everyone can see it.
hu_hu: az album közzététele, hogy mindenki láthassa.
sl_si: Objavi album, da bo viden vsem.

source: called:
hu_hu: Album neve:
sl_si: Naslov albuma:

source: with the folder name:
hu_hu: mappa neve
sl_si: Ime mape:

source: Auto-generate
hu_hu: Generáld ki automatikusan
sl_si: Samodejno ime

source: Add more upload boxes
hu_hu: Mégtöbb feltöltési mező hozzáadása
sl_si: Dodajte še več datotek

source: (won't reload the page, but remember your upload limits!)
hu_hu: (nem frissíti az oldalt, de emlékezz a feltöltési korlátozásaidra!)
sl_si: (stran se ne bo ponovno naložila, a bodite pozorni, da ne boste presegli omejitev za nalaganje!)

source: Cache cleared.
sl_si: Predpomnilnik je spraznjen.

source: Hitcounters reset
sl_si: Števci dostopa so izničeni

source: Could not connect to <a href="http://www.zenphoto.org">zenphoto.org</a>
sl_si: Nisem se mogel povezati z <a href="http://www.zenphoto.org">zenphoto.org</a>

source: zenphoto version %s is available.
sl_si: Na voljo je Zenphoto <em>%s</em>.

source: You are running the latest zenphoto version.
hu_hu: A legfrissebb zenphoto verziót használod.
sl_si: To je zadnja različica Zenphota.

source: Gallery Stats
hu_hu: A Galéria statisztikái:
sl_si: Statistika galerije

source: <strong>%1$u</strong> Image (%2$u not visible)
sl_si: <strong>%1$u</strong> slika (%2$u nevidna)

source: Installation information
sl_si: Informacije o namestitvi

source: Official Build
sl_si: Uradno sestavljeno

source: Zenphoto version <strong>%1$s [%2$s] (%3$s)</strong>
sl_si: Zenphoto različica <strong>%1$s [%2$s] (%3$s)</strong>

source: Current gallery theme: <strong>%1$s</strong>
sl_si: Tema galerije: <strong>%1$s</strong>

source: PHP version: <strong>%1$s</strong>
sl_si: PHP različica: <strong>%1$s</strong>

source: PHP memory limit: <strong>%1$s</strong> (Note: Your server might allocate less!)
sl_si: Omejitev pomnilnika v PHP: <strong>%1$s</strong> (Opomba: Strežnik lahko dodeli tudi manj!)

source: MySQL version: <strong>%1$s</strong>
sl_si: MySQL različica: <strong>%1$s</strong>

source: Database name: <strong>%1$s</strong>
sl_si: Ime podatkovne zbirke: <strong>%1$s</strong>

source: Table prefix: <strong>%1$s</strong>
sl_si: Predpona tabel: <strong>%1$s</strong>

source: Spam filter: <strong>%s</strong>
sl_si: Filter neželene vsebine (spam): <strong>%s</strong>

source: Captcha generator: <strong>%s</strong>
sl_si: Generator Captcha: <strong>%s</strong>

source: Active plugins:
sl_si: Aktivni vtičniki:

source: <em>none</em>
sl_si: <em>ni</em>

source: Active filters:
sl_si: Aktivni filtri:

source: Check for zenphoto update
sl_si: Ali obstaja nova različica Zenphota?

source: Queries the Zenphoto web site for the latest version and compares that with the one that is running.
sl_si: Poveže se s spletno stranjo Zenphota in preveri, ali obstaja nova različica programa.

source: Refresh the Database
hu_hu: Adatbázis frissítése
sl_si: Osveži podatkovno zbirko

source: Cleans the database and removes any orphan entries for comments, images, and albums.
hu_hu: Áttisztítja az adatbázist és eltávolítja a felesleges hozzászólás, kép és album bejegyzéseket.
sl_si: Pregleda podatkovno zbirko in odstrani vse osirotele zapise za komentarje, slike in albume.

source: Purge cache
sl_si: Počisti predpomnilnik

source: Clears the image cache. Images will be re-cached as they are viewed.
sl_si: Izprazni predpomnilinik za slike. Predpomnilnik se bo napolnil sproti, ko bodo uporabniki ogledovali slike.

source: Finds newly uploaded images that have not been cached and creates the cached version. It also refreshes the numbers above. If you have a large number of images in your gallery you might consider using the <em>pre-cache image</em> link for each album to avoid swamping your browser.
hu_hu: Megkeresi azokat az újonnan feltöltött képeket, amelyek még nincsenek a gyorsítótárban és gyorsítótárazza azokat. A galéria statisztikáit szintén frissíti. Amennyiben túl sok kép van a gyűjteményben, ajánlatos az <em>Képek elő-gyorsítótárazása</em> gombot az egyes al-albumokban használni, hogy ne legyen a böngésző ill. a szerver túlterhelve.
sl_si: Postavi vse slike v predpomnilik, če še niso tam. Obenem tudi osveži statistiko števila slik. Če imate veliko slik v galeriji, je bolje, da predpomnilnik napolnete za vsak album posebej, da ne preobremenite strežnika.

source: Forces a refresh of the EXIF and IPTC data for all images.
hu_hu: Kikényszeríti az összes kép EXIF és IPTC adat frissítését.
sl_si: Osveži podatke EXIF in PTC za vse slike.

source: Sets all album and image hitcounters to zero.
hu_hu: Az összes album és kép számlálójának nullázása.
sl_si: Vse števce ogledov postavi na nič.

source: Utility functions
sl_si: Razna orodja

source: 10 Most Recent Comments
hu_hu: 10 legújabb hozzászólás
sl_si: 10 najnovejših komentarjev

source: <em>%1$s</em> commented on %2$s:
sl_si: <em>%1$s</em> za sliko %2$s pravi:

source: Could not create zip file.
hu_hu: Nem lehet Zip fájlt létrehozni.
sl_si: Ne morem izdelati datoteke zip.

source: Could not create tar file.
hu_hu: Nem lehet Tar fájlt létrehozni.
sl_si: Ne morem izdelati datoteke tar.

source: Could not create bzip2 file.
hu_hu: Nem lehet Bzip2 fájlt létrehozni.
sl_si: Ne morem izdelati datoteke bzip2.

source: Could not create gzip file.
hu_hu: Nem lehet Gzip fájlt létrehozni.
sl_si: Ne morem izdelati datoteke gzip.

source: Could not add %s to archive because the filename is too long.
sl_si: Nisem mogel dodati %s v paket, ker je ime datoteke predolgo.

source: Could not open file %s for reading. It was not added.
sl_si: Nisem mogel odpreti in prebrati datoteke %s. Ni bila dodana.

source: This script does not support extracting this type of tar file.
hu_hu: Ez a szkript nem támogatja a kicsomagolást ilyen típusú tar fájlból.
sl_si: Ne znam razširiti tega tipa datotek tar.

source: Could not extract from %s it is corrupt.
sl_si: Ne morem razširiti iz %s, ker je paket poškodovan.

source: %s already exists.
sl_si: %s že obstaja.

source: Could not open %s for writing.
sl_si: Ne morem pisati v datoteko %s.

source: Could not open sfx module from %s
sl_si: Ne morem odpreti modula sfx iz %s

source: You are receiving this e-mail because of a password reset request on your Zenphoto gallery.
sl_si: To sporočilo ste prejeli, ker je nekdo sprožil postopek za novo geslo v vaši galeriji Zenphoto.

source: You are receiving this e-mail because of a password reset request on your Zenphoto gallery from a user who tried to log in as %s.
sl_si: To sporočilo ste prejeli, ker je uporabnik %s sprožil postopek za novo geslo v vaši galeriji Zenphoto.

source: To reset your Zenphoto Admin passwords visit: %s
sl_si: Če želite novo geslo, obiščite: %s

source: If you do not wish to reset your passwords just ignore this message. This ticket will automatically expire in 3 days.
hu_hu: Ha nem szeretnél új jelszót, hagyd figyelmen kívül ezt az üzenetet. A kérvény automatikusan érvényét veszti 3 nap múlva
sl_si: Če ne želite ponovno nastaviti vašega gesla, enostavno prezrite to sporočilo. Zahtevek bo zastarel v 3 dneh.

source: The Zenphoto information you requested
hu_hu: A kért Zenphoto információk
sl_si: Informacije o Zenphoto, ki ste jih zahtevali

source: Error: The album %s cannot be found.
sl_si: Napaka: ne najdem albuma %s.

source: Error: The album %s is not readable.
sl_si: Napaka: Ne morem prebrati albuma %s.

source: Error: The 'albums' directory (%s) cannot be found.
sl_si: Napaka: Ne najdem mape z albumi (%s).

source: Error: The 'albums' directory (%s) is not readable.
sl_si: Napaka: Ne morem prebrati mape z albumi (%s).

source: File/Folder name
hu_hu: Fájl/Mappa neve
sl_si: Ime datoteke ali mape

source: Location
hu_hu: Helyszín
sl_si: Lokacija

source: City
hu_hu: Város
sl_si: Mesto

source: State
hu_hu: Állam
sl_si: Pokrajina

source: Country
hu_hu: Ország
sl_si: Država

source: Camera Maker
hu_hu: Gyártó
sl_si: Proizvajalec aparata

source: Camera Model
hu_hu: Modell
sl_si: Model aparata

source: Shutter Speed
hu_hu: Záridő
sl_si: Hitrost zaklopke

source: Aperture
hu_hu: Rekesz
sl_si: Zaslonka

source: Focal Length
hu_hu: Fókusztávolság
sl_si: Goriščna razdalja

source: ISO Sensitivity
hu_hu: ISO érzékenység
sl_si: Občutljivost ISO

source: Exposure Compensation
hu_hu: Expozíciós kiegyenlítés
sl_si: Kompenzacija osvetlitve

source: Metering Mode
hu_hu: Mérési mód
sl_si: Način merjenja

source: Flash Fired
hu_hu: Vaku használva
sl_si: Uporaba bliskavice

source: Contrast Setting
hu_hu: Kontraszt
sl_si: Kontrast

source: Sharpness Setting
hu_hu: Élesség
sl_si: Ostrina

source: Saturation Setting
hu_hu: Színbőség
sl_si: Nasičenost

source: White Balance
sl_si: Belina

source: Forbidden
sl_si: Prepovedano

source: Method Not Allowed
sl_si: Metoda ni dovoljena
