Repository: dirkhusemann/zenphoto
Catalog: zp-core/locale/*/LC_MESSAGES/zenphoto.po
Languages: hu_hu, sl_si

source: Adds a theme function to call a slideshow either based on jQuery (default) or Flash using Flowplayer if installed. Additionally the files <em>slideshow.php</em>, <em>slideshow.css</em> and <em>slideshow-controls.png</em> need to be present in the theme folder.
hu_hu: Diavetítést tesz lehetővéi a téma részére jQuery (alapértelmezett) vagy Flash (ha a flowplayer telepítve van) segítségével. A következő fájloknak jelen kell lenniük a téma mappájában: <em>slideshow.php</em>, <em>slideshow.css</em> és <em>slideshow-controls.png</em>

source: Size of the images in the slideshow. <em>[jQuery mode option]</em><br />If empty the theme options <em>image size</em> is used.
hu_hu: A diavetítés képeinek mérete. <em>[jQuery mode option]</em><br /> Ha nincs megadva, a téma beállítás <em>képméret</em>e lesz hasnálva.

source: <em>jQuery</em> for JS ajax slideshow, <em>flash</em> for flash based slideshow (requires Flowplayer.)
hu_hu: <em>jQuery</em> JS ajax diavetítéshez, <em>flash</em> a flash alapú diavetítéshez (Flowplayer szükséges hozzá).

source: The cycle slide effect to be used. <em>[jQuery mode option]</em>
hu_hu: A használni kívánt képátmenet efektus. <em>[jQuery módban]</em>

source: Milliseconds between slide transitions (0 to disable auto advance.) <em>[jQuery mode option]</em>
hu_hu: A képátmenetek közötti idő, ezredmásodpercekben. (állítsd 0-ára, ha le akarod tiltani az automatikus lejátszást.) <em>[jQuery módban]</em>

source: Check if you want to show the image's description below the slideshow <em>[jQuery mode option]</em>.
hu_hu: Aktiváld, ha szeretnéd megjeleníteni a leírást a diavetítő alatt <em>[jQuery mód opció]</em>.

source: Width of the Flowplayer display for the slideshow <em>(Flash mode)</em>.
hu_hu: Flowplayer kijelzőjének szélessége <em>(Flash mód)</em>.

source: Height of the Flowplayer display for the slideshow <em>(Flash mode)</em>.
hu_hu: Flowplayer kijelzőjének magassága <em>(Flash mód)</em>.

source: Stop and return to album or image page
hu_hu: Megállít és visszatér az album vagy a kép oldalára

source: Pause (to stop the slideshow without returning)
hu_hu: Szünet (megállítja a lejátszást, visszatérés nélkül)

source: Click on
hu_hu: Kattints a

source: on the right in the player control bar to view full size
hu_hu: a vezérlősáv jobb oldalán a teljes képernyő

source: Provides a means for placing a user logout link on your theme pages.
hu_hu: Egy kijelentkező hivatkozás elhelyezését teszi lehetővé a téma oldalain.

source: Adds several theme functions to enable images and/or album rating by users.
hu_hu: Különböző témafunkciók, amelyek lehetővé teszik a képek és az albumok osztályzását.

source: Enable <strong>dynamic-locale</strong> to allow viewers of your site to select the language translation of their choice.
hu_hu: Engedélyezd a <strong>dynamic-locale</strong>-t, hogy vendégeid a nekik megfelelő nyelvet választhassák.

source: Akismet key
hu_hu: Akismet kulcs

source: Proper operation requires an Akismet key obtained by signing up for a <a href="http://www.wordpress.com">Wordpress.com</a> account.
hu_hu: A megfelelő működéshez szükséged van egy Akismet kulcshoz, amelyhez a <a href="http://www.wordpress.com">Wordpress.com</a> oldalon létrehozott fiókoddal juthatsz hozzá.

source: Forgiving
hu_hu: Engedékeny

source: Mark suspected SPAM for moderation rather than as SPAM
hu_hu: A gyanús hozzászólásokat felülvizsgálatra küldi SPAM bélyegzés helyett

source: Words to die on
hu_hu: Tiltott szavak:

source: SPAM blacklist words (separate with commas)
hu_hu: SPAM feketelistás szavak (szóközökkel elválasztva)

source: Patterns to die on
hu_hu: Tiltott kifejezések:

source: SPAM blacklist <a href="http://en.wikipedia.org/wiki/Regular_expression">regular expressions</a> (separate with spaces)
hu_hu: SPAM feketelista <a href="http://en.wikipedia.org/wiki/Regular_expression">szabályos kifelyezések</a> (szóközzel elválasztva)

source: Excessive URL count
hu_hu: Túlzott URL számlálás

source: Message is considered SPAM if there are more than this many URLs in it
hu_hu: Ha ennél több URL van a hozzászólásban SPAM-nek minősül

source: This action will be taken for all messages.
hu_hu: Ez a beállítás az összes üzenetre érvényes lesz.

source: SpamAssassin host
hu_hu: SpamAssassin szerver

source: SpamAssassin server
hu_hu: SpamAssassin szerver

source: SpamAssassin ctype
hu_hu: SpamAssassin csatlakozás

source: Connection type
hu_hu: Csatlakozás típusa

source: TCP port of SpamAssassin
hu_hu: SpamAssassin TCP portja

source: Socket of SpamAssassin
hu_hu: SpamAssassin szoketje

source: SpamAssassin user
hu_hu: SpamAssassin felhasználó

source: User to use on SpamAssassin box
hu_hu: Az a felhasználó, aki használni fogja a SpamAssassin dobozt

source: Powered by
hu_hu: Az oldal motorja:

source: comments on this image:
hu_hu: hozzászólások a képhez:

source: Seconds
hu_hu: Másodperc

source: comments on this album:
hu_hu: hozzászólások az albumhoz:

source: Check and the theme will use the flv_playlist plugin in place of the next_image loop.
hu_hu: Aktiváld, hogy a téma az flv_playlist bővítményt használja a következő kép .....

source: albums(s)
hu_hu: Albumok

source: images(s)
hu_hu: Képek

source: (not found)
hu_hu: (nincs találat)

source: View the album:
hu_hu: Album megnyitása:

source: on this image
hu_hu: ezen a képen

source: View the Album:
hu_hu: Album megnyitása:

source: Photo
hu_hu: Kép

source: on this album
hu_hu: az albumon

source: Hits
hu_hu: Kattintások

source: Hit
hu_hu: Kattintás

source: Sorry, no matches for <em>
hu_hu: Bocsi, nincs találat erre: <em>

source: </em>. Try refining your search.
hu_hu: </em>. Próbálj mást keresni.

source: with modifications by
hu_hu: váloztatásaival

source: Watermark head_image
hu_hu: Vízjel head_image

source: photos
hu_hu: fotók

source: photo
hu_hu: fotó

source: Photo Templates</a> from
hu_hu: Fotó sablonok</a> innen:

source: comments so far
hu_hu: hozzászólás összesen

source: Link to Comment
hu_hu: Link a megjegyzéshez...

source: wrote:
hu_hu: írta:

source: Random Images
hu_hu: Véletlenszerű képek

source: Most Rated Images
hu_hu: Legtöbbször osztályozott képek

source: Top Rated Images
hu_hu: Jegjobb osztályzatú képek

source: images in
hu_hu: kép,

source: Categories
hu_hu: Kategóriában

source: Latest Images
hu_hu: Legújabb képek

source: Click on image to download.
hu_hu: A letöltéshez kattints a képen.

source: (Full size:
hu_hu: (Teljes méret:

source: Most Popular Images In This Album
hu_hu: A legnépszerűbb képek az albumban

source: Latest Images In This Album
hu_hu: A legújabb képek az albumban

source: images in this album
hu_hu: kép az albumban,

source: Subalbums
hu_hu: alkategória

source: Wallpapers:
hu_hu: Háttérkép:

source: Subalbums:
hu_hu: Alkategória:

source: Top Rated Images In This Album
hu_hu: A legjobb osztályzot kapott képek az albumban

source: Edit the <code>zp-config.php.example</code> file and rename it to <code>zp-config.php</code>
hu_hu: Szerkeszd a <code>zp-config.php.example</code> fájlt, és nevezd át <code>zp-config.php</code>-ra

source: Your MySQL user must have <code>Create</code>, <code>Drop</code>, <code>Select</code>, <code>Insert</code>, <code>Alter</code>, <code>Update</code>, and <code>Delete</code> rights.
hu_hu: A MySQL felhasználónak rendelkeznie kell az következő jogokkal: <code>Create</code>, <code>Drop</code>, <code>Select</code>, <code>Insert</code>, <code>Alter</code>, <code>Update</code>, és <code>Delete</code>.

source: DEBUG
hu_hu: Nyomkövetés

source: Setting this option places thumbnails in the album thumbnail selection list. This does not work on all browsers (Internet Explorer does not show the images) and may slow down loading the edit page if you have a lot images.
hu_hu: Ezen opció engedélyezésével láthatóak lesznek a miniatűrök a miniatűr választó listán. Nem mindegyik böngésző támogatja ezt a funkciót (az Internet Explorer nem mutatja a képeket) és a képek betöltése lassíthatja a szerkesztő oldalt, ha sok képed van.

source: Click the plugin bar to open/close the options.
hu_hu: Kattints a bővítmény sávján az opciók megnyitásához vagy elrejtéséhez.

source: reset_hitcounter
hu_hu: A számláló nullázása.

source: save images
hu_hu: képek mentése

source: Filename:
hu_hu: Fájlnév:

source: Zenphoto Error:</strong> the requested object was not found. Please go back and try again.
hu_hu: Zenphoto Hiba:</strong> a keresett oldal nem található. Kérlek lépj vissza és próbáld újra.

source: Aperature Priority
hu_hu: Rekesz prioritás:

source: Allow_comments
hu_hu: Hozzászólások engedélyezése

source: Allow_search
hu_hu: Keresés engedélyezése

source: Theme_colors
hu_hu: Téma szénei
