Repository: dirkhusemann/zenphoto
Catalog: zp-core/locale/*/LC_MESSAGES/zenphoto.po
Languages: hu_hu, sl_si

source: Substitute a <em>lock</em> image for thumbnails of password protected albums when the viewer has not supplied the password. If your theme supplies an <code>images/err-passwordprotected.gif</code> image, it will be shown. Otherwise the zenphoto default lock image is displayed.
hu_hu: Egy <em>lakat</em>-ot ábrázoló képpel helyettesíti be a miniatűt képét, amennyiben az album jelszó védett és a látogató nem adta meg a jelszót. Ha a témád tartalmaz egy <code>images/err-passwordprotected.gif</code> képet, akkor az lesz használva, ha nem akkor az alapértelnezett lakatkép.

source: Comments options
hu_hu: Hozzászólások beállításai

source: Tags and attributes allowed in comments
hu_hu: Megengedett HTML tag-ek és attribútumok a hozzászólásokban

source: Captcha
hu_hu: Biztonsági kód

source: Theme for
hu_hu: Téma ehhez:

source: If checked the thumbnail will be a centered portion of the image with the given width and height after being resized to <em>thumb size</em> (by shortest side).
hu_hu: Ha aktiválva van, a miniatűr a kép középsrő részéből lesz létrehozva, az átméretezés utáni <em>miniatűr mérete</em> alapján (a rövdebbik oldal a mérvadó).

source: Otherwise, it will be the full image resized to <em>thumb size</em> (by shortest side).
hu_hu: Egyébként az eredeti kép lesz átméretezve a <em>miniatűr mérete</em> alapján (a rövdebbik oldal a mérvadó).

source: Crop thumbnail width:
hu_hu: Miniatűr vágása erre a szélességre:

source: The <em>thumb crop width</em> is the maximum width when height is the shortest side
hu_hu: A <em>Miniatűr vágása erre a szélességre:</em> a legnagyobb szélesség, ha a magasság a rövidebbik oldal.

source: Crop thumbnail height:
hu_hu: Miniatűr vágása erre a magasságra:

source: The <em>thumb crop height</em> is the maximum height when width is the shortest side
hu_hu: A <em>Miniatűr vágása erre a magasságra:</em> a legnagyobb magasság, ha a szélesség a rövidebbik oldal.

source: Default image display width.
hu_hu: Alapértelmezett képszélesség.

source: Images size is longest size:
hu_hu: A kép mérete a hosszabbik méret:

source: If this is checked the longest side of the image will be <em>image size</em>.
hu_hu: Ha aktiválva van, a hosszabbik oldal lesz a <em>kép mérete</em>.

source: Otherwise, the <em>width</em> of the image will be <em>image size</em>.
hu_hu: Egyébként a kép <em>szélesség</em>-e lesz aa <em>kép mérete</em>.

source: Plugin Options
hu_hu: Bővítmény beállítások

source: Clearing and
hu_hu: Tisztítás és

source: Refreshing cache for
hu_hu: Gyorsítótár frissítése itt:

source: Refreshing cache for Gallery
hu_hu: Galéria gyorsítótárának frissítése

source: Finished: Total of
hu_hu: Befejeztem. Összesen:

source: There was an error logging in.</h2> Check your username and password and try again.
hu_hu: Nem sikerült a bejelentkezés.</h2> Ellenőrizd a fehasználói nevet és a jelszavat, majd próbáld újra.

source: *Enter
hu_hu: *Írd be

source: to email a password reset.
hu_hu: az új jelszó elküldéséhez e-mailben

source: Logged in as
hu_hu: Bejelentkezve mint:

source: failed to delete.
hu_hu: nem sikerült törölni.

source: deleted successfully.
hu_hu: sikeresen törölve.

source: new tag
hu_hu: új címke

source: Hit counter:
hu_hu: Számláló:

source: Tags:
hu_hu: Címkék:

source: save album
hu_hu: album mentése

source: Clear
hu_hu: Törlés

source: Edit this album:
hu_hu: Album szerkesztése:

source: Protected
hu_hu: Védett

source: Publish the album
hu_hu: Album publikálása

source: Pre-cache images in
hu_hu: Képek elő-gyorsítótárazása itt:

source: Cache the album
hu_hu: Album gyorsítótárazása

source: Refresh metadata for the album
hu_hu: Meta-adatok frissítése az albumban

source: Refresh image metadata in the album
hu_hu: Képek meta-adatjainak frissítése az albumban

source: Reset hitcounters for album
hu_hu: Album számlálójának nullázása

source: Reset hitcounters for the album
hu_hu: Az album számlálójának nullázása

source: page
hu_hu: lap

source: Invalid variable type '
hu_hu: érvénytelen változó '

source: ' for p_filelist
hu_hu: ' p_filelist

source: Unable to open archive
hu_hu: Nem lehet megnyitni az archívumot

source: in binary read mode
hu_hu: bináris olvasási módban

source: Invalid optional parameter
hu_hu: Érvénytelen kiegészítő paraméter.

source: for this method
hu_hu: ehhez az eljáráshoz

source: Function
hu_hu: Funkció

source: is not an existing function for option
hu_hu: egy nem létező funkciója az opciónak

source: Invalid type
hu_hu: Érvénytelen típus

source: String expected for attribute
hu_hu: Attribútumként szóláncolatot vártam

source: Invalid empty full filename for attribute
hu_hu: Helytelen: a hosszú fájlnév üres

source: Integer expected for attribute
hu_hu: Az attribútumnak egész számnak kell lennie

source: Unable to open temporary file
hu_hu: Az ideiglenes fájlt nem lehet megnyitni

source: in binary write mode
hu_hu: bináris írás módban

source: Zip file
hu_hu: Zip fájl

source: already open
hu_hu: már meg van nyitva

source: in
hu_hu: itt:

source: mode
hu_hu: mód

source: does not exists
hu_hu: nem létezik

source: Unable to open file
hu_hu: Nem lehet megnyitni a fájlt

source: Unable to open archiv
hu_hu: Nem lehet megnyitni az archívumot

source: is
hu_hu: van

source: compressed by an unsupported compression
hu_hu: nem támogatott tömörítés

source: method
hu_hu: eljárás

source: Unsupported encryption for
hu_hu: Nem támogatott kódolás itt:

source: filename
hu_hu: fájlnév

source: outside
hu_hu: külső

source: already used by an existing directory
hu_hu: már használja egy létező mappa

source: exists
hu_hu: létezik

source: and is write protected
hu_hu: és írásvédett

source: Newer version of '
hu_hu: Újabb verziója ennek: '

source: and option
hu_hu: és opció

source: is not selected
hu_hu: nincs kiválaszva

source: Unable to open archive file
hu_hu: Az archívum fájlt nem lehet megnyitni

source: Zenphoto error:</strong> zp-config.php not found. Perhaps you need to run
hu_hu: Zenphoto hiba:</strong> zp-config.php fájl nem található. Talán futtathatnád a

source: (or migrate your old config.php)
hu_hu: (vagy helyezd át a régi config.php fájlodat)

source: ERROR: Assertion failed in
hu_hu: Hiba: Az állítás megbukott itt:

source: No comment specified.
hu_hu: Nem lett kiválasztva hozzászólás.

source: database error
hu_hu: adatbázis hiba

source: remove from moderation
hu_hu: Eltávolítás a moderációból

source: Drag the albums into the order you wish them displayed. Select an album to edit its description and data, or
hu_hu: Húzd az albumokat a kívánt sorrendbe. Válassz egy albumot a leírás vagy egyéb adatainak szerkesztéséhez, vagy

source: save changes
hu_hu: változtatások mentése

source: Click the images for a larger version
hu_hu: Kattints a képen a nagyobb méret megtekintéséhez

source: zenphoto Administration
hu_hu: zenphoto Adminisztráció

source: Could not connect to
hu_hu: Nem lehet csatlakozni ehhez:

source: zenphoto version
hu_hu: zenphoto verzió

source: is available.
hu_hu: elérhető.

source: Check for zenphoto update.
hu_hu: Frissítések keresése.

source: Database was refreshed
hu_hu: Az adatbázis sikeresen frissítve lett.

source: Cache has been purged
hu_hu: A gyorsétótár törölve lett.

source: <strong>Upload</strong> pictures.
hu_hu: Képek <strong>feltöltése</strong>.

source: <strong>Edit</strong> titles, descriptions, and other metadata.
hu_hu: Címek, leírások és egyéb mataadatok <strong>szerkesztése</strong>.

source: Edit or delete <strong>comments</strong>.
hu_hu: <strong>Hozzászólások</strong> szerkesztése vagy törlése.

source: Browse your <strong>gallery</strong> and edit on the go.
hu_hu: <strong>Galéria</strong> tallózása és szerkesztése menet közben.

source: commented on
hu_hu: ehhez szólt hozzá:

source: Gallery Maintenance
hu_hu: Galéria karbantatása

source: Your database is
hu_hu: Az adatbázis neve

source: Tables are prefixed by
hu_hu: A táblázatok prefixje:

source: Clears the image cache. Images will be re-cached as they are viewed. To clear the cache and renew it, use the <em>Pre-Cache Images</em> button below.
hu_hu: Törli a képek gyorsítótárát. A képek megtekintéskor újra gyorsítótárazva lesznek. A gyorsítótár törléséhez és felújításához használd az alábbi <em>Képek elő-gyorsítótárazása</em> gombot.

source: Purge Cache
hu_hu: Gyorsítótár törlése

source: not visible
hu_hu: nem látható

source: albums
hu_hu: album

source: unpublished
hu_hu: nincs közzétéve

source: in moderation
hu_hu: moderáció alatt

source: Error: The 'albums' directory
hu_hu: Hiba: Az 'albumok' könyvtár

source: cannot be found.
hu_hu: nem található

source: is not readable.
hu_hu: nem olvasható

source: MySQL Error: The database is connected, but Zenphoto could not select the database "
hu_hu: MySQL hiba: Az adatbázis csatlakoztatva van, de a Zenphoto nem tudja kiválasztani az adatbázist "

source: MySQL Query
hu_hu: MySQL lekérdezés

source: You may need to
hu_hu: Szükséged lesz

source: run the setup script
hu_hu: lefuttatni a setup szkriptet

source: zenphoto Metadata refresh
hu_hu: zenphoto meta-adatainak frissítése.

source: not found
hu_hu: nem található

source: We're all set to refresh the
hu_hu: Készen állok a következő frissítésére:

source: back to the list
hu_hu: vissza a listához

source: Error: The album
hu_hu: Hiba: Az album

source: from a user who tried to log in as
hu_hu: egy felhasználótól, aki megpróbált bejelentkezni mint:

source: You are receiving this e-mail because of a password reset request on your Zenphoto gallery
hu_hu: Ezt az e-mailt azért kaptad, mert új jelszót igényeltek a Zenphoto galériádban

source: To reset your Zenphoto Admin passwords visit:
hu_hu: A zenphoto admin jelszó megváltoztatásához látogass el ide:

source: They may be provided as part of the Zenphoto distribution or as offereings from third parties.
hu_hu: Rendelkezésre állhatnak a zenphoto disztribúció részeiként, vagy beszerezhetőek harmadik féltől is.

source: Click to add a title...
hu_hu: Kattints ide új cím hozzáadásához...

source: Click to edit title...
hu_hu: Kattints ide a cím szerkesztéséhez...

source: Click to add tags...
hu_hu: Kattints ide új címke hozzáadásához...

source: Click to edit tags...
hu_hu: Kattints ide a címke szerkesztéséhez...

source: Click to add a description...
hu_hu: Kattints ide új leírás hozzáadásához...

source: Click to edit description
hu_hu: Kattints ide a leírás szerkesztéséhez...

source: cancel
hu_hu: mégsem

source: Currently editing something else, save or cancel to edit this.
hu_hu: Momentán valami mást is szerkesztesz. Mentsd el, vagy vesd el a változásokat, hogy itt is szerkeszthess.

source: Centimeter
hu_hu: Centiméter

source: Program Creative
hu_hu: Kreatív program

source: Program Action
hu_hu: Akció program

source: Average
hu_hu: Átlagos

source: Partial
hu_hu: Rśzleges

source: Daylight
hu_hu: Napfény

source: Flourescent
hu_hu: Fluoreszkáló

source: Tungsten
hu_hu: Wolfram

source: Flash, strobe return light not detected
hu_hu: Vaku, visszavert fény nem észlelve

source: Flash, strob return light detected
hu_hu: Vaku, visszavert fény észlelve

source: Compulsory Flash, Return light not detected
hu_hu: Kényszerített vaku, visszavert fény nem észlelve

source: Compulsory Flash, Return light detected
hu_hu: Kényszerített vaku, visszavert fény észlelve

source: Flash, Auto-Mode, Return light not detected
hu_hu: Vaku, automatikus mód, visszavert fény nem észlelve

source: Flash, Auto-Mode, Return light detected
hu_hu: Vaku, automatikus mód, visszavert fény észlelve

source: Red Eye, Return light not detected
hu_hu: Vörösszem, visszavert fény nem észlelve

source: Red Eye, Return light detected
hu_hu: Vörösszem, visszavert fény észlelve

source: Red Eye, Compulsory Flash, Return light not detected
hu_hu: Vörösszem, kényszerített vaku, visszavert fény nem észlelve

source: Red Eye, Compulsory Flash, Return light detected
hu_hu: Vörösszem, kényszerített vaku, visszavert fény észlelve

source: Red Eye, Auto-Mode, Return light not detected
hu_hu: Vörösszem, automatikus mód, visszavert fény nem észlelve

source: Red Eye, Auto-Mode, Return light detected
hu_hu: Vörösszem, automatikus mód, visszavert fény észlelve

source: Uncalibrated
hu_hu: Nem kalibrált

source: pixels
hu_hu: pixelek

source: Trilinear Sensor
hu_hu: Trilineáris szenzor

source: Monochrome
hu_hu: Monokróm

source: Digital Still Camera
hu_hu: Digitális állókamera

source: Directly Photographed
hu_hu: Közvetlen fényképezve

source: Normal
hu_hu: Normális

source: Incandescense
hu_hu: Sugárzó

source: Flourescence
hu_hu: Fluoreszkálás

source: SpeedLight
hu_hu: Gyors fény

source: Fisheye
hu_hu: Halszem

source: AF non D
hu_hu: AF nem D

source: Very High
hu_hu: Nagyon magas

source: Halogen
hu_hu: Halogén

source: Portrait
hu_hu: Portré

source: Scenery
hu_hu: Tájkép

source: Night Portrait
hu_hu: Éjszakai portré

source: Panning
hu_hu: Panoráma

source: Fireworks
hu_hu: Tüzijáték

source: Party
hu_hu: Buli

source: Snow
hu_hu: Hó

source: Night Scenery
hu_hu: Éjszakai tájkép

source: Food
hu_hu: Étel

source: Baby
hu_hu: Kisbaba

source: Underwater
hu_hu: Vízalatti

source: Pet
hu_hu: Háziállat

source: Yes
hu_hu: Igen

source: Warm
hu_hu: Meleg

source: Cool
hu_hu: Hideg

source: Infinite
hu_hu: Végtelen

source: 10s
hu_hu: 10 mp

source: 2s
hu_hu: 2 mp

source: /10s
hu_hu: /10 mp

source: Superfine
hu_hu: Szuper finom

source: Single/Timer
hu_hu: Egyszerű/Időzített

source: AI Servo
hu_hu: AI szervó

source: Evaluative
hu_hu: Kiértékelő

source: Locked (Pan Mode)
hu_hu: Lezárt (panoráma mód)

source: EasyShoot
hu_hu: Könnyű felvétel

source: 2nd(rear)-curtain sync used
hu_hu: 2. (hátsó) függöny szinkronizációval

source: 1st curtain sync
hu_hu: 1. függöny szinkronizáció

source: Sunny
hu_hu: Napos

source: Fluorescent
hu_hu: Fluoreszkáló

source: Soft
hu_hu: Lágy

source: Hard
hu_hu: Erős

source: DaywhiteColor-fluorescence
hu_hu: Nappali fehér szín, fluoreszkáló

source: Incandenscense
hu_hu: Sugárzó

source: Chroma Saturation Normal(STD)
hu_hu: Normális króma szaturáció (ORG)

source: Chroma Saturation High
hu_hu: Magas króma szaturáció

source: Chroma Saturation Low(ORG)
hu_hu: Alacson króma szaturáció (ORG)

source: Contrast Normal(STD)
hu_hu: Normális kontraszt (STD)

source: Contrast High(HARD)
hu_hu: Magas kontraszt (HARD)

source: Contrast Low(ORG)
hu_hu: Alacsony kontraszt (ORG)

source: Program AE
hu_hu: AE program

source: Aperture Prority AE
hu_hu: Rekesz prioritás AE

source: Shutter Prority
hu_hu: Záridő prioritás:

source: AE Good
hu_hu: AE jó

source: GoogleCheckout Integration for Zenphoto.
hu_hu: GoogleCheckout integráció Zenphoto részére.

source: Matte
hu_hu: Matt

source: Glossy
hu_hu: Fényes

source: Paper
hu_hu: Papír

source: Google Merchant ID
hu_hu: Google kereskedelmi ID

source: Your Google Merchant ID.
hu_hu: A Google kereskedelmi ID-d

source: Currency
hu_hu: Pénznem

source: The currency for your transactions.
hu_hu: Pénznem a tranzakciódhoz.

source: Shipping method
hu_hu: Vásárlási eljárás

source: How to ship.
hu_hu: Hogyan lehet vásárolni.

source: Shipping cost
hu_hu: Vásárlási ár

source: What you charge for shipping.
hu_hu: Vásárlási költség

source: Price list
hu_hu: Árlista

source: Your pricelist by size and media. The format of this option is <em>price elements</em> separated by spaces.<br/>A <em>price element</em> has the form: <em>size</em>:<em>media</em>=<em>price</em><br/>example: <code>4x6:Matte=5.75 8x10:Glossy=20.00 11x14:Paper=15.35</code>.
hu_hu: Az árlistád méret és médium szerint. Az opció formátuma: <em>ár elem</em> szóközzel elválasztva. <br/>Az <em>ár elem</em> formátuma: <em>méret</em>:<em>médium</em>=<em>ár</em><br/>például: <code>4x6:Matt=5.75 8x10:Fénylő=20.00 11x14:Papír=15.35</code>.

source: Cart Location
hu_hu: Kártya helyszíne

source: The placement of the Google Cart on your pages.
hu_hu: Google Cart elhelyezése az oldalaidon.

source: top left
hu_hu: bal felső

source: top right
hu_hu: jobb felső

source: Paypal Integration for Zenphoto.
hu_hu: Paypal integráció Zenphoto részére.

source: adapted as a plugin by
hu_hu: Bővítményként adaptálta:

source: PayPal User ID
hu_hu: PayPal felhasználói ID

source: Your PayPal User ID.
hu_hu: PayPal felhasználói ID-d.

source: Stock
hu_hu: Árukészlet

source: Make payments with PayPal - it's fast, free and secure!
hu_hu: Fizess PayPal segítségével - gyors, ingyenes és biztonságos!

source: Price List
hu_hu: Árlista

source: size
hu_hu: méret

source: media
hu_hu: média

source: price
hu_hu: Ár

source: Enable <strong>FLV</strong> player to handle multimedia files. IMPORTANT: Only one multimedia player plugin can be enabled at the time.<br> Please see <a href='http://www.jeroenwijering.com/?item=JW_FLV_Player'>JW FLV media player </a> for more info about the player and its licence.
hu_hu: Engedélyezd a <strong>FLT</strong> lejátszót, hogy vendégeid a multimédiás fájlokat is élvezhessék. FONTOS: egyszerre csak egy multimédia lejátszó lehet engedélyezve. <br> Kérlek látogass el a <a href='http://www.jeroenwijering.com/?item=JW_FLV_Player'>JW FLV media player </a> oldalra további információkért.

source: flv player width
hu_hu: flv lejátszó szélessége

source: Player width (ignored for <em>mp3</em> files.)
hu_hu: Lejátszó szélessége (<em>mp3</em>-as fájlokra nem érvényes)

source: flv player height
hu_hu: flv lejátszó magassága

source: Player height (ignored for .<em>mp3</em> files if there is no preview image available.)
hu_hu: A lejátszó magassága (nem vonatkozik az <em>mp3</em> fájlokra, ha az előnézet kép nem elérhető.)

source: Backgroundcolor of the controls, in HEX format.
hu_hu: A vezérlők háttérszíne HEXadecimális formában.

source: Frontcolor
hu_hu: Előtér színe

source: Texts & buttons color of the controls, in HEX format.
hu_hu: A vezérlő gombjának és szövegének színe HEXadecimális formában.

source: Lightcolor
hu_hu: Aktivitás színe

source: Rollover color of the controls, in HEX format.
hu_hu: A vezérlők színe, ha az mutató főléjük áll, HEXadecimális formában.

source: Screencolor
hu_hu: Kijelző színe

source: Color of the display area, in HEX format.
hu_hu: A kijelző színe HEXadecimális formában.

source: Displayheight
hu_hu: Kijelző magasság

source: The height of the player display. Generally it should be the same as the height. (ignored for .<em>mp3</em> files if there is no preview image available.)
hu_hu: A lejátszó kijelzőjének magassága. Általában megegyezik a lejátszó magasságával. (nem vonatkozik az <em>mp3</em> fájlokra, ha az előnézet kép nem elérhető.)

source: Adds a link to allow requesting a single image print through Shutterfly.
hu_hu: Lehetővé teszi a képek nyomtatását a Shutterfly szolgáltatásain keresztül.

source: adapted as a plugin by
hu_hu: bővítményként adaptálta

source: Enables jQuery tag suggestions on the search field. Just activate the plugin and the feature is available on the theme's search field.
hu_hu: Engedélyezi a jQuery címke javaslatait a kereső mezőben. Elég aktiválnod ezt a bővítményt, és a funkció elérhető lesz a téma kereső mezőjénél.

source: an adaption of Remy Sharp's
hu_hu: Remy Sharp adaptációja

source: Functions that provide various statistics about images and albums in the gallery.
hu_hu: Ez a bővítmény különböző statisztikákat tesz lehetővé a galéria képeiről és az albumokról.

source: Last update:
hu_hu: Legújabb frissítés:

source: new
hu_hu: új

source: Rating:
hu_hu: Osztályzat:

source: (Votes:
hu_hu: (Szavazatok:

source: Views:
hu_hu: Megtekintések:

source: A plugin to show the content of an media album with .flv/.mp4/.mp3 movie/audio files only as a playlist or as separate players with flv player (some options are also shared with that plugin).
hu_hu: Ez a bővítmény csak lejátszólistaként jeleníti meg a multimédia albumok tartalmát (.flv/.mp4/.mp3 és egyéb videó és audió fájlok), vagy az Flv player segítségével játsza le azt (néhány opció közös ezzel a bővítményel).

source: Requires flvplayer plugin.
hu_hu: Flvplayer bővítményt igényel.

source: Width
hu_hu: Szélesség

source: Player width for the playlist
hu_hu: Lejátszó szélessége a lejátszólistához

source: Height
hu_hu: Magasság

source: Player height for the playlist (ignored for .<em>mp3</em> files if there is no preview image available.)
hu_hu: Lejátszó magassága a lejátszólistához (<em>mp3</em>-as fájlokra nem érvényes, ha az előnézetkép nem elérhrető)

source: Displaywidth
hu_hu: Kijelző szélesség

source: Display width for the playlist. The display width is needed for the playlist menu to be shown. In this case the 'displaywidth - width = width of the playlist menu'. See the flv player site for more info about these options.
hu_hu: A lejátszó kijelzőjének szélessége a lejátszólistánál. Ez a méret a lejátszólista menüjének megjelenítéséhez szükséges. Ebben az esetben a 'kijelző szélesség - szélesség = a lejátszólista szélességével'. Tobábbi információkat az flv player honlapján találhatsz.

source: Display height for the playlist. If the width is too small to show the playlist menu, you can set the height higher to show it below the actual movie display. See the flv player site for more info about these options.
hu_hu: A lejátszólista kijelzőjének magassága. Ha a lejátszólista menüje nem látható, nagyobb értéket adhatsz meg, hogy láthatóvá váljon az aktuális film kijelző alatt. További információk az flv player honlapján találhatóak.

source: Thumbs in playlist
hu_hu: Miniatűrök a lejátszólistán

source: Check if you want that thumbnails of the preview images should be shown in the playlist.
hu_hu: Aktiváld, ha miniatűröket szeretnél a lejátszólistádban.

source: The flv player is not installed. Please install or activate the flv player plugin.
hu_hu: Az flv lejátszó nincs telepétve. Kérlek telepétsd, vagy aktiváld az flv_player bővítményt.

source: The flv player is not installed. Please install or activate the flv player plugin..
hu_hu: Az flv lejátszó nincs telepétve. Kérlek telepétsd, vagy aktiváld az flv_player bővítményt..

source: Adds a theme function printAlbumMenu() to print an album menu either as a nested list up to 4 sublevels (context sensitive) or as a dropdown menu.
hu_hu: Elérhetővé teszi a téma számára printAlbumMenu() függvényt, amely legördülő menüként, vagy akár 4 alkategóriás beágyazott listaként jelenhet meg.

source: Enable <strong>flowplayer</strong> to handle multimedia files. IMPORTANT: Only one multimedia player plugin can be enabled at the time. <br> Please see <a href='http://flowplayer.org'>flowplayer.org</a> for more info about the player and its licence.
hu_hu: Engedélyezd a <strong>flowplayer</strong>-t, hogy vendégeid a multimédiás fájlokat is élvezhessék. FONTOS: egyszerre csak egy multimédia lejátszó lehet engedélyezve. <br> Kérlek látogass el a <a href='http://flowplayer.org'>flowplayer.org</a> oldalra további információkért.

source: Player height (ignored for <em>mp3</em> files.)
hu_hu: Lejátszó magassága (<em>mp3</em>-as fájlokra nem érvényes)

source: to see this player.
hu_hu: a lejátszó használatához.

source: Support for providing Google Maps based on EXIF latitude and longitude in the images.
hu_hu: Google Maps támogatás a kép EXIF hosszúsági- és szélességi fok információja alapján.

source: If you're going to be using Google Maps,
hu_hu: Ha használni szeretnéd a Google Maps-szet,

source: get an API key</a> and enter it here.
hu_hu: szerezz egy API kulcsot</a> és írd be ide.

source: Display a Google Map locating the image.
hu_hu: Google Map megjelenítése a kép helyszíne szerint.
