Repository: dirkhusemann/zenphoto
Catalog: zp-core/locale/*/LC_MESSAGES/zenphoto.po
Languages: hu_hu, sl_si

source: Comment saved successfully.
hu_hu: A hozzászólások sikeresen el lettek mentve.
sl_si: Komentar je uspešno shranjen.

source: You can edit or delete comments on your photos.
hu_hu: Szerkesztheted, vagy törölheted a képeidhez írt hozzászólásokat.
sl_si: Komentarje lahko popravljate ali zbrišete.

source: Are you sure you want to delete these comments?
hu_hu: Biztos, hogy törölni akarod ezt a megjegyzést?
sl_si: Ali ste prepričani, da želite zbrisati te komentarje?

source: Album/Image
hu_hu: Album/Kép
sl_si: Album/Slika

source: Author/Link
hu_hu: Szerző/Link
sl_si: Avtor/Povezava

source: Date/Time
hu_hu: Dátum/Idő
sl_si: Čas

source: View full text
hu_hu: Teljes szöveg
sl_si: Prikaži vse besedilo

source: View truncated
hu_hu: Rövidített szöveg
sl_si: Prikaži skrajšano

source: E&#8209;Mail
sl_si: E&#8209;pošta

source: IP address
hu_hu: IP cím
sl_si: Naslov IP

source: Private
hu_hu: Privát
sl_si: Zasebno

source: Pending<br />approval
sl_si: Čaka na<br />odobritev

source: Delete
hu_hu: Törlés
sl_si: Zbriši

source: <strong>database error</strong>
sl_si: <strong>napaka s podatkovno zbirko</strong>

source: [news]
hu_hu: [újdonságok]
sl_si: [novice]

source: [page]
hu_hu: [lap]
sl_si: [stran]

source: Anonymous posting
sl_si: anonimen prispevek

source: Reply
sl_si: Odgovori

source: Private message
sl_si: Zasebno sporočilo

source: Approve this message
sl_si: Odobri to sporočilo

source: Edit this comment.
hu_hu: Hozzászólás szerkesztése.
sl_si: Uredi ta komentar.

source: Check All
hu_hu: Jelöld ki mindet
sl_si: Označi vse

source: Delete Selected Comments
hu_hu: A kiválasztott hozzászólások törlése
sl_si: Zbriši izbrane komentarje

source: You do not have edit rights on this album.
hu_hu: Nincsen szerkesztési jogod ehhez az albumhoz.
sl_si: Nimate pravic za urejanje tega albuma.

source: zenphoto Create Dynamic Album
hu_hu: zenphoto dinamikus album létrehozás
sl_si: Ustvarjanje Zenphotovega dinamičnega albuma

source: Failed to save the album file
hu_hu: Nem sikerült menteni az album fájlt
sl_si: Nisem mogel shraniti datoteke z albumom

source: Album name:
hu_hu: Album neve:
sl_si: Ime albuma:

source: Create in:
hu_hu: létrehozás itt:
sl_si: Ustvari v:

source: Thumbnail:
hu_hu: Miniatűr:
sl_si: Sličica:

source: most recent
sl_si: najnovejša

source: randomly selected
hu_hu: véletlenszerűen választott
sl_si: naključna

source: Search criteria:
hu_hu: Keresési kritérium:
sl_si: Iskalni kriteriji:

source: Search fields:
hu_hu: Keresési mezők:
sl_si: Polja za iskanje:

source: Create the album
hu_hu: Album létrehozása
sl_si: Ustvari ta album

source: Subalbum order saved
hu_hu: Az alalbumok sorrendje el lett mentve
sl_si: Vrstni red podalbumov je shranjen

source: Hitcounters have been reset
hu_hu: A számláló ki lett nullázva.
sl_si: Števci dostopa so izničeni

source: Edit Album:
hu_hu: Album szerkesztése:
sl_si: Urejanje albuma:

source: Back to the list of albums (go up one level)
hu_hu: Vissza a albumok listájához (egy szintel feljebb)
sl_si: Nazaj na spisek albumov (en nivo višje)

source: Sort Album
hu_hu: Album elrendezése
sl_si: Razvrsti slike

source: You must supply a password.
hu_hu: Választanod kell egy jelszót
sl_si: Vpišite geslo.

source: Your passwords did not match.
hu_hu: A jelszók nem egyeznek.
sl_si: Gesli se ne ujemata.

source: Changes saved
hu_hu: A változások el lettek mentve
sl_si: Spremembe so shranjene

source: There was an error with a move, copy, or rename operation.
hu_hu: Hiba történt az áthelyezés, másolás vagy az átnevezés művelet közben.
sl_si: Prišlo je do napake pri premikanju, kopiranju ali preimenovanju.

source: Images uploaded
hu_hu: A kép fel lett töltve
sl_si: Slike so naložene

source: Album cache purged
sl_si: Predpomnilnik albuma je spraznjen

source: Subalbums
hu_hu: Al-albumok
sl_si: Podalbumi

source: Images
hu_hu: Képek
sl_si: Slike

source: descending
sl_si: padajoče

source: Current sort: <em>%1$s%2$s</em>.
sl_si: Nastavljeno urejanje: <em>%1$s%2$s</em>.

source: Drag the albums into the order you wish them displayed.
hu_hu: Rendezd az albumokat olyan sorrendbe ahogyan szeretnéd, hogy megjelenjenek.
sl_si: Povlecite albume in jih uredite v željeni vrstni red.

source: Select an album to edit its description and data, or
hu_hu: Válassz egy albumot a leírások és egyéb adatok szerkesztéséhez, vagy
sl_si: Izberite album za urejanje opisa in podatkov ali

source: mass-edit all album data
hu_hu: tömegesen szerkeszd az összes album adatait.
sl_si: masovno uredite podatke albumov

source: Has Password
hu_hu: Jelszóval védve
sl_si: Ima geslo

source: Published/Unpublished
hu_hu: Publikált/Nem publikált
sl_si: Objavljeno/Neobjavljeno

source: Cache the album
hu_hu: Album gyorsítótár
sl_si: Napolni predpomnilnik albuma

source: Refresh image metadata
hu_hu: Képek meta-adatainak frissítése
sl_si: Osveži meta podatke slik

source: Reset hitcounters
hu_hu: Számláló nullázása
sl_si: Izniči števce ogledov

source: Save Order
hu_hu: Sorrend mentése
sl_si: Shrani vrstni red

source: Click on the image to change the thumbnail cropping.
sl_si: Kliknite na sliko, če želite nastaviti izrez za sličico.

source: expand all fields
hu_hu: összes mező szétnyitása
sl_si: prikaži vsa polja

source: collapse all fields
hu_hu: összes mező összecsukása
sl_si: skrij polja

source: %s (descending)
sl_si: %s (padajoče)

source: Manual
hu_hu: Manuális
sl_si: Ročno

source: Display images by:
sl_si: Razvrstitev slik:

source: Save changes
sl_si: Shrani spremembe

source: Reset
hu_hu: Visszaállítás
sl_si: Prekliči

source: crop %s
sl_si: izreži %s

source: Dimensions:
sl_si: Dimenzije:

source: Size:
sl_si: Velikost:

source: Select as album thumbnail.
hu_hu: Kiválaszt, mint album miniatűrt.
sl_si: Izberi kot sličico albuma.

source: Title:
hu_hu: Cím:
sl_si: Naslov:

source: General
sl_si: Splošno

source: Allow Comments
hu_hu: Hozzászólások engedélyezése
sl_si: Dovoli komentarje

source: Visible
hu_hu: Látható
sl_si: Vidno

source: Hit counter: <strong>%u</strong>
sl_si: Število ogledov: <strong>%u</strong>

source: Rating: <strong>%u</strong>
sl_si: Ocena: <strong>%u</strong>

source: Rating: Unrated
sl_si: Ocena: Neocenjeno

source: Utilities
sl_si: Razna orodja

source: Move
hu_hu: Áthelyezés
sl_si: Premakni

source: Copy
hu_hu: Másolás
sl_si: Kopiraj

source: Rename File
hu_hu: Fájl átnevezése
sl_si: Preimenuj datoteko

source: Are you sure you want to select this image for deletion?
hu_hu: Biztosan törlésre jelölöd ezt a képet ?
sl_si: Ali ste prepričani, da želite zbrisati to sliko?

source: Delete image.
hu_hu: Kép törlése.
sl_si: Zbriši sliko

source: to
hu_hu: ide/erre:
sl_si: v

source: Image will be deleted when changes are saved.
hu_hu: A kép törölve lesz, amint elmented a vátozásokat.
sl_si: Sliko bom zbrisal, ko boste shranili spremembe.

source: Rotation:
sl_si: Obrni:

source: 90 degrees
sl_si: 90 stopinj

source: 180 degrees
sl_si: 180 stopinj

source: 270 degrees
sl_si: 270 stopinj

source: Tags
hu_hu: Címkék
sl_si: Oznake

source: Description:
hu_hu: Leírás:
sl_si: Opis:

source: Custom data:
hu_hu: Saját adat:
sl_si: Drugi podatki:

source: Location:
hu_hu: Helyszín:
sl_si: Lokacija:

source: City:
hu_hu: Város:
sl_si: Mesto:

source: State:
hu_hu: Állam:
sl_si: Pokrajina:

source: Country:
hu_hu: Ország:
sl_si: Država:

source: Credit:
hu_hu: Szerzők:
sl_si: Avtor:

source: EXIF information:
sl_si: Podrobnosti EXIF:

source: None
hu_hu: Nincs
sl_si: Nič

source: show more fields
hu_hu: mutass több mezőt
sl_si: prikaži več polj

source: show fewer fields
hu_hu: mutass kevesebb mezőt
sl_si: prikaži manj polj

source: Your passwords did not match
hu_hu: A jelszók nem egyeznek
sl_si: Gesli se ne ujemata

source: Save Successful
hu_hu: Sikeresen elmentve
sl_si: Podatki so uspešno shranjeni

source: Edit All Albums in
hu_hu: Minden album szerkesztése ebben:
sl_si: Urejanje vseh albumov

source: Back to the list of albums (go up a level)
hu_hu: Vissza az albumok listájához (egy szintel feljebb)
sl_si: Nazaj na spisek albumov (nivo višje)

source: Edit Gallery
hu_hu: Galéria szerkesztése
sl_si: Urejanje galerije

source: Album order saved
hu_hu: Az album sorrendje el lett mentve
sl_si: Vrstni red albumov je shranjen

source: Hitcounters have been reset.
sl_si: Števci ogledov so izničeni.

source: Cache has been purged.
sl_si: Predpomnilnik je spraznjen.

source: Edit this album
hu_hu: Album szerkesztése
sl_si: Uredi ta album

source: There are no albums for you to edit.
hu_hu: Nincs szerkeszthető album.
sl_si: Tu ni kaj za upravljati.

source: Filename
hu_hu: Fájlnév
sl_si: Datoteka

source: Date
hu_hu: Dátum
sl_si: Datum

source: Title
hu_hu: Cím
sl_si: Naslov

source: Filemtime
hu_hu: Fájl létrehozása
sl_si: Čas datoteke

source: A simpler web photo album
hu_hu: Egy egyszerűbb web-fotóalbum
sl_si: Enostavnejši spletni foto album

source: View Changelog
hu_hu: Változások megtekintése
sl_si: Poglej spisek sprememb

source: Changelog
sl_si: Spisek sprememb

source: Server date: %s
sl_si: Datum na strežniku: %s

source: zenphoto administration
hu_hu: Zenphoto beállítása
sl_si: Administracija Zenphota

source: There was an error logging in.
hu_hu: Hiba a belépés közben.
sl_si: Prišlo je do napake pri prijavi.

source: Check your username and password and try again.
sl_si: Preverite svoje uporabniško ime in geslo ter poskusite znova.

source: A reset request has been sent.
hu_hu: Egy <em>reset</em> kérés el lett küldve.
sl_si: Zahtevek za obnovo je poslan.

source: Login
hu_hu: Bejelentkezés
sl_si: Uporabniško ime

source: Password
hu_hu: Jelszó
sl_si: Geslo

source: *Enter %s to email a password reset.
sl_si: *Vnesite %s, če želite dobiti obnovljeno geslo po e-pošti.

source: Log in
hu_hu: Bejelentkezés
sl_si: Prijava

source: Zenphoto Administration
sl_si: Administracija Zenphota

source: Logged in as %s
sl_si: Prijavljeni kot %s

source: Log Out
hu_hu: Kijelentkezés
sl_si: Odjavi

source: View Gallery: %s
sl_si: Poglej galerijo: %s

source: View Gallery
hu_hu: Galéria megtekintése
sl_si: Glej galerijo

source: overview
hu_hu: áttekintés
sl_si: pregled

source: comments
hu_hu: hozzászólások
sl_si: komentarji

source: upload
hu_hu: feltöltés
sl_si: naloži

source: edit
hu_hu: szerkesztés
sl_si: urejanje

source: tags
hu_hu: címkék
sl_si: oznake

source: options
hu_hu: beállítások
sl_si: možnosti

source: themes
hu_hu: témák
sl_si: teme

source: plugins
hu_hu: bővítmények
sl_si: vtičniki

source: %s failed to delete.
sl_si: Ni mi uspelo zbrisati %s.

source: %s deleted successfully.
sl_si: %s uspešno zbrisan/a.

source: Album Title
hu_hu: Az album Címe
sl_si: Naslov albuma

source: Album Description:
hu_hu: Album leírása:
sl_si: Opis albuma:

source: Album guest user:
hu_hu: Album vendég felhasználó:
sl_si: Gost albuma:

source: Album password:
hu_hu: Album jelszó:
sl_si: Geslo albuma:

source: repeat:
hu_hu: ismétlés:
sl_si: ponovi:

source: Password hint:
hu_hu: Jelszó tipp:
sl_si: Namig za geslo:

source: Custom
hu_hu: Saját
sl_si: Po meri

source: Sort subalbums by:
hu_hu: Al-albumok elrendezése:
sl_si: Razvrščanje podalbumov glede na:

source: gallery album sort order
hu_hu: galéria album sorrendje
sl_si: vrstni red albumov v galeriji

source: parent album subalbum sort order
hu_hu: Szülőalbum al-album sorrendje
sl_si: kot v nadrejenem albumu

source: Descending
hu_hu: Csökkenő
sl_si: Padajoče

source: custom fields:
sl_si: polja po meri:

source: Sort images by:
hu_hu: Képek elrendezése ez szerint:
sl_si: Razvrstitev slik:

source: gallery default image sort order
hu_hu: Alapértelmezett sorrend
sl_si: privzet vrstni red slik v galeriji

source: parent album image sort order
hu_hu: Szülőalbum kép sorrendje
sl_si: kot v nadrejenem albumu

source: Album theme:
hu_hu: Album témája:
sl_si: Tema albuma:

source: Publish
sl_si: Objavi

source: Published
hu_hu: Publikálva
sl_si: Objavljeno

source: Reset Hitcounter (Hits: %u)
sl_si: Izniči števec ogledov (%u)

source: Rename Folder
hu_hu: Mappa átnevezése
sl_si: Preimenuj mapo

source: Dynamic album search:
hu_hu: Keresés dinamikus albumokban:
sl_si: Dinamično iskanje po albumu:

source: Save Album
sl_si: Shrani album

source: Clears the album's cached images.
sl_si: Pobriše prepomnilnik slik za ta album.

source: Clear album cache
sl_si: Pobriši predpomnilnik albuma

source: Cache newly uploaded images.
hu_hu: Újonnan feltöltött képek gyorsítótárazása.
sl_si: Novo naložene slike daj v predpomnilik.

source: Pre-Cache Images
hu_hu: Képek elő-gyorsítótárazása
sl_si: Napolni predpomnilnik slik

source: Forces a refresh of the EXIF and IPTC data for all images in the album.
hu_hu: Kikényszeríti az album összes képének az EXIF és IPTC adat frissítését.
sl_si: Osveži podatke EXIF in PTC za vse slike v tem albumu.

source: Refresh Metadata
hu_hu: Meta-adatok frissítése
sl_si: Osveži meta podatke

source: Resets all hitcounters in the album.
hu_hu: Az album összes számlálójának nullázása
sl_si: Izničenje števila vseh ogledov v albumu.

source: Reset hitcounters
hu_hu: Számlálók nullázása
sl_si: Izniči števce ogledov

source: Edit this album:%s
sl_si: Uredi ta album: %s

source: Edit this album: %s
sl_si: Uredi ta album: %s

source: no images
hu_hu: nincsenek képek
sl_si: ni slik

source: Subalbum List
hu_hu: Al-album lista
sl_si: Spisek podalbumov

source: Password protected
sl_si: Zaščiteno z geslom

source: Unpublish the album %s
sl_si: Umakni objavo albuma %s

source: Publish the album %s
sl_si: Objavi album %s

source: Pre-cache images in %s
sl_si: Napolni predpomnilnik slik v %s

source: Cache the album %s
sl_si: Napolni predpomnilnik albuma %s

source: Refresh metadata for the album %s
sl_si: Osveži meta podatke za album %s

source: Refresh image metadata in the album %s
sl_si: Osveži meta podatke slik v albumu %s

source: Reset hitcounters for album %s
sl_si: Izniči števce ogledov za album %s

source: Reset hitcounters for the album %s
sl_si: Izniči števce ogledov za album %s

source: Are you sure you want to delete this entire album?
hu_hu: Biztosan törölni akarod az egész albumot?
sl_si: Ste prepričani, da želite pobrisati ves ta album?

source: Are you Absolutely Positively sure you want to delete the album? THIS CANNOT BE UNDONE!
hu_hu: Teljes mértékben biztos vagy benne, hogy törölni akarod az albumot? INNEN NINCS VISSZALÉPÉS!
sl_si: Ali ste absolutno prepričani, da želite pobrisati ta album? TEGA KASNEJE NE MORETE RAZVELJAVITI!

source: Delete the album %s
sl_si: Zbriši album %s

source: page %u
sl_si: stran %u

source: Previous page
hu_hu: Előző oldal
sl_si: Prejšnja stran

source: Cannot create new theme.
sl_si: Ne morem ustvariti nove teme.

source: Directory "%s" already exists!
sl_si: Mapa "%s" že obstaja!

source: Cannot find theme directory "%s" to copy!
sl_si: Ne najdem mape za temo "%s". Ne morem kopirati!

source: The <tt>/themes</tt> directory is not writable!
sl_si: Mapa za teme <tt>/themes</tt> je zaklenjena za pisanje!

source: Could not create directory for the new theme
sl_si: Ne morem izdelati mape za novo temo

source: An error occured while copying files. Please delete manually the new theme directory '%s' and retry or copy files manually.
sl_si: Pojavila se je napaka med kopiranjem datotek. Prosim, ročno pobrišite novo mapo za teme '%s' in poskusite ponovno ali pa ročno prekopirajte datoteke.

source: Your theme, based on theme %s
sl_si: Vaša tema, ki temelji na temi %s

source: Your theme
sl_si: Vaša tema

source: New custom theme created successfully!
sl_si: Nova tema po meri je ustvarjena!

source: New custom theme created, but its description could not be updated
sl_si: Nova tema je ustvarjena, vendar ne morem posodobiti njenega opisa

source: admin
sl_si: administratorji

source: gallery
sl_si: galerija

source: general
sl_si: splošno

source: search
hu_hu: Keresés
sl_si: iskalnik

source: image
hu_hu: kép
sl_si: slika

source: comment
sl_si: komentarji

source: theme
sl_si: teme

source: plugin
sl_si: vtičniki

source: Password reset request.<br/>You may now set admin usernames and passwords.
hu_hu: Új jelszó kérése.<br/>Most beállíthatod az admin felhasználókat és jelszavakat.
sl_si: Zahteva po spremembi gesla.<br/>Zdaj lahko nastavite uporabniška imena in gesla za administratorje.

source: Saved
hu_hu: Elmentve
sl_si: Shranjeno

source: You must supply a password
hu_hu: Választanod kell egy jelszót
sl_si: Vpišite geslo

source: Your Allowed tags change did not parse successfully.
hu_hu: Megengedett HTML tag-ek változtatását nem sikerült elemezni.
sl_si: Ne znam razbrati vaših dovoljenih oznak.

source: Your %s passwords were empty or did not match
sl_si: Vaši gesli %s sta prazni ali se ne ujemata

source: You must supply a password for the Gallery guest user
hu_hu: Választanod kell egy jelszót a Vendég felhasználó részére
sl_si: Podati morate geslo za gostujočega uporabnika galerije

source: You must supply a password for the Search guest user
hu_hu: Választanod kell egy jelszót a Kereső vendég felhasználó részére
sl_si: Podati morate geslo za gostujočega uporabnika iskalnika

source: <em>%s</em> is not available.
sl_si: <em>%s</em> ni na voljo.

source: The locale %s is not supported on your server.
sl_si: Jezik %s ni podprt na vašem strežniku.

source: See the troubleshooting guide on zenphoto.org for details.
sl_si: Za podrobnosti si poglejte pomoč (troubleshooting guide) na zenphoto.org.

source: Your Website URL is not valid
hu_hu: A honlapod URL-je nem hibás
sl_si: Spletni naslov (URL) vaše strani ni pravilen

source: Expand all
sl_si: Prikaži vsa polja

source: Collapse all
sl_si: Skrij polja

source: pending verification
sl_si: čaka na overitev

source: Master
sl_si: Glavni administrator

source: Add New Admin
sl_si: Dodaj novega administratorja

source: Authenticate user
sl_si: Avtentikacija uporabnika

source: Are you sure you want to delete this user?
sl_si: Ali ste prepričani, da želite zbrisate tega uporabnika?

source: This is the master user account. If you delete it another user will be promoted to master user.
sl_si: To je glavni račun. Če ga pobrišete, bo račun nekega drugega uporabnika povišan v glavni račun.

source: Delete this user.
hu_hu: Ezen felhasználó törlése
sl_si: Zbriši tega uporabnika.

source: Password:
hu_hu: Jelszó:
sl_si: Geslo:

source: (repeat)
hu_hu: (újra)
sl_si: (ponovi)

source: Rights
hu_hu: Jogok
sl_si: Pravice

source: User admin
hu_hu: Felhasználó kezelő
sl_si: Upravljanje uporabnikov

source: Options
hu_hu: Beállítások
sl_si: Nastavitve

source: Themes
hu_hu: Témák
sl_si: Teme

source: Manage all albums
hu_hu: Összes album meneddzselése
sl_si: Upravlja vse albume

source: Upload
hu_hu: Feltöltés
sl_si: Naloži

source: View all
sl_si: Poglej vse

source: Overview
hu_hu: Áttekintés
sl_si: Pregled

source: Full name:
hu_hu: Teljes név:
sl_si: Polno ime:

source: email:
sl_si: e-pošta:

source: Managed albums:
hu_hu: Meneddzselt albumok:
sl_si: Upravlja albume:

source: This account's username and email are used as contact data in the RSS feeds.
hu_hu: A kontó felhasználói neve és email címe kapcsolattartó adatokként szerepelnek az RSS feedekben .
sl_si: Uporabniško ime in e-pošta tega uporabnika se pojavita v virih RSS.

source: You may manage these albums subject to the above rights.
hu_hu: A fenti jogok alapján menedzselheted ezeket az albumokat.
sl_si: Te albume lahko upravljate glede na zgornje pravice oz. dovoljenja.

source: Select one or more albums for the administrator to manage.
hu_hu: Rendelj az administrátorhoz egy vagy több albumot amelyet menedzselhet majd.
sl_si: Izberite vsaj en album, ki ga upravlja administrator.

source: Administrators with <em>User admin</em> or <em>Manage all albums</em> rights can manage all albums. All others may manage only those that are selected.
sl_si: Administratorji s pravico <em>Upravljanje uporabnikov</em> ali <em>Upravljanje vseh albumov</em> lahko upravlja vse albume. Vsi ostali smejo upravljati le albume, ki so izbrani.

source: save
hu_hu: mentés
sl_si: shrani

source: Server protocol:
hu_hu: Szerver protokollja:
sl_si: Protokol strežnika:

source: If you're running a secure server, change this to
hu_hu: Amennyiben szervered támogatja ezt, megváltoztathatod
sl_si: Če vaš strežnik omogoča varno povezavo, vpišite

source: (Most people will leave this alone.)
hu_hu: -re (általában erre nincs szükség.)
sl_si: (običajno lahko pustite, kot je).

source: Time offset (hours):
hu_hu: Idő eltolódás (órákban):
sl_si: Časovni odmik (v urah):

source: Your server reports its timezone as: <code>%s</code>.
sl_si: Vaš strežnik pravi, da je vaš časovni pas: <code>%s</code>.

source: If you're in a different time zone from your server, set the offset in hours of your timezone from that of the server. For instance if your server is on the US East Coast (<em>GMT</em> - 5) and you are on the Pacific Coast (<em>GMT</em> - 8), set the offset to 3 (-5 - (-8)).
sl_si: Če ste v drugem časovnem pasu kot vaš strežnik, nastavite časovni odmik v urah med obema časovnima pasovoma. Na primer: če je vaš strežnik v Ameriki (<em>GMT</em> - 5) vi pa ste v centralni Evropi (<em>GMT</em> + 1), nastavite odmik na -6.

source: URL options:
sl_si: Možnosti za URL:

source: UTF8 image URIs
sl_si: uporabi UTF8 za URI-je slik

source: mod_rewrite suffix:
sl_si: Pripona za mod_rewrite:

source: If you have Apache <em>mod rewrite</em>, put a checkmark on the <em>mod rewrite</em> option, and you'll get nice cruft-free URLs.
sl_si: Če imate Apache z <em>mod_rewrite</em>, dodajte kljukico k tej možnosti in spletni naslovi (URL) bodo lepši.

source: If you are having problems with images who's names with contain accented characters try changing the <em>UTF8 image URIs</em> setting.
sl_si: Če opažate probleme s slikami, ki imajo v imenu datoteke neangleške znake (recimo šumnike), poskusite preklopiti možnost <em>uporabi UTF8 za URI-je slik</em>.

source: If <em>mod_rewrite</em> is checked above, zenphoto will appended the <em>mod_rewrite suffix</em> to the end of image URLs. (This helps search engines.) Examples: <em>.html, .php, /view</em>, etc.
sl_si: Če ste zgoraj omogočilii <em>mod_rewrite</em>, bo Zenphoto na konec dodal to pripono (to je v pomoč iskalnikom). Primeri: <em>.html, .php, /view</em>, itd.

source: Language:
hu_hu: Nyelv:
sl_si: Jezik:

source: Multi-lingual
hu_hu: Többnyelvűség
sl_si: Večjezično

source: The language to display text in. (Set to <em>HTTP Accept Language</em> to use the language preference specified by the viewer's browser.)
hu_hu: A szöveges üzenetek megjelenítésének nyelve. (Használd a <em>HTTP Accept Language</em>-et ha a látogató böngészőjére bízod a választást.)
sl_si: Jezik besedila vašega Zenphoto spletišča. Če izberete <em>določi jezik iz brskalnika</em>, bo uporabnik videl spletišče v jeziku, ki ga javi njegov brskalnik.

source: Set <em>Multi-lingual</em> to enable multiple languages for database fields.
hu_hu: Engedélyezd a <em>Többnyelvűség</em>-et, ha az adatbázis mezőkben több nyelvet szeretnél használni.
sl_si: Možnost <em>Večjezično</em> vam omogoča nastavljanje imen in opisov slik v različnih jezikih.

source: <strong>Note:</strong> if you have created multi-language strings, uncheck this option, then save anything, you will lose your strings.
sl_si: <strong>Pozor:</strong> Ko odstranite kljukico (in shranite spremembe), izgubite vse opise v drugih jezikih.

source: Date format:
hu_hu: Dátum formátum:
sl_si: Oblika datuma:

source: 2008. February 25. 15:30
hu_hu: 2008. Február 25. 15:30
sl_si: 2008. Februar 25. 15:30

source: 2008. February 25.
hu_hu: 2008. Február 25.
sl_si: 2008. Februar 25.

source: 25 February 2008 15:30
hu_hu: 25 Február 2008 15:30
sl_si: 25 Februar 2008 15:30

source: 25 February 2008
hu_hu: 25 Február 2008
sl_si: 25 Februar 2008

source: 25. February 2008 15:30
hu_hu: 25. Február 2008 15:30
sl_si: 25. Februar 2008 15:30

source: 25. February 2008
hu_hu: 25. Február 2008
sl_si: 25. Februar 2008
