Repository: dirkhusemann/zenphoto
Catalog: zp-core/locale/*/LC_MESSAGES/zenphoto.po
Languages: hu_hu, sl_si

source: February 25, 2008 15:30
hu_hu: Február 25, 2008 15:30
sl_si: Februar 25, 2008 15:30

source: February 25, 2008
hu_hu: Február 25, 2008
sl_si: Februar 25, 2008

source: Format for dates. Select from the list or set to <code>custom</code> and provide a <a href="http://us2.php.net/manual/en/function.strftime.php"><code>strftime()</code></a> format string in the text box.
hu_hu: Dátumok formátuma. Válassz a listából, vagy állítsd <code>saját</code>-ra és add meg <a href="http://us2.php.net/manual/en/function.strftime.php"><code>strftime()</code></a> string formátumát.
sl_si: Oblika za datume. Izberite obliko s seznama oz. izberite <code>po meri</code> in v polje vpišite obliko datuma, kot ga prepozna funkcija <a href="http://us2.php.net/manual/en/function.strftime.php"><code>strftime()</code></a>.

source: Charset:
hu_hu: Betű kódolás:
sl_si: Kodna tabela znakov:

source: The character encoding to use internally. Leave at <em>Unicode (UTF-8)</em> if you're unsure.
hu_hu: Ha nem tudod mi ez, hagyd az <em>Unicode (UTF-8)</em>-at.
sl_si: Kodna tabela znakov za uporabo znotraj Zenphota. Pustite <em>Unicode (UTF-8)</em>, če niste prepričani kaj izbrati.

source: Captcha generator:
sl_si: Generator Captcha:

source: Select the <em>Captcha</em> generator to be used by Zenphoto.
sl_si: <em>Captcha</em> je način za ugotavljanje, ali je obiskovalec vaše galerije človek ali spretno napisan program (imenovan tudi bot). Captcha običajno od obiskovalca zahteva, da prepiše znake, ki so deformirani, delno zakriti ali kako drugače zabrisani. Ljudem je to enostavno, botom pa relativno težko. Ker bote običajno uporabljajo razpečevalci neželene vsebine (spama) jih - razumljivo - ne želimo med svojimi obiskovalci.

source: Allowed tags:
hu_hu: Megengedett HTML tag-ek:
sl_si: Dovoljene oznake:

source: restore default allowed tags
sl_si: povrni tovarniško dovoljene oznake

source: Tags and attributes allowed in comments, descriptions, and other fields.
sl_si: Oznakee in atributi, ki so dovoljeni v komentarjih, opisih in drugih poljih.

source: Follow the form <em>tag</em> =&gt; (<em>attribute</em> =&gt; (<em>attribute</em>=&gt; (), <em>attribute</em> =&gt; ()...)))
hu_hu: Például: <em>tag</em> =&gt; (<em>attribútum</em> =&gt; (<em>attribútum</em>=&gt; (), <em>attribútum</em> =&gt; ()...)))
sl_si: Uporabite obliko <em>oznaka</em> =&gt; (<em>atribut</em> =&gt; (<em>atribut</em>=&gt; (), <em>atribut</em> =&gt; ()...)))

source: Check <em>restore default allowed tags</em> to reset allowed tags to the zenphoto default values.
sl_si: Povrne 'tovarniške' nastavitve za dovoljene oznake.

source: Gallery title:
hu_hu: Galéria megnevezése:
sl_si: Naslov galerije:

source: What you want to call your photo gallery.
hu_hu: Itt megadhatod a galériád címét.
sl_si: Ime, ki ga želite za svojo galerijo.

source: Gallery description:
hu_hu: Galéria leírása:
sl_si: Opis galerije:

source: A brief description of your gallery. Some themes may display this text.
hu_hu: Galériád rövid leírása. Némelyik téma képes ezt megjeleníteni.
sl_si: Kratek opis vaše galerije. Nekatere teme prikažejo to besedilo.

source: Gallery guest user:
hu_hu: Galéria vendég felhasználója:
sl_si: Gostujoči uporabnik galerije:

source: User ID for the gallery guest user
hu_hu: Galéria vendég felhasználójának ID-je (neve).
sl_si: Uporabniško ime za gostujočega uporabnika galerije

source: Gallery password:
hu_hu: Galéria jelszó:
sl_si: Geslo galerije:

source: Master password for the gallery. If this is set, visitors must know this password to view the gallery.
hu_hu: A galéria jelszava. Ha be van állítva, a látogatóknak ismerniük kell, hogy beléphessenek a galériába.
sl_si: Glavno geslo celotne galerije. Če je nastavljeno, morajo obiskovalci vedeti to geslo, če želijo videti slike.

source: Gallery password hint:
hu_hu: Galéria jelszó emlékeztető:
sl_si: Namig za geslo galerije:

source: A reminder hint for the password.
hu_hu: Emlékeztető tipp a jelszóhoz.
sl_si: Namig, da se lažje spomnite gesla.

source: Website title:
hu_hu: Honlap megnevezése:
sl_si: Ime spletne strani:

source: Your web site title.
hu_hu: Honlapod megnevezése.
sl_si: Ime vaše spletne strani.

source: Website url:
hu_hu: Honlap URL címe:
sl_si: Spletni naslov (URL):

source: This is used to link back to your main site, but your theme must support it.
hu_hu: Erre azért lehet szükség, hogy vissza léphess a főoldalra, de ezt a témádnak is támogatnia kell.
sl_si: To je povezava do vaše glavne spletne strani. Če tema to podpira, bo ta povezava prikazana v galeriji.

source: Sort gallery by:
hu_hu: Galéria elrendezése ez szerint:
sl_si: Razvrstitev albumov:

source: Gallery behavior:
sl_si: Lastnosti galerije:

source: Use latest image date as album date
sl_si: Uporabi datum zadnje slike za datum albuma

source: enable user name login field
sl_si: prijavno polje za uporabnike

source: visual thumb selection
sl_si: sličice v izbirnikih

source: enable persistent archives
sl_si: trajni paketi

source: enable gallery sessions
sl_si: omogoči seje

source: If you wish your album date to reflect the date of the latest image uploaded set set this option. Otherwise the date will be set initially to the date the album was created.
sl_si: Dodajte kljukico, če želite, da bo datum albuma enak zadnji dodani sliki. Če kljukice ni, bo datum albuma tak, kot ga nastavite ročno (na začetku je to čas, ko ste album dodali galeriji).

source: This option places a field on the gallery (search, album) login form for entering a user name. This is necessary if you have set guest login user names. It is also useful to allow Admin users to log in on these pages rather than at the Admin login.
hu_hu: Ez az opció elhelyez egy felhasználói név mezőt a galéria oldalain (keresés, album), hogy meg lehessen adni a felhasználónevet. Erre akkor lehet szükség, ha vannak vendégfelhasználóid. Szintén hasznos lehet az Admin felhasználók beléptetéséhez.
sl_si: Kljukica pomeni, da se bo v galeriji pojavilo polje za vnos uporabniškega imena. To je potrebno, če ste pripravili uporabniška imena za goste. Zelo prikladno je tudi za prijavo administratorjev, ki jim tako ni potrebno odpirati posebne strani za prijavo administratorjev.

source: Setting this places thumbnails in the album thumbnail selection list (the dropdown list on each album's edit page). In Firefox the dropdown shows the thumbs, but in IE and Safari only the names are displayed (even if the thumbs are loaded!). In albums with many images loading these thumbs takes much time and is unnecessary when the browser won't display them. Uncheck this option and the images will not be loaded.
sl_si: Ta možnost omogoča prikaz sličic v izbirnikih, kjer izbiramo naslovno sličico za album (padajoči meni na strani za urejanje albuma). Nekateri brskalniki tega ne podpirajo dobro, tako da morda ne boste videli sličic, četudi ste to možnost potrdili. Če sličic ne vidite, potem je bolje, da možnost izklopite, saj se bo stran za urejanje albuma tako hitreje naložila.

source: <strong>Note: </strong>Setting this option may impact password protected albums!
hu_hu: <strong>Figyelem: </strong> Ez a beállítás ütközhet a jelszóval védett albumokkal!
sl_si: <strong>Pozor: </strong>Če nastavite kljukico, bo to morda imelo vpliv na albume, ki so zaščiteni z geslom!

source: Check this option if you are having issues with album password cookies not being retained. Setting the option causes zenphoto to use sessions rather than cookies.
sl_si: Postavite kljukico, če morate vedno znova vpisovati geslo za albume. Ta nastavitev povzroči, da Zenphoto uporabi seje namesto piškotkov za pomnjenje gesel.

source: Search guest user:
hu_hu: Kereső vendég felhasználó:
sl_si: Geslo za gostujočega uporabnika iskalnika:

source: User ID for the search guest user
hu_hu: Kereső vendég felhasználójának ID-je (neve).
sl_si: Uporabniško ime za uporabnika, ki sme iskati

source: Search password:
hu_hu: Jelszó kereséshez:
sl_si: Geslo za iskanje:

source: Password for the search guest user. If this is set, visitors must know this password to view search results.
sl_si: Geslo za uporabo iskanja za goste. Če je nastavljeno to geslo, ga morajo obiskovalci vpisati, če želijo uporabiti iskanje v galeriji.

source: Search password hint:
hu_hu: Keresési jelszó emlékeztető:
sl_si: Namig za geslo za iskanje:

source: Search behavior settings:
sl_si: Lastnosti iskalnika:

source: exact
sl_si: natančno

source: partial
sl_si: delno

source: Fields list:
sl_si: Iskalna polja:

source: Search behavior settings.
sl_si: Nastavitve iskalnika.

source: <em>Field list</em> is the set of fields on which searches may be performed.
sl_si: <em>Iskalna polja</em> so polja, po katerih se lahko išče.

source: Number of RSS feed items:
hu_hu: Tételek száma az RSS feed -ben:
sl_si: Število novic v viru RSS:

source: Images RSS
sl_si: RSS za slike

source: Albums RSS
sl_si: RSS za albume

source: The number of new items you want to appear in your site's RSS feed. The images and comments RSS share the value.
sl_si: Število novih elementov, ki se pojavijo v viru RSS. Število velja tako za slike kot komentarje v svojem RSS.

source: Size of RSS feed images:
hu_hu: RSS feed képeinek mérete:
sl_si: Velikost slik v viru RSS:

source: The size you want your images to have in your site's RSS feed.
hu_hu: Az RSS feed-ben szereplő képek méretei.
sl_si: Sistem RSS je relativno neučinkovit, zato priporočam raje manjšo velikost za slike.

source: RSS feed sort order:
sl_si: vrstni red virov RSS:

source: latest by id
sl_si: zadnje glede na ID

source: latest by date
sl_si: zadnje glede na datum

source: latest by mtime
sl_si: zadnje glede na čas datoteke

source: latest updated
sl_si: zadnje posodobljeno

source: RSS enclosure:
sl_si: "enclosure" za RSS:

source: Media RSS:
sl_si: RSS z mediji:

source: You must supply a password for the Protected image user
sl_si: Podati morate geslo za uporabnika z dovoljenjem za zaščitene slike

source: Default sort order for images.
sl_si: Privzet vrstni red slik.

source: Custom sort values must be database field names. You can have multiple fields separated by commas.
sl_si: Vrstni red po meri ureja glede na polja v podatkovni zbirki. Navedete lahko več polj, ki jih ločite z vejico.

source: Image quality:
hu_hu: Kép minősége:
sl_si: Kakovost slik:

source: Normal Image
sl_si: Običajna slika

source: <em>full</em> Image
sl_si: <em>Izvorna</em> slika

source: Thumbnail
sl_si: Sličica

source: Compression quality for images and thumbnails generated by Zenphoto.
sl_si: Stopnja kakovosti stiskanja JPEG za slike in sličice (večja številka je boljša kakovost).

source: Auto rotate images:
sl_si: Samodejno obrni slike:

source: Automatically rotate images based on the EXIF orientation setting.
sl_si: Zenphoto bo samodejno obrnil sliko glede na zapis EXIF (ki ga pripravi vaš fotoaparat, če to podpira).

source: Image rotation requires the <em>imagerotate</em> function found in PHP version 4.3 or greater's bundled GD library.
sl_si: Za obračanje slike je potrebna funkcija <em>imagerotate</em>, ki je del knjižnice GD v PHP različica 4.3 (ali novejša).

source: Allow upscale:
hu_hu: Nagyítás engedélyezése:
sl_si: Dovoli povečavo:

source: Allow images to be scaled up to the requested size. This could result in loss of quality, so it's off by default.
hu_hu: Képek méretének megnagyobbítása a kívánt méretre. Ez a minőség rovására mehet, ezért általában ki van kapcsolva.
sl_si: Poveča slike, če so manjše od nastavljene velikosti. Običajno se pri tem kakovost poslabša, zato je možnost sprva izključena.

source: Sharpen:
hu_hu: Élesítés:
sl_si: Ostrenje:

source: Amount
sl_si: Jakost

source: Radius
sl_si: Radij

source: Threshold
sl_si: Prag

source: Add an unsharp mask to images and/or thumbnails. <strong>Warning</strong>: can overload slow servers.
sl_si: Uporabi poseben filter <em>unsharp mask</em>, ki naredi slike oz. sličice na pogled bolj ostre. <strong>Pozor</strong>: to je dodatna obremenitev za strežnik.

source: <em>Amount</em>: the strength of the sharpening effect. Values are between 0 (least sharpening) and 100 (most sharpening).
sl_si: <em>Jakost</em>: moč učinka ostrenja. Število med 0 in 100 (večja številka pomeni bolj ostro).

source: <em>Radius</em>: the pixel radius of the sharpening mask. A smaller radius sharpens smaller details, and a larger radius sharpens larger details.
sl_si: <em>Radij</em>: radij maske ostrenja v pikslih. Manjši radij poostri manjše podrobnosti, večji radij pa učinkuje na večje podrobnosti slike.

source: <em>Threshold</em>: the color difference threshold required for sharpening. A low threshold sharpens all edges including faint ones, while a higher threshold only sharpens more distinct edges.
sl_si: <em>Prag</em>: razlika v barvi med sosednjima območjema, ki sproži ostrenje. Nizek prag povzroči ostrenje vseh robov, tudi tistih bolj bledih, visok prag pa poostri le bolj izrazite robove.

source: Watermark images:
hu_hu: Vízjel kép:
sl_si: Vodni žig:

source: watermark with
sl_si: ožigosaj z

source: cover
hu_hu: fedje le a kép
sl_si: pokrij

source: % of image
sl_si: % slike

source: allow upscale
hu_hu: nagyítható
sl_si: dovoli povečavo

source: offset h
hu_hu: eltolás V:
sl_si: vodoravni odmik:

source: % w,
hu_hu: %, H:
sl_si: %, navpični odmik:

source: The watermark image is scaled by to cover <em>cover percentage</em> of the image and placed relative to the upper left corner of the image.
hu_hu: A vízjel az eredeti kép százalékban megadott területét fedi le, és a bal felső saroktól viszonyítva helyezkedik el.
sl_si: Slika vodnega žiga je skalirana tako, da pokrije izbran delež pokritosti, postavljena pa je v sliko relativno na levi zgornji kot.

source: It is offset from there (moved toward the lower right corner) by the <em>offset</em> percentages of the height and width difference between the image and the watermark.
hu_hu: Az <em>eltolás</em> százalékban megadott érték, a kép és a vízjel méretei közötti eltérés, a jobb felső saroktól (a bal alsó sarok felé haladva).
sl_si: Od tega kota je odmaknjena proti desnemu spodnjemu kotu za izbran delež razlike višine in širine med sliko in vodnim žigom (0% odmika pomeni levi zgornji kot, 100% odmika pa desni spodnji kot).

source: If <em>allow upscale</em> is not checked the watermark will not be made larger than the original watermark image.
hu_hu: Ha a <em>nagyítható</em> opció nincs kipipálva, a vízjel nem lesz nagyobb, mint az eredeti vízjel kép.
sl_si: Če pri <em>dovoli povečavo</em> ni kljukice, potem vodni žig nikoli ne bo povečan preko velikosti originalne slike vodnega žiga.

source: Watermark thumbnails:
sl_si: Vodni žig za sličice:

source: The watermark image that will be overlayed on the thumbnail.
sl_si: Z vodnim žigom lahko ožigosate tudi sličice. Podobno kot zgoraj lahko izberete sliko vodnega žiga.

source: Full image protection:
hu_hu: Teljesméretű kép védelme:
sl_si: Zaščita izvorne slike:

source: Unprotected
hu_hu: Védelem nélküli
sl_si: Nezaščiteno

source: Protected view
hu_hu: Védett nézet
sl_si: Zaščiten ogled

source: Download
hu_hu: Letöltés
sl_si: Možen prenos

source: No access
hu_hu: Nincs hozzáférés
sl_si: Ni dostopa

source: Disable hotlinking
hu_hu: Hotlinkelés tiltása
sl_si: Onemogoči zunanje povezave (hotlinking)

source: cache the full image
sl_si: predpomni izvorne slike

source: user:
sl_si: uporabnik:

source: password:
sl_si: geslo:

source: hint:
sl_si: namig:

source: Disabling hotlinking prevents linking to the full image from other domains. If enabled, external links are redirect to the image page. If you are having problems with full images being displayed, try disabling this setting. Hotlinking is not prevented if <em>Full&nbsp;image&nbsp;protection</em> is <em>Unprotected</em> or if the image is cached.
sl_si: Onemogočene zunanje povezave (hotliniking) preprečujejo dostop do izvorne slike iz druge domene. Če ima ta opcija kljukico, potem bojo vse povezave na originalno sliko preusmerjene na vašo stran s sliko. Če imate težave s prikazom izvorne slike, potem poskusite brez kljukice. Preprečevanje ne deluje, če ste izbrali <em>Nezaščiteno</em>.

source: Use lock image
hu_hu: Használd a lakat képet
sl_si: Uporabi sliko ključavnice

source: Enabled
hu_hu: Engedélyezve
sl_si: Omogoči

source: EXIF display
sl_si: Prikaz EXIF

source: IPTC encoding:
sl_si: Kodiranje IPTC:

source: The default character encoding of image IPTC metadata.
sl_si: Kodiranje znakov podatkov IPTC za slike.

source: Enable comment notification:
hu_hu: Értesítés új hozzászólásokról:
sl_si: Opozori na komentarje:

source: Email the Admin when new comments are posted
hu_hu: Admin értesítése új hozzászólások esetén.
sl_si: Ko kdorkoli napiše nov komentar, administrator dobi o tem sporočilo po e-pošti.

source: Spam filter:
hu_hu: Spam szűrés:
sl_si: Filter vsiljene vsebine:

source: The SPAM filter plug-in you wish to use to check comments for SPAM
hu_hu: A hozzászólásokhoz használt SPAM szűrő bővítmény.
sl_si: Vtičnik za izločanje vsiljene vsebine (SPAM), ki ga želite uporabiti za čiščenje komentarjev.

source: Require fields:
hu_hu: Kötelező mezők:
sl_si: Zahtevana polja:

source: Checked fields must be valid in a comment posting.
hu_hu: A kipipált mezőknek érvényesnek kell lenniük a hozzászólás elküldésekor.
sl_si: Obiskovalci galerije morajo pri pisanju komentarja izpolniti vsa tu označena polja.

source: There are no themes for which you have rights to administer.
hu_hu: Nincsenek témák, amelyekhez adminisztrátori jogaid lennének.
sl_si: Ni nobene take teme, za katero imate pravico upravljanja.

source: Theme for <code><strong>%1$s</strong></code>: <em>%2$s</em>
sl_si: Tema za <code><strong>%1$s</strong></code>: <em>%2$s</em>

source: Show theme for:
sl_si: Pokaži temo za:

source: <strong>Standard options</strong>
hu_hu: <strong>Alapvető beállítások</strong>
sl_si: <strong>Običajne možnosti</strong>

source: These image and album presentation options are standard to all themes.
hu_hu: Ezen kép és album megjelenítési beállítások mértékadóak az összes témánál.
sl_si: Te možnosti so skupne vsem temam.

source: Albums per page:
hu_hu: Albumok oldalanként:
sl_si: Število albumov na strani:

source: Controls the number of albums on a page. You might need to change this after switching themes to make it look better.
hu_hu: Szabályozza az albumok számát az oldalon. Változtathatsz rajta új témák választása után, hogy a témák jobban nézzenek ki.
sl_si: Določa število albumov na strani. Ko zamenjate temo, poskusite spremeniti to vrednost, morda bo galerija izgledala bolje.

source: Images per page:
hu_hu: Képek oldalanként:
sl_si: Število sličic na strani:

source: Controls the number of images on a page. You might need to change this after switching themes to make it look better.
hu_hu: Szabályozza a képek számát az oldalon. Változtathatsz rajta új témák választása után, hogy a témák jobban nézzenek ki.
sl_si: Določa število sličic na strani. Ko zamenjate temo, poskusite spremeniti to vrednost, morda bo galerija izgledala bolje.

source: Thumb size:
hu_hu: Miniatűr mérete:
sl_si: Velikost sličic:

source: Default thumbnail size and scale.
hu_hu: Alapértelmezett miniatűr méret.
sl_si: Privzeta velikost sličic oz. razmerje velikosti sličic napram velikosti slik.

source: Crop thumbnails:
hu_hu: Miniatűrök levágása:
sl_si: Izrez sličic:

source: If checked the thumbnail cropped to the <em>width</em> and <em>height</em> indicated.
sl_si: Dodajte kljukico, če želite, da so sličice izrezi vaših slik. Izrezi imajo velikost, ki jo vpišete zraven.

source: <strong>Note</strong>: changing crop height or width will invalidate existing crops.
sl_si: <strong>Opomba</strong>: vsaka sprememba teh nastavitev bo povzročila, da se sličice na novo sprocesirajo.

source: Grayscale conversion:
sl_si: Pretvorba v črnobelo:

source: thumbnail
sl_si: sličica

source: If checked, images/thumbnails will be created in grayscale.
sl_si: Če želite slike in sličice v črnobeli (sivinski) tehniki.

source: Image size:
hu_hu: A kép mérete
sl_si: Velikost slike:

source: height
sl_si: višina

source: width
sl_si: širina

source: shortest side
sl_si: krajša stranica

source: longest side
sl_si: daljša stranica

source: Default image display size.
sl_si: Privzeta velikost slik.

source: The image will be sized so that the <em>height</em>, <em>width</em>, <em>shortest side</em>, or the <em>longest side</em> will be equal to <em>image size</em>.
sl_si: Slika bo skalirana tako, da bo <em>višina</em>, <em>širina</em>, <em>krajša stranica</em> oziroma <em>daljša stranica</em> enaka vpisani številki.

source: Custom index page:
sl_si: Naslovna stran po meri:

source: If this option is not empty, the Gallery Index URL that would normally link to the theme <code>index.php</code> script will instead link to this script. This option applies only to the main theme for the <em>Gallery</em>.
sl_si: Naslovna stran galerije je <code>index.php</code> (tako je, če pustite to možnost prazno), tu pa lahko izberete drugo. Ta možnost velja le za glavno temo <em>galerije</em>.

source: User registration page:
sl_si: Stran za prijavo uporabnikov:

source: script
sl_si: skript

source: Link text
sl_si: Besedilo povezave

source: Hint text
sl_si: Besedilo namiga

source: If this option is not empty, the visitor login form will include a link to this page. The link text will be labeled with the text provided.
sl_si: Določite lahko posebno stran za prijavo uporabnikov. Besedilo in besedilo namiga se uporabita za povezavo do te strani.

source: <strong>Custom theme options</strong>
hu_hu: <strong>Saját téma beállítások</strong>
sl_si: <strong>Možnosti posameznih tem</strong>

source: The following are options specifically implemented by the theme.
hu_hu: A következő beállítások kifejezetten a témákra alkalmazhatóak.
sl_si: Te možnosti so lastne posameznim temam.

source: Expand plugin options
hu_hu: Bővítmény beállítások szétnyitása
sl_si: Pokaži vse možnosti za vtičnike

source: Collapse all plugin options
hu_hu: Bővítmény beállítások összecsukása
sl_si: Skrij vse možnosti za vtičnike

source: There are no plugin options to administer.
hu_hu: Nincs beállítható bővítmény opció.
sl_si: Tu ni kaj za upravljati.

source: Plugins provide optional functionality for Zenphoto.
hu_hu: A bővítmények kiterjesztik a zenphoto képességeit.
sl_si: Vtičniki omogočajo dodatne funkcije za uporabo Zenphota.

source: They may be provided as part of the Zenphoto distribution or as offerings from third parties.
sl_si: Včasih so že dodani originalni kopiji Zenphota ali pa jih ponuja kdo tretji.

source: Plugins are placed in the <code>zp-core/plugins</code> folder and are automatically discovered.
hu_hu: A bővítmények a <code>zp-core/plugins</code> mappában helyezhetőek el, és automatikusan fel lesznek ismerve.
sl_si: Vtičniki so shranjeni v mapi <code>zp-core/plugins</code> in jih ni potrebno nič namestiti.

source: If the plugin checkbox is checked, the plugin will be loaded and its functions made available to theme pages. If the checkbox is not checked the plugin is disabled and occupies no resources.
hu_hu: Ha a bővítményt aktiválod, az betöltődik és funkciói elérhetőek lesznek a témák számára. Ha nincs aktiválva, nem lesz betöltve és nem foglalja le az erőforrásokat.
sl_si: Če k vtičniku dodate kljukico, se bo naložil in njegove funkcije bodo na voljo za uporabo. Če kljukice ni, potem je vtičnik onemogočen in ne zaseda nobenih sistemskih virov.

source: <strong>Note</strong>: Not all themes are setup with support for all plugins! You may need to add the plugin theme functions of some of them yourself.
sl_si: <strong>Opomba</strong>: Nimajo vse teme podpore za vse vtičnike! Morda boste morali kakšne teme sami popraviti, da bodo vtičniki delovali.

source: Available Plugins
sl_si: Nameščeni vtičniki

source: Description
hu_hu: Leírás
sl_si: Opis
